{"codigo":214,"nome":"ENGENHARIA DE PRODUÇÃO MECÂNICA","sigla_centro":"CTC","sigla_departamento":"EPS","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"19891":19891,"19911":19911,"20071":20071},"situacao":0,"situacao_descricao":"regular","num_vagas_total":120,"num_vagas_primeiro_semestre":0,"num_vagas_segundo_semestre":0,"presencial":true,"curriculos":{"19891":{"id":"118","codigo":19891,"codigo_curso":214,"carga_horaria_ufsc":4446,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":27,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19891 (EXTINTO)","ucs":[]},"19911":{"id":"119","codigo":19911,"codigo_curso":214,"carga_horaria_ufsc":4518,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":27,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19911 (EXTINTO)","ucs":{"EGR5213":{"codigo":"EGR5213","nome":"Representação Gráfica Espacial","ementa":"Introdução sobre o funcionamento do sistema visual humano; Formas de visualização humana; Sistema de projeção ortogonal Mongeano; Elementos básicos de construção - ponto, reta, e plano; Mecanismos de determinação de verdadeira grandeza - Rebatimento e Mudança de plano; Construção de objetos (modelagem) envolvendo, intersecção, secção e planificação.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EGR5212","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5120":{"codigo":"EPS5120","nome":"Introdução a Engenharia de Produção","ementa":"Diretrizes curriculares. Perfil do profissional. Evolução da engenharia. Desenvolvimento econômico e capacitação C&T. Contextualização da Eng. de Produção. Produção na organização. Fronteiras da Função Produção. Modelo de transformação. Objetivos da produção. Estratégia de produção. Princípios gerais de projeto em produção: projeto de produtos e serviços e projeto de processos. Natureza do planejamento e controle na produção. Noções de Metodologia Científica e de Comunicação Técnica.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EPS1120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EQA5116":{"codigo":"EQA5116","nome":"Química Tecnológica","ementa":"Estequiometria,  mol.  Combustão.  Combustíveis  sólidos,  liquidos  e  gasosos. Estrutura  quimica  de  polimeros.  Cristalinidade.  Propriedades  quimicas. Propriedades  mecânicas.  Principais  polimeros  de  uso  geral.  Siderurgia:  obtenção  do  ferro  gusa  e  do  aço.  Aços  especiais.  Oxidação-redução. Equação  de  Nernst.  Corrosão  metálica.  Tratamento  de  águas  para  caldeiras.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EQA5113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5102":{"codigo":"FSC5102","nome":"Física Básica I","ementa":"Introdução aos conceitos fundamentais da cinemática e dinâmica. Leis de conservação da energia e do momento linear. Cinemática e dinâmica da rotação.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"FSC5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5161":{"codigo":"MTM5161","nome":"Cálculo A","ementa":"Funções reais de variável real. Funções elementares. Noções sobre limite e continuidade. A derivada. Aplicações da derivada. Integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM1161","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5223":{"codigo":"MTM5223","nome":"Álgebra Linear e Geometria Analítica","ementa":"Matrizes. Sistemas lineares. Espaço vetorial Rn. Produtos em um espaço vetorial. Estudo da reta e do plano. Transformação linear. Curvas planas. Superfícies.","carga_horaria":108,"fase_sugestao":1,"equivalencia":"MTM5512 e MTM5245","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5604":{"codigo":"EGR5604","nome":"Desenho Técnico I","ementa":"Introdução ao Desenho Técnico à mão livre. Normas para o desenho. Técnicas fundamentais de traçado à mão livre. Sistemas de representação: 1º e 3º diedros. Projeção ortogonal de peças simples. Vistas omitidas. Cotagem e proporções. Perspectiva axométrica, isométrica, bimétrica, trimétrica. Perspectiva cavaleira. Esboços cotados. Sombras próprias. Esboços sombreados.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"EGR5214 ou EGR5623 ou RTS1604 ou RTS5604","prerequisito":"EGR5213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5234":{"codigo":"EPS5234","nome":"Análise de Sistemas de Produção","ementa":"Conceitos, definições e propriedades de sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; caracterização do sistema, subsistemas e supersistema; caracterização do modelo conceitual; comparação do modelo conceitual com a situação de problema; definição de mudanças possíveis; determinação de ações e melhorias. Teoria de Sistemas aplicada à Engenharia de Produção. Sistemas Organizacionais: marketing, produção, materiais, pessoal, finanças\/controladoria e informática. Abordagem sistêmica para a decisão em sistemas de produção","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EPS5229","prerequisito":"EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7001":{"codigo":"EPS7001","nome":"Informática para Engenharia de Produção","ementa":"Conceitos básicos. Principais aplicativos para engenheiros de Produção. Estrutura de dados. Algoritmos: formulação, representação e noções de complexidade. Linguagem de programação: estrutura, tipos de dados simples e estruturados, instruções de repetição, funções e procedimentos. Noções de orientação a objetos. Fundamentos em Bancos de Dados Relacionais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"INE5201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5103":{"codigo":"FSC5103","nome":"Estática para Engenharia","ementa":"Estudo  das  condições  de  equilíbrio  de  partículas  e  de  corpos  rígidos  (estruturas,  vigas,  treliças  etc)  no  plano  e  no  espaço,  envolvendo  o  cálculo  das  reações  em  conexões  padrão  utilizadas  em  engenharia;  cálculo  de  forças  axiais,  esforços  cortantes  e  momentos  fletores  em  estruturas  e  vigas;  cálculo  de  centróides  de  áreas  e  de  volumes  de  figuras  simples  e  de  figuras  compostas;  cálculo  de  momentos  de  inércia  de  chapas  planas  simples  e  compostas  e  de  sólidos  simples  e  compostos;  equilíbrio  de  cabos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5050","prerequisito":"(FSC5102 e MTM5161) ou (FSC5101 e MTM5161)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5124":{"codigo":"FSC5124","nome":"Física Experimental para Engenharia A","ementa":"Instrumentos  de  medição.  Erros.  Traçado  de  gráficos.  Experimentos  típicos  de  física  básica.  Discussão  dos  experimentos.  Confecção  de  relatórios.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"FSC5122","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5137":{"codigo":"FSC5137","nome":"Ondas e Calor","ementa":"O  oscilador  harmônico,  oscilações  amortecidas  e  forçadas,  ondas,  som,  temperatura;  calor  e  primeira  lei  da  termodinâmica;  propriedades  dos  gases;  a  segunda  lei  da  termodinâmica;  teoria  cinética  dos  gases;  noções  de  mecânica  estatística.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5132","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5162":{"codigo":"MTM5162","nome":"Cálculo B","ementa":"Métodos de integração; aplicações da integral definida; integrais impróprias; funções de várias variáveis; derivadas parciais; aplicações das derivadas parciais; integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM1162","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5623":{"codigo":"EGR5623","nome":"Desenho Técnico para Engenharia Mecânica","ementa":"Introdução ao Desenho Técnico à instrumentos; Concordâncias e terminais; Cotas, Escalas e Sinais de acabamento; Vistas auxiliares; Cortes e Seções; Tolerâncias e ajustes mecânicos; Desenho de elementos de máquinas; de união e de transmissão; Desenho de conjunto e detalhes; Desenho de tubulações industriais.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EGR5214 ou RTS1623 ou RTS5623","prerequisito":"EGR5604","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5133":{"codigo":"FSC5133","nome":"Física Teórica B","ementa":"Carga elétrica. Campo elétrico. Lei de Gauss. Potencial. Capacitores. Corrente elétrica. Força eletromotriz e circuitos. Campo magnético. Lei de Ampére. Lei de Faraday. Indutância. Propriedades magnéticas da matéria. Óptica física: Interferência, difração, polarização. Física quântica. Ondas e partículas.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"FSC1133","prerequisito":"FSC5101 e MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5202":{"codigo":"INE5202","nome":"Cálculo Numérico em Computadores","ementa":"Erros e Sistemas de Numeracão. Solução de equações algébricas e transcendentais. Solução de equações polinomiais. Sistemas de equações lineares e não lineares. Interpolação Ajustamento de curvas. Integração numérica. Solução numérica de equações diferenciais ordinárias e sistemas de equações diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"Inválida: (CEC1103 ou CEC5202) e (EPS7001INE5232) ou ","prerequisito":"EPS7001 e MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5163":{"codigo":"MTM5163","nome":"Cálculo C","ementa":"Noções de cálculo vetorial; integrais curvilíneas e de  superfície; teorema de Stokes;  teorema  de  divergência  de \nGauss; equações diferenciais de 1ª ordem; equações diferenciais   lineares de ordem n; noções sobre transformada de Laplace.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"MTM1163","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5101":{"codigo":"EMC5101","nome":"Materiais de Construção Mecânica I","ementa":"Classificação dos materiais de construção mecânica. Estruturas atômica, cristalina e  molecular. Defeitos cristalinos. Princípios de difusão. Deformação. Encruamento e recristalização. Propriedades mecânicas. Diagramas de equílibrio binários. Diagrama Fe-Fe3C. Diagramas TTT isotérmicos e contínuos. Tratamentos térmicos e termoquímicos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EMC1101 ou EMC5201","prerequisito":"EQA5116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5128":{"codigo":"EMC5128","nome":"Mecânica dos Sólidos A","ementa":"Conceitos de projeto. Concepção, projeto preliminar, projeto detalhado, análise. Tipos de análise. Análise experimental, análise por simulação com modelos. Tipos de modelos. Modelos mecânicos, modelos matemáticos, modelos numéricos. Tipos de modelos usados em Mecânica dos Sólidos: barras, vigas, placas, cascas, sólidos. Identificação e idealização dos modelos quanto a sua forma geométrica, carregamento, materiais e condições de contorno. Solicitações internas. Reações. Diagramas. Esforços em treliças. Tensões. Estados de tensão. Equações diferenciais de equilíbrio. Transformação de tensões e deformações. Critérios de falha. Tensões uniaxiais, pinos, colunas, tensões em treliças. Deformações, definições, relações deformação-deslocamento. Transformação de deformações. Diagramas tensão-deformação, Lei de Hooke. Deformações axiais em barras e problemas hiperestáticos em barras. Flexão simples plana, obliqua, seções assimétricas. Cisalhamento em vigas longas. Torção. Solicitações compostas.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMC1125 ou EMC5125","prerequisito":"FSC5103 e FSC5137 e MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5401":{"codigo":"EMC5401","nome":"Termodinâmica","ementa":"Sistemas e volume de controle. Noção de meio contínuo. Pressão. Temperatura. Propriedades de substâncias puras. Diagrama de fases da água. Equação para gases perfeitos. Processos quase estáticos e processos irreversíveis. Trabalho. Calor. Primeira lei para sistemas. Primeira lei para volumes de controle, em regime permanente e em regime não permanente uniforme. Estrangulamento adiabático. Segunda lei da Termodinâmica. Motor térmico e refrigerador. Enunciados de Kelvin-Planck e de Clausius. Ciclo de carnot. Escala absoluta de temperatura. Desigualdade de Clausius. Entropia. Variação da entropia apra sistemas. Variação da entropia para sólidos, líquidos e gás perfeito. Conceito de trabalho perdido. Princípio do aumento da entropia. A seguir lei para volume de  controle, em regime permanente e em regime não permanente uniforme. Equivalência entre os processos reversíveis em regime permanente adiabático e isotérmico. Princípio de aumento da  entropia para volume de controle. Ciclos de Rankine. Ciclos reais versus ciclos ideais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMC1401 ou EMC5405","prerequisito":"FSC5137 e INE5202 e MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7005":{"codigo":"EPS7005","nome":"Pesquisa Operacional","ementa":"Introdução: histórico, objetivos, restrições e modelos. Condições de otimalidade. Programação linear: modelos de programação linear, método simplex, dualidade, análise de sensibilidade e pós-otimalidade. Problemas lineares especiais.Programação não-linear; otimização multivariada; otimização sem restrições. Programação Inteira, Binária e Mista: algoritmos e modelos. Programação Dinâmica determinística e estocástica.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EPS5113","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5207":{"codigo":"FSC5207","nome":"Mecânica II - Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Dinâmica da partícula e do corpo rígido.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"FSC1207","prerequisito":"FSC5103 e FSC5137 e MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5166":{"codigo":"MTM5166","nome":"Cálculo E","ementa":"Séries numéricas. Séries de funções. Noções de funções de variáveis complexas. Equações diferenciais Parciais.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"Inválida: MTM1164 ou ","prerequisito":"MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5114":{"codigo":"EEL5114","nome":"Eletrotécnica Geral III","ementa":"","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EEL1114 ou EEL5115","prerequisito":"FSC5133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5102":{"codigo":"EMC5102","nome":"Materiais de Construção Mecânica II","ementa":"Ensaios mecânicos, principais processamento de materiais metálicos e sua correlação com microestrutura e propriedades resultantes no material. Aços. Ferros fundidos, alumínio e suas ligas, cobre e siuas ligas. Caracteristicas principais dos materiais cerâmicos e políméricos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC1102 ou EMC5201","prerequisito":"EMC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5129":{"codigo":"EMC5129","nome":"Mecânica dos Sólidos B","ementa":"Descrição geral, qualitativa, dos diversos tipos de problemas na mecânica dos sólidos: vigas, barras, estados planos, sólidos 3D, placas, cascas, cascas de revolução, carregamentos axisimétricos, plasticidade, viscoelasticidade, por exemplo. Cascas de revolução sob comportamento de menbrana. Cascas cilíndricas, esféricas, cônicas. Vigas isostáticas e hiperestáticas: equações diferenciais, solução por métodos de integração direta, de área de momento, de sobreposição. Energia de deformação elástica, energia de barras e vigas 2.º. Teorema de Castigliano. Teoremas de Maxwell e de Betti. Elementos finitos para treliças planas. Elementos finitos para estruturas planas de vigas. Matriz de rigidez, sobreposição, determinação de esforços. Flambagem de colunas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"(EMC1126 ou EMC5126) ou (EMC5121 ou EMC5138)","prerequisito":"EMC5128","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5222":{"codigo":"EMC5222","nome":"Metrologia e Controle Geométrico","ementa":"Procedimentos gerais de medição. Erros de medição. Resultados da medição. Calibração e aferição. Controle geométrico. Instrumentos para controle dimensional. Medição diferencial. Medição por coordenadas. Calibradores. Noções sobre automação do controle dimensional.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMC1222","prerequisito":"EGR5623","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5240":{"codigo":"EMC5240","nome":"Introdução aos Processos de Usinagem","ementa":"Fundamentos da teoria da usinagem. Ferramentas de corte. Torneamento. Furação. Alargamento e escariação. Mandrilamento. Fresamento. Serramento. Brochamento. Roscamento. Retificação e afiação. Processos finos de acabamento em máquinas-ferramenta. Eletroerosão.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC1240 ou EMC5202","prerequisito":"EGR5623 e EMC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5445":{"codigo":"EMC5445","nome":"Mecânica dos Fluidos I","ementa":"Propriedades dos fluidos. Estática dos fluidos. Leis básicas para sistemas e volumes de controle. Análise diferencial do movimento de fluidos. Escoamento incompressível não-viscoso. Análise dimencional. Escoamento viscoso imcompressível. Escoamento em canalizações. Teoria da camada limite.  Resistência sobre corpos submersos.","carga_horaria":90,"fase_sugestao":5,"equivalencia":"EMC1402 ou EMC1445 ou EMC5402 ou EMC5407","prerequisito":"FSC5207 e MTM5166","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5231":{"codigo":"EPS5231","nome":"Gerência Industrial I","ementa":"Introdução à contabilidade. Noções preliminares. A contabilidade como sistema de controle e informações. Procedimentos contábeis básicos. Variação patrimonial. Balanço e demonstrativo de lucros e perdas. Análise econômica financeira. Introdução à finanças de empresas. Funções do mercado financeiro. Significado e objetivos das finanças da empresa. Administração financeira do ativo, passivo e patrimônio líquido.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS1231 ou EPS7010","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1400,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7002":{"codigo":"EPS7002","nome":"Probabilidade e Modelos Estocásticos","ementa":"Probabilidade: definições, variáveis aleatórias discretas e contínuas; distribuições conjuntas, marginais e condicionais; funções de distribuições de probabilidades: normal, qui-quadrado, exponencial, binominal e Poisson. Processos Estocásticos: definições, cadeias de Markov e matriz de transição. Teoria das filas: sistemas M\/M\/1, M\/M\/c e M\/M\/ck. Simulação: geração de números pseudo-aleatórios, formulação de modelos de simulação; validação do modelo; linguagens de simulação. Noções de confiabilidade de sistemas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EPS5117 e INE5115","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ5102":{"codigo":"ECZ5102","nome":"Conservação de Recursos Naturais","ementa":"Estrutura, funcionamento e dinâmica de ecossistemas. Efeito da ação antrópica sobre os ecossistemas. Legislação e Conservação dos recursos naturais.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"BLG1140 ou BLG5303 ou ECZ5112","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5121":{"codigo":"EMC5121","nome":"Fadiga","ementa":"Modos de falha. Comportamento Mecânico. Concentração de tensões. Análise elasto-plástica. Mecânica da fratura elástica linear. Mecânica da fratura e elasto-plástica. O fenômeno da fadiga. Resistência à fadiga dos metais. Resistência à fadiga de componentes. Efeito de solicitações médias. Propagação de trincas de fadiga. Análise de defeitos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMC1120 ou EMC1121 ou EMC5129 e EMC5138","prerequisito":"EMC5102 e EMC5128","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5241":{"codigo":"EMC5241","nome":"Conformação Mecânica dos Metais","ementa":"Classificação e descrição  sumária dos diversos processos de conformação mecânica dos Metais. Aspectos gerais da conformação mecânica. Tecnologia e campos de aplicação dos processos de forjamento, laminação, trefilação e extrusão. Processos de conformação de chapas: operações de corte, dobramento, estiramento e embutimento. Introdução a estampabilidade de chapas. Ferramentas. Máquinas utilizadas.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC1241 ou EMC5203 e EMC5261","prerequisito":"EGR5623 e EMC5101 e EMC5128","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5403":{"codigo":"EMC5403","nome":"Transmissão de Calor I","ementa":"Mecanismos físicos  da transmissão de calor. A lei de Fourier e o vetor fluxo de calor. A equação geral da condução e tipos de condições de contorno. Condução unidimensional em regime permanente: paredes compostas, conceito de resistência térmica, sistemas com geração de calor, aletas. Condução bidimensional em regime permanente: solução pelo método da separação das variáveis e o método  gráfico. Condução transiente: o método da capacitância global; soluções exatas e simplificadas da equação da condução e representações gráficas; problemas bi e tridimensionais. O método dos volumes finitos aplicados a problemas transientes e estacionários de condução. Conceitos fundamentais da radiação. Radiação de um corpo negro. Comportamento dos corpos reais com relação a energia emitida e incidente. A lei de Kirchhoff. Troca de calor entre superfícies negras. Definição e determinação do fator de forma. Troca de calor entre superfícies cinzentas numa cavidade. Blindagem de radiação e superfícies reirradiantes.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC1403","prerequisito":"EMC5401 e MTM5166","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5429":{"codigo":"EMC5429","nome":"Maquinas de Fluxo","ementa":"Permitir o entendimento, avaliação, discussão e análise dos fenômenos físicos que regem o  funcionamento das máquinas de fluxo, seus principais modos de instalação, características de  composição, montagem e funcionamento frente a situações diversas e dominar os fundamentos necessários para seu dimensionamento e seleção.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMC1429 ou EMC5408","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5232":{"codigo":"EPS5232","nome":"Gerência Industrial II","ementa":"Introdução à contabilidade de custos e aos conceitos de custos. O ciclo da contabilidade de custo. Custo de matéria-prima. Custo de mão-de-obra. Custos indiretos de produção. Sistemas de custos por ordens de produção. Sistemas de custos por processo. Custos conjuntos e de sub-produto. Custos direto. Análise da relação entre custos, volume e lucro. Custo para a tomada de decisões.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS1232 ou EPS7018","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7003":{"codigo":"EPS7003","nome":"Estatística e Modelos de Previsão","ementa":"Estatística: planejamento de pesquisa e levantamento de dados, amostragem, análise de dados, análise de correlação e regressão, estimação de parâmetros, testes de hipóteses paramétricos e não paramétricos. Previsão: médias móveis e decomposição de séries, Holt-Winters e outros métodos determinísticos. Regressão simples e múltipla. Modelos ARIMA.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS7000 ou INE5104","prerequisito":"EPS7002 ou INE5115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5123":{"codigo":"EMC5123","nome":"Mecanismos","ementa":"Introdução. Conceitos e notações aplicado a mecanismos. Estudo de tipos de mecanismos. Síntese dimensional de mecanismos articulados. Análise e cinemática de cames planos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMC1123","prerequisito":"FSC5207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5140":{"codigo":"EMC5140","nome":"Controle de Vibrações","ementa":"Caracterização dos movimentos vibratórios. Respostas de sistemas lineares estáveis. Modelagem matemática de sistemas mecânicos. Sistemas modelados com grau de liberdade. Informações sobre medição de vibrações. Problemas em máquinas rotativas. Sistemas modulados com dois ou mais graus de liberdade. Técnicas para o controle de vibrações.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMC1140","prerequisito":"EMC5121 e EMC5129","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5261":{"codigo":"EMC5261","nome":"Tecnologia de Fundição","ementa":"Princípios fundamentais da teoria de solidificação de metais e suas  aplicadas à fundição e necessário ao controle de defeitos e ao projeto de peças fundidas. Conhecimento básico dos diferentes processos tradicionais de fundição, seu campo de aplicação, suas vantagens e limitações. Tendências atuais na evolução dos processos. Noções fundamentais  de ensaios não-destrutivos e sua aplicação na inspeção e controle de peças fundidas.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"EMC1242 ou EMC5203 e EMC5241","prerequisito":"EGR5623 e EMC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5262":{"codigo":"EMC5262","nome":"Tecnologia de Soldagem","ementa":"Conceitos fundamentais de soldagem. Evolução dos processos de soldagem. Noções gerais sobre modernos processos de soldagem. Síntese dos principais processos de soldagem a arco. Aprofundamento sobre e estudo do arco voltáico de soldagem. Processo MIG\/MAG. Processo TIG e plasma. Arco submerso. Eletrodos revestidos. Eletrodos tubulares.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"EMC1242 ou EMC5204","prerequisito":"EEL5114 e EMC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5330":{"codigo":"EMC5330","nome":"Elementos de Máquinas I","ementa":"Aplicar os conceitos adquiridos nas disciplinas anteriores (tais como: fadiga, mecânica dos sólidos, física, etc. no dimensionamento, estático e dinâmico, de alguns elementos de máquinas.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMC1330 ou EMC5332 e EMC5335","prerequisito":"EMC5121 e EMC5129","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5404":{"codigo":"EMC5404","nome":"Transmissão de Calor II","ementa":"Equações governantes da convecção; conceito da camada limite; efeitos da turbulência; solução de blasius; correlações para escoamentos externos; escoamentos internos; correlações; convecção natural;  equações governantes; correlações; modos de ebulição e condensação; correlações, trodadores de calor.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMC1403","prerequisito":"EMC5403 e EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5443":{"codigo":"EMC5443","nome":"Fundamentos de Sistemas Hidráulicos e Pneumáticos","ementa":"Parte I - Sistemas hidraúlicos: Definição, campo de aplicação e características. Revisão dos conceitos da mecãnica de fluidos (Hidrostática e Hidrodinâmica) aplicados aos sistemas hidráulicos. Fluidos hidráulicos: propriedades, compressibilidade, expansão térmica, tipos de fluidos, classificação. Componentes de sistemas hidráulicos: bombas e atuadores lineares e rotativos, válvulas de controle direcional, de pressão e de vazão, válvulas de controle contínuo (servoválvula e válvula proporcional), válvulas tipo cartucho. Acumuladores, reservatórios, filtros. Acionamentos hidrostáticos e sistemas  hidráulicos básicos. Dimensionamento.Parte II -  Sistemas pneumáticos: Definições: comandos, controles, grandezas analógicas e digitais. Principais elementos pneumáticos: atuadores, elementos de comando de sinal e  de processamento do sinal. Projeto de comandos combinatórios e seqüencias. Aplicações à automação industrial. Dimensionamento de atuadores e elementos de comando. Geração, e distribuição do ar comprimido: compressores, canalizações, reguladores, lubrificadores e filtros.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMC1443","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5222":{"codigo":"EPS5222","nome":"Modelos Econômicos Quantitativos","ementa":"Mercado: oferta e demanda. Formação da demanda: demanda individual e do mercado. Produção: tecnologia, insumos, produtividade e custos; maximização de lucros. Tipos de mercados: monopólio, monopsônio, concorrência perfeita, oligopólios. Estruturas de mercados e formação de preços. Teoria dos jogos e estratégia competitiva. Mercado para fatores de produção. Externalidades e bens públicos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS1221 ou EPS1222","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5225":{"codigo":"EPS5225","nome":"Ergonomia e Segurança Industrial","ementa":"Conceitos. Sistemas homem-máquina. Posto de trabalho. Atividade muscular.  Antropometria. Postura de trabalho. Ambiente térmico. Audição. Visão. Vibração. Atividade mental. Acidentes de trabalho: conceitos, causas e custos. Métodos de prevenção individual e coletiva. Aspectos legais.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS1213 ou EPS1225 ou EPS7020","prerequisito":"EPS7003 ou INE5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5332":{"codigo":"EMC5332","nome":"Elementos de Máquinas II","ementa":"Cinemática de engrenagens. Capacidade de carga de engrenagens cilíndricas e de coroa e sem fim. Molas e freios. Embreagens. Acoplamentos. Correias e correntes.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EMC1332 ou EMC5330 e EMC5335","prerequisito":"EMC5121 e EMC5129","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5471":{"codigo":"EMC5471","nome":"Geração e Distribuição de Vapor","ementa":"Unidades geradoras de vapor. Tipos existentes e princípio de funcionamento. Componentes principais.     Rendimento térmico. Aspectos gerais sobre fornalhas. Combustíveis industriais. Teoria da combustão. Aspectos gerais sobre caldeiras. Circulação natural, assistida e forçada. Acessórios. Controle e segurança de caldeiras. Tiragem. Transferência de calor em fornalhas. Convecção e radiação gasosa em fexes tubulares. Balanço energético de caldeiras. Economia de energia.  Tubulações de vapor. Metodologia de projeto de tubulações. Traçado de tubulações em isométrico e em planta baixa. Sistemas de controle de temperatura e de pressão do vapor. Acessórios. Dilatação térmica e flexibilidade de tubulações. Perdas de calor e formação de  condensado. Purgadores de vapor.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EMC1420","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5472":{"codigo":"EMC5472","nome":"Princípios de Refrigeração e Condicionamento de Ar","ementa":"Aspectos teóricos e ambientais. Sistemas de único estágio, ciclo de refrigeração de Carnot, ciclo de refrigeração padrão, ciclos com subresfriamento e superaquecimento, ciclo com trocador de calor intermediário. Sistemas de múltiplos estágios, componentes adicionais, ciclos com múltiplos componentes. Dispositivos de expansão fixa, válvula de expansão manuais, tubos capilares, tubos curtos. Dispositivos de expansão variável, válvulas de expansão tipo bóia, válvulas de expansão pressostáticas, vávulas de expansão termostáticas. válvulas elétricas. Compressores alternativos, processo de compressão, rendimento volumétrico, métodos de controle de capacidade. Propriedades psicrométricas. Processos psicrométricos. Sistemas psicrométricos de zona única, controle do ar externo, sistema clássico de verão. Sistemas psicrométricos de zonas múltiplas, sistemas com  reaquecimento terminal, sistemas de dutos duplos. Sistemas de volume de ar variável.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EMC1421 ou EMC5406","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5473":{"codigo":"EMC5473","nome":"Motores a Combustão Interna","ementa":"Motores de combustão interna. Conceitos fundamentais. Ciclos teóricos e indicados. Combustíveis. Sistemas de lubrificação de refrigeração e de distribuição. Desempenho de motores. Combustão nos motores ICO e ICE. Ignição. Sistemas de alimentação. Injeção. Sobrealimentação. Detecção de defeitos.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMC1422","prerequisito":"EMC5401 e EMC5403 e EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5223":{"codigo":"EPS5223","nome":"Economia da Engenharia","ementa":"Noções de matemática financeira. Juros simples e compostos. Taxas. Métodos de análise de investimentos. Fluxo de caixa. Investimento inicial, capital de giro, receitas e despesas. Efeitos da depreciação sobre rendas tributáveis. Influência do financiamento e amortização. Incerteza e risco em projetos. Análise de viabilidade de fluxo de caixa final. Análise e sensibilidade. Substituição de equipamentos. Lessing. Correção monetária.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1210 ou EPS1223 ou EPS7019","prerequisito":"EPS5222 e EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5227":{"codigo":"EPS5227","nome":"Planejamento Industrial","ementa":"Noções de planejamento empresarial. Etapas de um empreendimento industrial. Metodologia para elaboração dos ante-projetos. Estudos de mercado. Estudos de localização. Análise de tecnologias e fatores de produção. Caracterização do processo produtivo. Estudo do tamanho. Determinação do investimento. Projeção de receitas e custos. Análise de retorno do investimento.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1217 ou EPS1227","prerequisito":"EPS5222 e EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5235":{"codigo":"EPS5235","nome":"Planejamento e Controle da Produção","ementa":"Visão geral dos sistemas de produção. Planejamento estratégico da produção. Planejamento mestre da produção. Programação da produção: administração de estoques, seqüenciamento,emissão e liberação de ordens. Acompanhamento da produção.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1201 ou EPS1235 ou EPS5201","prerequisito":"EPS5117 ou (EPS7002 e EPS7005)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5238":{"codigo":"EPS5238","nome":"Estudos de Tempos e Métodos","ementa":"Introdução e objetivos. Processo de projeto. Projeto de método (Estudo de Movimento): técnicas de registro e análise, economia de movimentos. Técnicas de medida do trabalho: estudo de tempos, amostragem do trabalho, tempos pré-determinados, avaliação ritmo. Tempo padrão.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1205 ou EPS1238 ou EPS5205 ou EPS7022","prerequisito":"EPS5225","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5311":{"codigo":"EPS5311","nome":"Projeto de Produto I","ementa":"Os ciclos dos produtos: conceitos e objetivos. Concepção do produto. Desenvolvimento do produto: análise do valor, método morfológico e método experimental. Projeto de fabricação. Comercialização do produto. Vida de mercado. Tópicos complementares.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EPS1311 ou EPS5312 e EPS7021","prerequisito":"EPS5225","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7040":{"codigo":"EPS7040","nome":"Estágio Supervisionado em Engenharia de Produção","ementa":"","carga_horaria":450,"fase_sugestao":9,"equivalencia":"EPS5505 ou EPS7017","prerequisito":"EPS5227 e EPS5230 e EPS5238 e EPS5311 e EPS5312","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3220,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5230":{"codigo":"EPS5230","nome":"Garantia de Qualidade","ementa":"O conceito de qualidade total. Os ambientes, o planejamento e gestão da qualidade. O modelo de qualidade in-line. A qualidade off-line. O modelo de qualidade on-line. Qualidade total em produtos e serviços. A ênfase do cliente na estrutura da qualidade total. Planejamento da qualidade total. Gestão da qualidade total. Estratégias e ferramentas para a implantação da qualidade. Ferramentas e estratégias para a implantação da qualidade total. Estratégias para a qualidade in-line. Estratégias para a qualidade on-line. Avaliação da qualidade.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS1224 ou EPS1230 ou EPS7023","prerequisito":"EPS5235 e EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5237":{"codigo":"EPS5237","nome":"Projeto de Fabrica","ementa":"Objetivos do estudo e metodologia de elaboração. Especificações de processos. Arranjo físico. Instalações na indústria. Edificações industriais.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS1237 ou EPS7025","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5312":{"codigo":"EPS5312","nome":"Projeto de Produto II","ementa":"Desenvolvimento de um projeto de produto com a construção modelo em laboratório e respectivo projeto de fabricação.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"EPS1312 ou EPS5311 e EPS7021","prerequisito":"EPS5311","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7004":{"codigo":"EPS7004","nome":"Logística Empresarial","ementa":"O ambiente de negócios. Conceito e evolução da logística. Cadeia de suprimentos (supply chain). O sistema logístico. Custos logísticos. Nível de serviço ao cliente. A logística de suprimento. A distribuição física de produtos. O subsistema transporte: os modais de transporte; característica e escolha do modal; os processos coleta-transferência e distribuição. O subsistema armazém: funções e meios de armazenagem; unitização de cargas; sistemas de endereçamento dos produtos. O gerenciamento de estoques: classificação ABC, sistemática de re-suprimento.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"EPS5236 ou EPS7026","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT0001":{"codigo":"ZZT0001","nome":"Optativa I","ementa":"","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ARQ5212":{"codigo":"ARQ5212","nome":"Arquitetura e Sociedade","ementa":"Cultura urbana. Classes sociais, movimentos-sócio-políticos e arquitetura.. Nascimento e crescimento das cidades. Problemática da organização dos indivíduos: a família, os grupos, as associações atuação e as comunidades. Os espaços coletivos: análise e avaliação crítica. A inadequação da cidade contemporânea frente aos indivíduos: crianças, adultos, velhos, inválidos, etc.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD5305":{"codigo":"CAD5305","nome":"Mercadologia","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CAD1305","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD7232":{"codigo":"CAD7232","nome":"Estratégia Mercadológica","ementa":"Segmentação e posicionamento de Mercado; Sistema de Informação de Marketing; Tipologias e ferramentas de estratégias de marketing; O marketing de relacionamento e de serviço; Posturas estratégicas de marketing: de preço, de praça, de promoção e de produto. Planejamento e plano de marketing; Metodologias para a elaboração do plano de marketing; Tópicos emergentes de marketing: esportivo, social, marketing internacional, E-Marketing, e, universitário.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGR5672":{"codigo":"EGR5672","nome":"Introdução ao CAD","ementa":"Introdução ao CAD, tela de trabalho, método de entrada de coordenadas, comandos de controle de parâmetros, comandos de manipulação de arquivos, comandos de construção, método de seleção de entidades, comandos de: visualização, edição, dimensionamento, manipulação de textos, auxílio, níveis de trabalho, impressão, noções fundamentais de construção em 3D.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EGR5604","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5127":{"codigo":"EMC5127","nome":"Mecânica dos Sólidos III","ementa":"Elasticidade plana. Tubos e discos. Reservatórios. Torção. Impacto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1127","prerequisito":"EMC5128","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5209":{"codigo":"EMC5209","nome":"Processos de Conformação Contínua","ementa":"Estudo dos processos de conformação a frio, trefilação e extrusão. Projeto de peças e sequência de operação. Forças e trabalho necessários à conformação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1209","prerequisito":"EGR5623 e EMC5241","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5217":{"codigo":"EMC5217","nome":"Trabalho em Chapas","ementa":"Operação de trabalho em chapas. Elementos construtivos dos diversos tipos de ferramentas. Ferramentas de corte, de dobramento e curvamento, de embutimento e estiramento,  para trabalhos mistos progressivos. Exemplos de ferramentas para fabricação de peças estampadas. Ferramentas com matrizes e estampos de metal duro. Estampagem fina. Projeto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1217","prerequisito":"EGR5623 e EMC5241","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5218":{"codigo":"EMC5218","nome":"Comando Numérico","ementa":"Conceito de Comando Numérico (NC) e sua importância no contexto da Automatização Industrial, Características dos sistemas NC envolvendo a máquina, o comando e a programação. Vantagens e limitações do NC. Conceito de programação manual incluindo estudo de dasos através de exercícios (didáticas e práticos) de programação. Aspectos modernos da fabricação assistida por computador, relacionando NC com sistemas CAD\/CAM.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1218","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5224":{"codigo":"EMC5224","nome":"Metalurgia do Pó e Materiais Conjugados","ementa":"Processos de obtenção de pós. Caracterização e propriedades dos pós. Métodos de compactação e moldagem. Processos de sinterização e homogeneização. Principais ensaios em materiais sinterizados. Peças estruturais-Producão em grandes séries. Materiais porosos. Materiais de alto ponto de fusão. Materiais conjugados. Materiais sinterizados magnéticos. Produção e propriedades de materiais cerâmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1224","prerequisito":"EMC5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5236":{"codigo":"EMC5236","nome":"Medição de Grandezas Mecânicas","ementa":"Noções sobre experimentação. Grandezas a medir. Sistemas de medição. Características estatísticas e dinâmicas. Medição elétrica de grandezas mecânicas. Aparelhos para indicação e registro. Transdutores ativos. Transdutores passivos. Sistema de medição digital. Automação da medição.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMC1236","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5237":{"codigo":"EMC5237","nome":"Processamento de Polímeros","ementa":"Materiais poliméricos: termoplásticos e termofixos. Processamento de polímeros. Moldagem por injeção, compressão, sopro, centrifugação. Conformação à vácuo e por embutimento. Conformação de poliestireno expandido. Matrizesde silicone borrachóide. Normas. Equipamentos para a conformação de plásticos. Projeto de uma matriz.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1237","prerequisito":"EMC5262","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5239":{"codigo":"EMC5239","nome":"Forjamento em Matriz","ementa":"Fundamentos teóricos. Regras de projeto. Métodos de forjamento. Estudo e dimensionamento das matrizes. Máquinas e fornos de forjamento. Exigências de material e energia para forjamento. Projeto de peças e ferramentas para o forjamento em matriz.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1239","prerequisito":"EGR5623 e EMC5241","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5243":{"codigo":"EMC5243","nome":"Tópicos Especiais em Fabricação","ementa":"Assuntos relacionados com algum tema específico da área de fabricação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1243","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5244":{"codigo":"EMC5244","nome":"Dinâmica e Controle de Sistemas","ementa":"Introdução aos sistemas dinâmicos de comando\/controle. Sistemas dinâmicos: classificação, analogias. Modelos gráficos da estrutura de sistemas dinâmicos generalizados. Componentes de sistemas dinâmicos fásicos. Sistemas generalizado. Controle de sistemas dinâmicos: análise e síntese, representação gráfica.  Tópicos especiais: eletrônica aplicada, acionamentos, simulação de sistemas, CNC - CPL, medidas de comportamento dinâmico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1244","prerequisito":"FSC5133 e MTM5166","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5252":{"codigo":"EMC5252","nome":"Processos Não Convencionais de Usinagem","ementa":"Estudo de processos não convencionais de usinagem apropriados as peculiaridades industriais do País.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1252","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5272":{"codigo":"EMC5272","nome":"Processos de Soldagem","ementa":"Classificação dos processos. Fontes de soldagem convencionais e modernas. Propriedades do arco voltáico dos diversos processos e suas implicações nas características das fontes de soldagem. Estudo teórico  experimental da  transferência metálica no processo MIG\/MAG. O processo TIG e MIG\/MAG convencionais e pulsados. Soldagem e corte plasma","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1225","prerequisito":"EMC5262","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5273":{"codigo":"EMC5273","nome":"Especificação de Procedimentos de Soldagem","ementa":"Fundamenteos de metalurgia da soldagem. Conhecimento básico da correlação entre variáveis de processo, ciclos térmicos de soldagem e a microestrutura e propriedades mecânicas de juntas soldadas. Soldabilidade de aços comuns, aços ligados, aços inoxidáveis e ferros fundidos. Importância da brasagem como técnicas especial de união e revestimento. Noções de processos e  aplicação  da aspersão térmica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1226","prerequisito":"EMC5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5274":{"codigo":"EMC5274","nome":"Tecnologia da Usinagem com Ferramentas de Geometria não Definida","ementa":"Tecnologia dos processos de usinagem que empregam ferramentas de corte com cunhas de geometria não definida. Estudo émpírico dos mecanismos de formção de cavacos, dos mecanismos de  desgaste, apresentação dos materiais de ferramentas, fabricação de abrasivos ligados. Estudo dos processos de retificação, brunimento e lapidação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5275":{"codigo":"EMC5275","nome":"Tecnologia da Usinagem com Ferramentas de Geometria Definida","ementa":"Tecnologia dos processos de usinagem que empregam ferramentas de corte com cunhas cortantes de geometria definida. Estudo  empírico  dos mecanismos de formação  de cavacos, dos mecanismos de desgaste, apresentação dos materiais de ferramentas, estudo da influência do fluido de corte sobre o  processo de usinagem, da usinabilidadde dos materias de peças para os diversos  materiais de ferramentas. Determinação econômica das condições de usinagem.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1223","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5277":{"codigo":"EMC5277","nome":"Tecnologia de Processos Especiais de Usinagem","ementa":"Tecnologia dos processos de remoção térmica por descargas elétricas, remoção química, remoção térmo-química, remoção elétro-química, remoção por ultra-som, remoção por raio Laser, remoção por feixe de  elétros e remoção por jato de água. São apresentados os principais parâmetros dos processos, os meios auxiliares e as potenciais aplicações, mostrando exemplos práticos para os processos em questão.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5278":{"codigo":"EMC5278","nome":"Economia e Planejamento da Usinagem","ementa":"Equações de vida de ferramenta. Tempos de usinagem. Custos de usinagem. Sequência de usinagem. Dispositivos especiais de usinagem. Dispositivos de fixação e alimentação. Otimização das condições de usinagem em relação ao tempo, custo e rendimento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1249 e EMC1250","prerequisito":"EMC5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5279":{"codigo":"EMC5279","nome":"Projeto de Sistemas de Qualidade","ementa":"Conceituacão. Métodos e técnicas estatísticas básicas. Controle do produto acabado. Técnicas de controle de processos. Métodos Taguchi e QFD. Norma ISO série 9000 e qualidade  total. Sistemas integrados de qualidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5281":{"codigo":"EMC5281","nome":"Circuitos Eletrônicos Aplicados a Engenharia Mecânica","ementa":"Circuitos elétricos de corrente contínua e alternada. Introdução a física dos dispositivos eletrônicos. Componentes analógicos ativos discretos e integrados. Circuitos eletrônicos analógicos aplicados à instrumentação de medição e controle. Eletrônica digital: caracterização, sistemas de numeração e códigos, lógica combinacional e seqüencial. Introdução à arquitetura de u-computadores e u-controladores. Controladores programáveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL5114","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5310":{"codigo":"EMC5310","nome":"Projeto de Estruturas","ementa":"Processo de projeto estrutural. Modelamento de sistemas físicos. Análise denâmica. Critérios de  projeto, modos de falha e confiabilidade. Estruturas soldadas. Estruturas otimizadas. Estabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1310","prerequisito":"EMC5121 e EMC5127","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5311":{"codigo":"EMC5311","nome":"Veiculos Automotores","ementa":"Resistências ao movimento. Diagramas de desempenho. Tipos e comportamento dos pneus. Transmissão de força. Estabilidade. Suspensão. Estrutura.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1311","prerequisito":"EMC5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5313":{"codigo":"EMC5313","nome":"Análise Estrutural I","ementa":"Revisão de mecânica de sólidos. Tensor de tensões. Tensor de deformação finita e infinitesimal. Relações constitutivas. Material elástico linaer. Equação diferencial de equilibrio. Princípio dos trabalhos virtuais. Princípio de mínima energia de deformação. Aproximação por elementos finitos. Elementos finitos de barras, vigas, estados planos de deformação tensão, sólidos de revolução, sólidos e placas. Modelagem  e práticas com softwares comerciais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1313","prerequisito":"EMC5129 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5314":{"codigo":"EMC5314","nome":"Análise Estrutural II","ementa":"Método variacional. Flambagem lateral de vigas e torcional de eixos. Método de Rayleigh-Ritz. Flambagem local. Flambagem de estruturas por métodos matriciais. Estabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1314","prerequisito":"EMC5313","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5315":{"codigo":"EMC5315","nome":"Tribologia","ementa":"Atrito seco e misto. Desgaste. Lubrificantes. Materiais para superfícies atritantes. Falhas e reparos de superfícies atritantes. Introdução à teoria da lubrificação. Equação de Reynold e de energia. Métodos de solução. Lubrificação hidrostática e hidrodinâmica. Esmagamento da película de lubrificante.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1315","prerequisito":"EMC5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5316":{"codigo":"EMC5316","nome":"Projeto de Máquinas Agrícolas","ementa":"Fontes de potência. Tratores agrícolas. Máquinas e implementos de reparo do solo, de adubação, semeadura, transplante, cultivo, aplicação de inseticidas, colheita e transporte. Requisitos de projeto. Dimensionamento. Construção e avaliação de desempenho.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1316","prerequisito":"EMC5123 e EMC5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5317":{"codigo":"EMC5317","nome":"Controle de Ruído","ementa":"Introdução à acústica aplicada; grandezas acústicas: pressão, intensidade, potência, impedância. Efeito de ruído no homen; limite permitido para ruído industrial, portaria 3214 do Mtb, critérios para conforto acústico, lei do silêncio. Instrumentação de medição e análise de ruído; microfones, medidores de nível de pressão sonora, dosimetro, filtro calibrador. Materiais e dispositivos para controle de ruído; materiais fibrosos, materiais porosos, medição de absorção acústica dos materiais. Isolamento de ruído; perda de transmissão, lei de massa, efeito de ressonância e coincidência, efeito das frestas e abertura. Controle de ruído por enclausuramento. Protetores auriculares.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1317","prerequisito":"EMC5140","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5321":{"codigo":"EMC5321","nome":"Sistemas CAE\/CAD\/CAM em Engenharia","ementa":"Desenvolvimento e configuração dos sistemas CAE\/CAD\/CAM. Periféricos. Sistemas gráficos. Modelamento sólido. Definições de superfícies. Transformações de escala, translação, rotação, reflexão e perspectiva. Padrões gráficos. Simulação e validação. Seleção de sistemas. Uso do sistema.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EGR5623 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5322":{"codigo":"EMC5322","nome":"Tópicos Especiais em Projeto","ementa":"Assuntos específicos relacionados com a área de projeto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1322","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5323":{"codigo":"EMC5323","nome":"Transportadores Industriais","ementa":"Características  dos  transportadores  industriais.  Critérios  de  seleção,  projeto  e  fabricação  de  transportadores  industriais","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1323","prerequisito":"EMC5330 e EMC5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5325":{"codigo":"EMC5325","nome":"Projeto de Máquinas Ferramenta","ementa":"Método de trabalho de projeto. Análise e e seleção de soluções alternativas. Variadores de velocidade escalonados e contínuos. Árvores principais. Mancais de rolamento e hidrostáticos. Guias de máquinas ferramentais: escorregamento, rolamento e hidrostáticas. Estruturas de máquinas ferramentas. Teoria dos modelos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1325","prerequisito":"EMC5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5334":{"codigo":"EMC5334","nome":"Projeto de Produtos Industriais","ementa":"Projetos específicos baseados nos conhecimentos adquiridos em disciplinas já cursadas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1334","prerequisito":"EMC5340","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5340":{"codigo":"EMC5340","nome":"Metodologia de Projeto","ementa":"Introdução. Morfologia do processo de projeto. Técnicas de desenvolvimento de concepções. Propriedade industrial. Seleção e avaliação de concepções. Projeto preliminar. Projeto detalhado. Construção e teste de protótipos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1340","prerequisito":"EMC5330","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5342":{"codigo":"EMC5342","nome":"Projeto de Estruturas Soldadas","ementa":"Tensões e deformações na soldagem. Projeto de estruturas soldadas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1227","prerequisito":"EMC5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5414":{"codigo":"EMC5414","nome":"Geradores de Vapor","ementa":"Aplicação da transferência de calor em projetos de geradores de vapor. Fornalhas e processos de combustão e dimensionamento. Aproveitamento do calor residual dos gases de combustão. Sueperaquecedores, economizadores e pré-aquecedores de ar. Circulação e purificação do vapor.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1414","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5428":{"codigo":"EMC5428","nome":"Projeto de Motores a Combustão Interna","ementa":"Sistema de combustão nos motores ICE e ICO, construção do diagrama indicado. Capacidade de ar nos motores de quatro tempos. Lavagem em motores de dois tempos. Análise térmica do conjunto. Balanço térmico de motores. Anteprojeto de motores. Análise dinâmica do mecanismo bielamanivela e do mecanismo de transmissão. Cálculo do volante.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1428","prerequisito":"EMC5330 e EMC5473","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5436":{"codigo":"EMC5436","nome":"Laboratorio de Ciencias Termicas","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1436","prerequisito":"EMC5471 e EMC5472","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5444":{"codigo":"EMC5444","nome":"Projeto de Sistemas Térmicos","ementa":"Metodologia do projeto. Noções de economia aplicada à análise de investimentos. Ajustes de equações. Modelação. Simulação. Otimização. Técnicas de otimização aplicadas ao projeto de sistemas térmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1444","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5446":{"codigo":"EMC5446","nome":"Mecânica de Fluidos II","ementa":"Escoamento compressível unidimensional. Escoamento de fluídos ideais. Escoamento permanente  em canais abertos. Escoamento transitório em condutos fechados e canais abertos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1446 ou EMC5408 ou EMC5419","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5447":{"codigo":"EMC5447","nome":"Tubulações Industriais","ementa":"Aplicações de tubulações no meio industrial. Critérios  utilizados no dimensionsmento e instalação de tubulações. Tensões admissíveis e noções de flexibilidade. Traçado e detalhamento de tubulações. Informações complementares.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1447","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5448":{"codigo":"EMC5448","nome":"Conforto Térmico","ementa":"Trocas térmicas entre o homem e seu ambiente. Balanço de calor. Condições para o conforto térmico. Equação de conforto térmico. Equação de conforto. Influência de fatores especiais na aplicacão da equação de conforto. Cálculo prático de ambientes. Índices térmicos. Valor médio previsto. Métodos de medição. Cálculo da temperatura média radiante. Dados de radiação para o corpo humano. Análise térmica ambiental.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1448","prerequisito":"EMC5472","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5452":{"codigo":"EMC5452","nome":"Conservação de e Energia","ementa":"Aspectos gerias em conservação de energia na indústria. Combustíveis industriais. Balanço energético. nacional. Tendência atuais. Auditoria energética. Balanço  térmico de equipamentos. Primeira e segunda lei da temodinâmica. Energia eficiência energética. Copgeração. Recursos renováveis. Fontes alternativas de energia. Biogás, energia solar e energia eólica. Análise econômica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1452","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5453":{"codigo":"EMC5453","nome":"Projeto em Refrigeração e Ar Condicionado","ementa":"Componentes básicos do ciclo, análise. Ciclo total de compressão de vapor, análise. Refrigerantes, testes da instalação. Processos Psicométricos. Projetos de câmaras e de instalações de ar condicionado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1453","prerequisito":"EMC5472","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5455":{"codigo":"EMC5455","nome":"Dimensionamento Térmico de Turbinas a Vapor","ementa":"Turbinas a vapor de ação: De Laval, Curtis, Rateau, Curtis-Rateau. Dimensionamento das turbinas e palhetas. Turbinas a vapor de reação. Dimensionamento das palhetas fixas e palhetas móveis. Disposicão dos elementos nas turbinas de ação e turbinas de reação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMC1455","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5456":{"codigo":"EMC5456","nome":"Transmissão de Calor Computacional","ementa":"Expressão de derivadas em diferenças finitas. Séries de Taylor - Análise de erros. Represantação da equação geral da condução em diferenças finitas. Método clássico e método de volume de controle. Aplicação das condições de contorno. Métodos de solução do sistema de equações algébricas. Métodos ponto por ponto e linha por linha. Solução da equação da condução em geometrias arbitrárias. Solução atrevés do uso de compuitadores, de problemas transientes e permanentes de condução. Introdução à solução de problemas de convecção.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1456","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5457":{"codigo":"EMC5457","nome":"Ventilação Industrial","ementa":"Captadores. Principais tipos de coletores. Noções sobre transporte pneumático. Cálculo de dutos. Seleção dos equipamentos. Detalhes de projeto. Balanceamento e testes das instalações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1457","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5458":{"codigo":"EMC5458","nome":"Transporte de Massa","ementa":"Fundamentos. Equações de transferência de massa. Difusão em regime transiente. Transferência de massa por convecção. Processos de interface. Correlações. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1459","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5459":{"codigo":"EMC5459","nome":"Energia Solar","ementa":"Revisão de transferência de calor. Radiação solar. Coletores planos. Dimensionamento de coletores. Desempenho. Fatores de transferência de calor. Armazenamento do calor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1459","prerequisito":"EMC5445","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5462":{"codigo":"EMC5462","nome":"Tópicos Especiais em Termotécnica","ementa":"Assuntos específicos relacionados com a área de veículos, motores de combustão interna e combustiveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1462","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5463":{"codigo":"EMC5463","nome":"Controle de Ambiente","ementa":"Carga de radiação sobre edificações. Geometria de radiação. Radiação da abóboda celeste. Métodos de estimativa. Assimetria do campo interno da radiacão. Influência sobre o conforto. Transmissão de calor em edificações. Métodos de análise. Problemas envolvendo transmissão de calor com armazenamento térmico. Espaços de compensação térmica. Comportamento térmico de edificações em períodos noturnos. Radiação atmosférica. Ventilação: projeto e dimensionamento das aberturas. Migração de umidade em edificações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1463","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5464":{"codigo":"EMC5464","nome":"Tópicos de Sistemas Hidráulicos","ementa":"Revisão de alguns aspectos básicos de sistemas hidráulicos oferecidos na disciplina de Fundamentos de Sistemas Hidráulicos e Pneumáticos -","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1464","prerequisito":"EMC5443","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5465":{"codigo":"EMC5465","nome":"Tópicos de Pneumática","ementa":"A pneumática moderna na automação industrial. Vantagens e desvantagens da pneumática. Campo de aplicação. Sinais analógicos e digitais. Sistemas reativos e transformativos. Estrutura típica dos sistemas pneumáticos. Caracterização e princípio de funcionamento de componentes para automação  pneumática. Fundamentos da álgebra Booleana. Projeto de comandos combinatórios e seqüenciais. Métodos intuitivo, cascata e passo-a-passo. Projeto para o uso de elementos pneumáticos, eletropneumáticos e controladores lógicos programáveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1465","prerequisito":"EMC5443","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5466":{"codigo":"EMC5466","nome":"Modelação e Simulação de Sistemas Térmicos","ementa":"Solução numérica de equações algébricas. Solução numérica de equações diferenciais. Modelação básica. Simulação do escoamento de fluidos. Simulação de sistemas atribuídos em regime permanente. Simulação dinâmica de sistemas distribuídos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC1466","prerequisito":"EMC5403 e EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5115":{"codigo":"EPS5115","nome":"Pesquisa Operacional III","ementa":"Familiarização com conceitos e técnicas de teoria de grafos: definições básicas; árvores; problemas de cobertura e partição de conjuntos; problemas de p-medianas e p-centros; coloração de grafos; algoritmos de busca e caminhos mínimos; fluxos em redes; problemas Eulerianos e Hamiltoneanos; emparelhamento. Métodos meta-heurísticos: busca tabu, algoritmo genético, simulated annealing, ant systems. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1115","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5141":{"codigo":"EPS5141","nome":"Tópicos Especiais em Pesquisa Operacional","ementa":"Estudo de caso com aplicações de técnicas de Pesquisa Operacional. \n- Artigos diversos publicados em revistas sobre temas relacionados com os estudos de caso \nrealizados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1141","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5145":{"codigo":"EPS5145","nome":"Tópicos Especiais em Qualidade Total","ementa":"Qualidade total. A Função qualidade. A abordagem sistêmica da qualidade. Missão das organizações e qualidade total. Qualidade organizacional. Gestão participativa. Os recursos humanos e a melhoria contínua. Normalização técnica. Requisitos para sistema de garantia de qualidade a partir da ISO 9000. A importância da automação industrial no Brasil e no mundo. Robôs e comando numérico. CAD\/CAM\/CAE, AGV, Sensores, CN, CNC, DNC e CIM.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5146":{"codigo":"EPS5146","nome":"Tópicos Especiais em Arranjo Físico","ementa":"Método para Estudo do Arranjo Físico. Estudo de casos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1142 ou EPS5142","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5211":{"codigo":"EPS5211","nome":"Programação Econômica e Financeira","ementa":"Sistema Econômico: juros simples e compostos; taxa nominal e efetiva; método valor atual; balanço e princípios contábeis básicos. Plano de cotas. Patrimônio líquido. Demonstração de lucros e perdas. Sistema tributário. Estoques. Classificação ABC. Introdução à administração financeira.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1211","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5216":{"codigo":"EPS5216","nome":"Sistemas de Informações Gerenciais","ementa":"Introdução aos sistemas informações gerenciais. Sistemas de informações e organizações. O processo de desenvolvimento de sistemas de informações. Impacto e avaliação de sistemas de informações. Tipos de sistema de informação. Tópicos em gerenciamento dos sistemas. O futuro da tecnologia da informação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5224":{"codigo":"EPS5224","nome":"Finanças em Gestão de Empresas","ementa":"Introdução a moderna teoria de investimentos, títulos e mercados. Alguns conceitos estáticos. Gestão de carteiras de investimentos. Carteira eficiente. Relação entre risco, retorno esperado e medida de desempenho. Mercado de capitais e carteira do mercado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5228":{"codigo":"EPS5228","nome":"Logística Empresarial","ementa":"Conceito e evolução da logística. Papel da logística na empresa moderna. Logística no Brasil. Enfoque sistêmico e logístico: interfaces, marketing e logística, solução global. Subsistemas logísticos: transportes, armazenagem e distribuição física de produtos. Logística de suprimentos. Tratamento integrado estoque-distribuição. Custos e tarifação. Nível de serviço e sua quantificação. Tratamento da informação. Gestão do sistema logístico. Estudo da casos: roteirização de veículos, análise de artigos, curva ABC, etc..","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5233":{"codigo":"EPS5233","nome":"Gerência Industrial III","ementa":"Integração e revisão dos conhecimentos de administração de vendas, administração da produção, contabilidade, economia da engenharia, economia de empresas e gerência de recursos humanos através de estudos de casos e jogos empresarias.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1233","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5240":{"codigo":"EPS5240","nome":"Gerenciamento de Projetos","ementa":"O ciclo de vida do projeto. As funções administrativas no projeto. O gerente do projeto. Organização da equipe. Planejamento do projeto. Programação. Cronogramas. Rêdes. Orçamentos. Controle do projeto. Interligação do projeto com a empresa.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1240","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5241":{"codigo":"EPS5241","nome":"Planejamento Estratégico","ementa":"Planejamento estratégico e objetivos. Sistemas de planejamento estratégico. Sistemas de planos. O processo de planejamento estratégico. O subsistema de decisão para planejamento. Subsistema de informação e organização para planejamento. Subsistema de gerência para planejamento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1241","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5242":{"codigo":"EPS5242","nome":"Controle Estatístico de Qualidade","ementa":"Aplicação da estatística ao controle de qualidade. Controle estatístico de processos. Planos de amostragem. Inspeção por atributos. Inspeção por variáveis. Introdução à contabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1242","prerequisito":"EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5244":{"codigo":"EPS5244","nome":"Operações em Microcomputadores","ementa":"Utilização de equipamentos. Desenvolvimento de programas simples. Utilização de aplicativos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS1244","prerequisito":"EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5245":{"codigo":"EPS5245","nome":"Sistema de Movimentação e Armazenagem","ementa":"Introdução. Princípios básicos. Acondicionamento. Embalagem. Utilização. Equipamentos. Análise de problemas. Dimensionamento de espaços. Custos de movimentação. Implantação de um projeto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1226 ou EPS1245","prerequisito":"EPS5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5246":{"codigo":"EPS5246","nome":"Sistema de Apoio a Decisão em Engenharia de Produção","ementa":"Introdução ao uso dos micros, sistemas de apoio a decisão, análise de custo-volume-lucro, otimização linear pelo método simplex, gerência ótima de estoque, árvores de decisão, PERT-CPM, otimização de fila e análise de séries temporais: médias móveis, amortização exponencial, regressão linear simples, regressão linear múltipla, análise de índices financeiros, fluxo de caixa descontado, gerência de carteira de ativos financeiros, auxílio à decisão multicritério.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1246","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5247":{"codigo":"EPS5247","nome":"Delineamento de Experimentos","ementa":"Análise de regressão. Delineamento de experimentos: delineamento sem restrições; blocos casualizados; quadrados latinos; experimentação e análise fatorial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1247","prerequisito":"EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5248":{"codigo":"EPS5248","nome":"Racionalização da Construção","ementa":"Produtividade na construção. Racionalização: edificação\/produto e edificação\/processo. Economia da construção. Otimização econômica da edificação\/produto. Análise edificação\/processo. Construção tradicional versus construção industrializada.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1248","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5249":{"codigo":"EPS5249","nome":"Analise de Sistemas de Produção","ementa":"Função estratégia da produção: patologia das organizações. Teoria de sistemas aplicada à produção: conceitos essenciais; organização e conceito de sistema; propriedades dos sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; definição de sistemas, subsistemas de supersistemas; concepção de modelo conceitual; comparação do modelo conceitual com situação de problema; definição de mudanças possíveis; determinação de ações de melhorias. Abordagem sistêmica para a decisão em sistemas de produção: investigação de situações de estudo; identificação e decisão para a melhoria da produção.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5250":{"codigo":"EPS5250","nome":"Técnicas Modernas de Produção","ementa":"A macro-estratégica para melhoria da produção: política, sistemas, sub-sistemas e posturas. Integração de técnicas para a qualidade e produtividade. Controle total da qualidade, perda zero, gestão participativa (polivalência e círculos de qualidade), automação, just-in-time\/kanban (e alternativos). Comprovação entre sistemas de produção (ocidentais e o exemplo japonês).","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS1243 ou EPS5243","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5251":{"codigo":"EPS5251","nome":"Técnicas de Previsão para Engenheiros","ementa":"Introdução qualitativa. Introdução quantitativa. Médias móveis e decomposição de séries. Holt-Winters e outros métodos determinísticos. Regressão simples. Regressão múltipla. ARIMA. Organização Empresarial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5316":{"codigo":"EPS5316","nome":"Gestão da Inovação","ementa":"Processo de inovação, estudos de casos, análise econômica da inovação, produção de inovação, inovação e ciclos, mudanças técnicas, análise multicritério da inovação, 'management' da informação tecnológica, formulação de estratégias tecnológicas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5317":{"codigo":"EPS5317","nome":"Inovação de Produtos e Processos","ementa":"Introdução: a empresa, o supersistema, as mudanças; O cliente e seus problemas; atendimento; inovação e criatividade; inovação e diferenciação; inovação de produtos e processos - aspectos metodológicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2600,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5318":{"codigo":"EPS5318","nome":"Padronização de Empresas\/Qualidade Total","ementa":"Conceito de padronização; procedimentos para padronização; principais padrões da empresa; como garantir o cumprimento dos padrões; resultados da padronização; ISO 9000, ISO 9001, ISO 9002, ISO 9003, ISO 9004.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2300,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5320":{"codigo":"EPS5320","nome":"Gestão da Tecnologia e da Inovação","ementa":"Inovação tecnológica: definição e perspectiva; o processo de inovação tecnológica; criação e disseminação de tecnologia; adoção e implementação de tecnologia - o contexto da mudança, processos decisórios implementação; inovação de processos - entendendo, selecionando e melhorando processos existentes, implementação das inovações através da tecnologia de informação; gerenciamento do processo de inovação - criando condições para o trabalho criativo; formulação de estratégias.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5321":{"codigo":"EPS5321","nome":"Integração da Computação no Projeto da Produção I","ementa":"Introdução; Modelagem geométrica; Projeto auxiliado pelo computador; engenharia concorrente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5322":{"codigo":"EPS5322","nome":"Integração da Computação no Projeto da Produção II","ementa":"Tecnologia de grupo; Planejamento do processo; Planejamento e controle da fabricação integrada. Controle da Fabricação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5323":{"codigo":"EPS5323","nome":"Integração da Computação no Projeto da Produção III","ementa":"Controle de Fabricação (Controle Numérico); Robótica; Medidas, Análise e Atuação; Introdução ao CIM.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5321 e EPS5322","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7006":{"codigo":"EPS7006","nome":"Métodos Quantitativos na Gestão da Produção Industrial","ementa":"Gestão da manutenção e confiabilidade de Equipamentos. Planejamento da capacidade de produção. Modelos e controle de estoque e formação de lote. Modelos de seqüenciamento e programação da produção. Balanceamento de linhas de produção. Planejamento de Materiais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7007":{"codigo":"EPS7007","nome":"Avaliação de Desempenho","ementa":"Conceito e evolução das técnicas de Avaliação de Desempenho. Métodos locais- Estatísticos, Mapas, Gráficos, Diagramas e Pareto. Métodos Corporativos - BSC, Baldrige, FPNQ, Nevada, Hronec, McKinsey 7-S, etc. Métodos Construtivistas - SSM, MCDA-C, Estruturação - Contextualização, Elementos Primários de Avaliação, Conceitos, Mapas meio-fim, Árvore de Valor, descritores, níveis âncora. Avaliação - função de valor, independência, taxas, perfil de desempenho. Recomendações - análise de sensibilidade, processo gerador de ações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7008":{"codigo":"EPS7008","nome":"Gestão Estratégica da Tecnologia da Informação","ementa":"Competitividade; Empresas Inteligentes (Gerenciamento na Era da Informação); Plano de ação em GC; Gestão da Informação e o Suporte à Decisão; Tecnologia da Informação e BI; Tecnologias da informação e GC; Implantação de Projetos de TI e GC.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7009":{"codigo":"EPS7009","nome":"Teoria de Decisão","ementa":"- Introdução: Teoria Normativa e a Teoria Descritiva. Estruturação de problemas de decisão: modelagem de alternativas, modelagem das influências do ambiente e modelagem de preferências. Matriz e árvore de decisão. Princípio da Dominância. Decisão sob incerteza. Decisão sob risco. Princípio de Bernoulli. Avaliação e levantamento da informação. Noções sobre decisão com múltiplos objetivos: função de valor, método AHP, métodos outranking.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7011":{"codigo":"EPS7011","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando à realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovado pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7012":{"codigo":"EPS7012","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programas de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7013":{"codigo":"EPS7013","nome":"Empreendedorismo","ementa":"- A formação da Personalidade; O processo comportamental; As necessidades do empreendedor; O conhecimento para empreender; O empreendedor e suas habilidades; Os valores do empreendedor; O processo evolutivo das empresas; Modelos de Ciclo de Vida; A personalidade do empreendedor e o ciclo de vida da organização.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7014":{"codigo":"EPS7014","nome":"Redes de Empresa","ementa":"Globalização e Competitividade, Competitividade Regional, Aglomerações Produtivas, Redes e Consórcios de Empresas, Cadeias de Fornecedores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7036":{"codigo":"EPS7036","nome":"Atividades Complementares A","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7037":{"codigo":"EPS7037","nome":"Atividades Complementares B","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7038":{"codigo":"EPS7038","nome":"Sistemas de Produção Enxutos","ementa":"Origens, visão geral do Sistema Toyota de Produção (STP). O Mecanismo da Função Produção: a função processo e a função operação. Princípios da Manufatura Enxuta. Valor e desperdícios no sistema produtivo. Mapeamento de fluxo de valor. Tempo Takt. Inventário. Supermercado. Troca rápida de ferramentas (TRF). Fluxo contínuo. Células. Balanceamento de linha, Trabalho padronizado, TPM, Sistemas Canban, Linha FIFO, Programação de produção,  Controle de qualidade zero defeitos e poka-yokes, gerenciamento visual e kaizen (melhoria contínua). Implantação da Manufatura Enxuta. Desenvolvimento Enxuto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7039":{"codigo":"EPS7039","nome":"Projeto para Manufatura Enxuta","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5101":{"codigo":"INE5101","nome":"Simulação Discreta","ementa":"Definições, metodologia: formulação do problema, formulação do modelo, formulação do programa para computador, validação do projeto experimental, análise dos dados. Modelos. Validação. Experimentos práticos. Geração de variáveis estocásticas. Geração de números pseudo-aleatórios. Linguagens de simulação. Estudo de casos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CEC1107 ou CEC5101","prerequisito":"EPS7003 ou INE5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5108":{"codigo":"PSI5108","nome":"Psicologia Aplicada a Administração","ementa":"Psicologia organizacional - histórico, caracterização e áreas de atuação. Problemas humanos nas organizações - características da personalidade, integração indivíduo X organização, necessidades humanas e motivação para o trabalho. A organização como contexto social - processos de grupo, cultura organizacional e conflito nas organizações. Criatividade e processo decisório. Diagnóstico e desenvolvimento. O poder nas organizações. Administração de conflitos. A alienação no trabalho.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"PSI1302","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DIR5996":{"codigo":"DIR5996","nome":"Noções Gerais de Direito","ementa":"Pessoas. Bens. Fato jurídico. Direito de vizinhança. A empresa. Registro do Comércio. Nome comercial. Propriedade industrial. Sociedades comerciais. Títulos de crédito. Empregado. Empregador. Contrato de trabalho. Estabilidade e Fundo de Garantia do Tempo de Serviço. Segurança e Medicina do Trabalho. Previdência Social. Legislação relativa aos profissionais da engenharia. CONFEA. CREA. Exercício profissional. Responsabilidade profissional. Registro de autonomia de planos e projetos. Remuneração profissional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"DPS1140 ou DPS5140","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5201":{"codigo":"EPS5201","nome":"Planejamento e Controle da Produção","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5205":{"codigo":"EPS5205","nome":"Estudo do Trabalho, Arranjo Físico e Mov. de Mat.","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1205","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5218":{"codigo":"EPS5218","nome":"Gerência Industrial","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1218 ou (EPS5231 e EPS5232) ou (EPS1231 e EPS1232)","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5302":{"codigo":"EPS5302","nome":"Projeto do Produto","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1302","prerequisito":"EPS5205","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FSC5114":{"codigo":"FSC5114","nome":"Física IV","ementa":"Indutância e suas aplicações; as propriedades magnéticas da matéria: materiais diamagnéticos, paramagnéticos e ferromagnéticos, as leis que os regem. Equações de Maxwell: interpretação física e aplicações. Solução de circuitos em série (RLC) de corrente alternada e transformadores. Luz: natureza, propagação e fenômenos ópticos (interferência, difração e polarização). Física Moderna: introdução à Mecânica Quântica, Física Atômica e Nuclear. Relatividade Especial: Leis e aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"FSC1114","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE5101":{"codigo":"LLE5101","nome":"Inglês Instrumental I-A","ementa":"Introdução ao desenvolvimento das estratégias de leitura e estudo de estruturas básicas da língua inglesa tendo como objetivo a compreensão de textos preferencialmente autênticos, gerais e específicos da área.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LLE5712":{"codigo":"LLE5712","nome":"Inglês I-B","ementa":"","carga_horaria":60,"fase_sugestao":999,"equivalencia":"LLE1103","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLV5175":{"codigo":"LLV5175","nome":"Português Pratico - Redação I","ementa":"Estudo do texto: conteúdo, linguagem  e estrutura. A redação técnica e científica: tipos e característicos da descrição e da dissertação. Redação oficial: documentos e correspondências. Estudo assistemático de conteúdos gramaticais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"LLV1114 ou LLV1175","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"MTM5164":{"codigo":"MTM5164","nome":"Calculo D","ementa":"Números Complexos; séries numéricas;  séries de funções, equações diferenciais parciais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"MTM1164","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"SPO5128":{"codigo":"SPO5128","nome":"Sociologia Geral A","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CSO5128","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"MTM5801":{"codigo":"MTM5801","nome":"H Cálculo I","ementa":"Números: propriedades básicas, valor absoluto, desigualdades, números naturais, inteiros, racionais e reais. Funções reais de uma variável real: gráficos, limites, continuidade, ínfimo e supremo, existência de máximo de uma função contínua em um intervalo fechado. Derivada: diferenciação, significado da derivada, convexidade, derivada da função inversa. Integral: somas de Riemann, Teorema fundamental do cálculo. Funções trigonométricas, logarítmica e exponencial. Aplicações numéricas. Uso de pacotes.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5802":{"codigo":"MTM5802","nome":"H Cálculo II","ementa":"Integral, Técnicas de Integração, Aproximações por Polinômios, Seqüências e Séries, Convergência Uniforme.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5801 e MTM5811","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5803":{"codigo":"MTM5803","nome":"H Cálculo III","ementa":"Sistemas de coordenadas: cartesianas, polares, cilíndricas, esféricas, mudança de coordenadas. Funções reais de várias variáveis: gráficos, limite, continuidade, derivação, gradiente, derivada direcional. Funções vetoriais: campos de vetores, divergente, rotacional, cálculo diferencial vetorial. Derivadas de ordem superior: teorema de Taylor, extremos de funções reais, multiplicadores de Lagrange, teorema da função implícita. Integrais duplas: integração sobre diversos tipos de regiões, mudança na ordem de integração. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5802","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5804":{"codigo":"MTM5804","nome":"H-Cálculo IV","ementa":"Integrais de Curva e Superfícies, Teoremas de Integração da Análise Vetorial, Aplicações.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5803","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5811":{"codigo":"MTM5811","nome":"H-Álgebra I","ementa":"Vetores em R2 e R3. Produto interno. Produto vetorial no R3. Retas no R2 e R3. Planos no R3. Produtos mistos no R3. Sistemas lineares. Matrizes. Determinantes. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5812":{"codigo":"MTM5812","nome":"H-Álgebra II","ementa":"Espaços vetoriais. Bases e dimensão. Transformações lineares. Produto interno. Bases ortonormais. Decomposição QR. Autovalores e autovetores de um operador linear. Métodos numéricos para cálculo de autovalores e autovetores. Matrizes autoadjuntas e o teorema espectral. Identificação de cônicas em R2 e quádricas em R3. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5811","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5813":{"codigo":"MTM5813","nome":"H-Álgebra III","ementa":"Autovalores e autovetores: aplicações, Matrizes definidas positivas, Computação com matrizes, \nProgramação linear , Uso de pacotes computacionais","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5812","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5814":{"codigo":"MTM5814","nome":"H-Análise Linear","ementa":"Convergência em Espaços Euclidianos. Teoria Geral das EDO. \t\nTransformada de Laplace. Séries de Fourier. Problemas de fronteira   \t\npara EDO e EDP. Uso de Pacotes.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5813","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20071":{"id":"428","codigo":20071,"codigo_curso":214,"carga_horaria_ufsc":4338,"carga_horaria_mec":4320,"aulas_semana_min":14,"aulas_semana_esperado":27,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20071","ucs":{"EGR5213":{"codigo":"EGR5213","nome":"Representação Gráfica Espacial","ementa":"Introdução sobre o funcionamento do sistema visual humano; Formas de visualização humana; Sistema de projeção ortogonal Mongeano; Elementos básicos de construção - ponto, reta, e plano; Mecanismos de determinação de verdadeira grandeza - Rebatimento e Mudança de plano; Construção de objetos (modelagem) envolvendo, intersecção, secção e planificação.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EGR5212","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5120":{"codigo":"EPS5120","nome":"Introdução a Engenharia de Produção","ementa":"Diretrizes curriculares. Perfil do profissional. Evolução da engenharia. Desenvolvimento econômico e capacitação C&T. Contextualização da Eng. de Produção. Produção na organização. Fronteiras da Função Produção. Modelo de transformação. Objetivos da produção. Estratégia de produção. Princípios gerais de projeto em produção: projeto de produtos e serviços e projeto de processos. Natureza do planejamento e controle na produção. Noções de Metodologia Científica e de Comunicação Técnica.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EPS2302","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EQA5116":{"codigo":"EQA5116","nome":"Química Tecnológica","ementa":"Estequiometria,  mol.  Combustão.  Combustíveis  sólidos,  liquidos  e  gasosos. Estrutura  quimica  de  polimeros.  Cristalinidade.  Propriedades  quimicas. Propriedades  mecânicas.  Principais  polimeros  de  uso  geral.  Siderurgia:  obtenção  do  ferro  gusa  e  do  aço.  Aços  especiais.  Oxidação-redução. Equação  de  Nernst.  Corrosão  metálica.  Tratamento  de  águas  para  caldeiras.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EQA5113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5101":{"codigo":"FSC5101","nome":"Física I","ementa":"Introdução aos conceitos fundamentais da cinemática, dinâmica e estática. Leis de conservação da energia e do momento linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"FSC5102","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3110":{"codigo":"MTM3110","nome":"Cálculo 1","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101 ou MTM5161","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5214":{"codigo":"EGR5214","nome":"Desenho e Modelagem Geométrica","ementa":"Introdução  ao  desenho  à  mão  livre.  Normas  para  o  desenho.  Técnicas  fundamentais  de  traçado  à  mão  livre.  Vistas  ortogonais  e  auxiliares.  Perspectivas  isométricas  e  cavaleiras.  Cotagem.  Escalas.  Indicação  do  estado  de  superfícies.  Tolerâncias  e  ajustes  mecânicos.  Introdução  ao  CAD.  Conceitos  básicos  e  tipos  de  modelagem.  Sistemas  de  coordenadas  e  de  entrada  de  dados.  Estratégias  de  criação  de  modelos.  Comandos  de  construção,  edição  e  visualização  de  modelos.  Vistas  secionais.  Representação  de  elementos  de  máquina:  Desenho  dos  elementos  de  união,  Desenho  dos  elementos  de  trasmissão.  Noções  de  projeto  e  de  representação  de  conjuntos  e  detalhes  mecânicos.","carga_horaria":108,"fase_sugestao":2,"equivalencia":"EGR5604 e EGR5623","prerequisito":"EGR5213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5234":{"codigo":"EPS5234","nome":"Análise de Sistemas de Produção","ementa":"Conceitos, definições e propriedades de sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; caracterização do sistema, subsistemas e supersistema; caracterização do modelo conceitual; comparação do modelo conceitual com a situação de problema; definição de mudanças possíveis; determinação de ações e melhorias. Teoria de Sistemas aplicada à Engenharia de Produção. Sistemas Organizacionais: marketing, produção, materiais, pessoal, finanças\/controladoria e informática. Abordagem sistêmica para a decisão em sistemas de produção","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EPS2320 ou EPS5229","prerequisito":"EPS2302 ou EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7001":{"codigo":"EPS7001","nome":"Informática para Engenharia de Produção","ementa":"Conceitos básicos. Principais aplicativos para engenheiros de Produção. Estrutura de dados. Algoritmos: formulação, representação e noções de complexidade. Linguagem de programação: estrutura, tipos de dados simples e estruturados, instruções de repetição, funções e procedimentos. Noções de orientação a objetos. Fundamentos em Bancos de Dados Relacionais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EPS2301","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5002":{"codigo":"FSC5002","nome":"Física II","ementa":"Estudo da Cinemática e Dinâmica da rotação de corpos rígidos. Oscilações e ondas Mecânicas(som). Estática e Dinãmica dos Fluídos. Noções sobre temperatura, calor, princípios da Termodiâmica e teoria cinética dos gases.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5132 ou FSC5137","prerequisito":"(FSC5101 e MTM5161) ou (FSC5102 e MTM5161) ou (FSC5101 e MTM3101) ou (FSC5102 e MTM3101) ou (FSC5101 e MTM3110) ou (FSC5102 e MTM3110)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5122":{"codigo":"FSC5122","nome":"Física Experimental I","ementa":"Complementação  dos conteúdos de mecânica, acústica, termologia. Obtida através de montagem e realização de experiências, em número de 12 (doze), versando sobre os tópicos acima.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"FSC5124","prerequisito":"FSC5101 ou FSC5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3120":{"codigo":"MTM3120","nome":"Cálculo 2","ementa":"Aplicações da integral definida. Técnicas de integração (por partes, substituição trigonométrica, frações parciais). Integral imprópria. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies. Funções de várias variáveis. Derivadas parciais. Máximos e mínimos de funções de duas variáveis.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"(MTM3102 e MTM3111) ou (MTM3102 e MTM5512) ou (MTM5162 e MTM5512) ou (MTM3111 e MTM5162)","prerequisito":"MTM3101 ou MTM3110 ou MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3121":{"codigo":"MTM3121","nome":"Álgebra Linear","ementa":"Matrizes. Determinantes. Sistemas lineares. Espaço vetorial real. Produto interno. Transformações lineares. Autovalores e autovetores de um operador linear. Diagonalização. Aplicações da Álgebra Linear.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3112 ou MTM5245","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5201":{"codigo":"EMC5201","nome":"Materiais de Engenharia","ementa":"Materiais  e  Engenharia.  Ligações  químicas  e  seu  efeito  nas  propriedades  dos  principais  Materiais  de  Engenharia.  Estruturas  Cristalinas.  Defeitos  em  Sólidos.  Difusão  em  Sólidos.  Propriedades  Mecânicas  dos  Metais.  Falhas  em  Metais.Diagramas  de  Equilíbrio.  Análise  microestrutural  de  Materiais,  principais  processamentos  de  materiais  metálicos  e  sua  correlação  com  microestrutura  e  propriedades  resultantes  no  material.Transformações  de  fases  em  metais:  reações  perlítica,  bainítica  e  martensítica.Tratamentos  térmicos  em metais:  recozimento,  normalização,  têmpera,  revenido,  solubilização  e  precipitação.  Estrutura,  Propriedades  e  Processamento  de  Cerâmicas  de  Alto  Desempenho.  Estrutura,  Propriedades  e  Processamento  de  Plásticos  de  Engenharia.  Noções  de  Propriedades  e  Processamento  de  Materiais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EQA5116 ou EQA5119","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7002":{"codigo":"EPS7002","nome":"Probabilidade e Modelos Estocásticos","ementa":"Probabilidade: definições, variáveis aleatórias discretas e contínuas; distribuições conjuntas, marginais e condicionais; funções de distribuições de probabilidades: normal, qui-quadrado, exponencial, binominal e Poisson. Processos Estocásticos: definições, cadeias de Markov e matriz de transição. Teoria das filas: sistemas M\/M\/1, M\/M\/c e M\/M\/ck. Simulação: geração de números pseudo-aleatórios, formulação de modelos de simulação; validação do modelo; linguagens de simulação. Noções de confiabilidade de sistemas.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"(MTM3102 ou MTM3120 ou MTM5162) e (MTM3112 ou MTM3121 ou MTM5223 ou MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5103":{"codigo":"FSC5103","nome":"Estática para Engenharia","ementa":"Estudo  das  condições  de  equilíbrio  de  partículas  e  de  corpos  rígidos  (estruturas,  vigas,  treliças  etc)  no  plano  e  no  espaço,  envolvendo  o  cálculo  das  reações  em  conexões  padrão  utilizadas  em  engenharia;  cálculo  de  forças  axiais,  esforços  cortantes  e  momentos  fletores  em  estruturas  e  vigas;  cálculo  de  centróides  de  áreas  e  de  volumes  de  figuras  simples  e  de  figuras  compostas;  cálculo  de  momentos  de  inércia  de  chapas  planas  simples  e  compostas  e  de  sólidos  simples  e  compostos;  equilíbrio  de  cabos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMC5132 ou FSC5050","prerequisito":"(FSC5101 e MTM5161) ou (FSC5102 e MTM5161) ou (FSC5101 e MTM3101) ou (FSC5102 e MTM3101) ou (FSC5101 e MTM3110) ou (FSC5102 e MTM3110)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5113":{"codigo":"FSC5113","nome":"Física III","ementa":"Análise dos principais fenômenos da eletricidade  e magnetismo abrangendo o estudo de campo elétrico, potencial elétrico, capacitor, corrente elétrica, força eletromotriz, campo magnético e indução eletromagnética.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"FSC5133","prerequisito":"(FSC5002 ou FSC5137) e (MTM3102 ou MTM3120 ou MTM5162)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5202":{"codigo":"INE5202","nome":"Cálculo Numérico em Computadores","ementa":"Erros e Sistemas de Numeracão. Solução de equações algébricas e transcendentais. Solução de equações polinomiais. Sistemas de equações lineares e não lineares. Interpolação Ajustamento de curvas. Integração numérica. Solução numérica de equações diferenciais ordinárias e sistemas de equações diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"INE5232","prerequisito":"EPS2301 ou EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3103":{"codigo":"MTM3103","nome":"Cálculo 3","ementa":"Integração múltipla: integrais duplas e triplas. Noções de cálculo vetorial: curvas e superfícies. Campos escalares e vetoriais. Integrais de linha e de superfícies. Teoremas de Green, Stokes e da Divergência.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM5163","prerequisito":"MTM3102 ou MTM3120 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3131":{"codigo":"MTM3131","nome":"Equações Diferenciais Ordinárias","ementa":"Equações diferenciais ordinárias de primeira ordem. Equações diferenciais ordinárias lineares homogêneas de ordem n. Equações diferenciais ordinárias lineares não homogêneas de ordem 2. Noções gerais de Transformada de Laplace. Sistemas de Equações Diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM3102 ou MTM5163","prerequisito":"MTM3101 ou MTM3120 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5128":{"codigo":"EMC5128","nome":"Mecânica dos Sólidos A","ementa":"Conceitos de projeto. Concepção, projeto preliminar, projeto detalhado, análise. Tipos de análise. Análise experimental, análise por simulação com modelos. Tipos de modelos. Modelos mecânicos, modelos matemáticos, modelos numéricos. Tipos de modelos usados em Mecânica dos Sólidos: barras, vigas, placas, cascas, sólidos. Identificação e idealização dos modelos quanto a sua forma geométrica, carregamento, materiais e condições de contorno. Solicitações internas. Reações. Diagramas. Esforços em treliças. Tensões. Estados de tensão. Equações diferenciais de equilíbrio. Transformação de tensões e deformações. Critérios de falha. Tensões uniaxiais, pinos, colunas, tensões em treliças. Deformações, definições, relações deformação-deslocamento. Transformação de deformações. Diagramas tensão-deformação, Lei de Hooke. Deformações axiais em barras e problemas hiperestáticos em barras. Flexão simples plana, obliqua, seções assimétricas. Cisalhamento em vigas longas. Torção. Solicitações compostas.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"FSC5103 e (MTM3112 ou MTM3121 ou MTM5223 ou MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5405":{"codigo":"EMC5405","nome":"Fundamentos da Termodinâmica","ementa":"Origens  da  termodinâmica:  aspectos  históricos.  Conceitos  básicos.  Primeira  lei.  Segunda  lei.  Entropia.  Equilíbrio  termodinâmico  (sistemas  homogêneos,  relações  de  Maxwell,  relações  envolvendo  entalpia,  energia  interna  e  entropia;  fator  de  compressibilidade  isotérmica  e  coeficiente  de  compressibilidade  volumétrica;  comportamento  de  gases  reais  e  equações  de  estado;  diagrama  generalizado  para  variações  de  entalpia  a  temperatura  constante;  diagrama  generalizado  para  variações  de  entropia  a  temperatura  constante;  desenvolvimento  de  tabelas  de  propriedades  termodinâmicas a  partir  de  dados  experimentais).  Transições  de  fase.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMC5401","prerequisito":"FSC5002 ou FSC5137 e MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7000":{"codigo":"EPS7000","nome":"Estatística e Modelos de Previsão","ementa":"Estatística: planejamento de pesquisa e levantamento de dados, amostragem, análise de dados, análise de correlação e regressão, estimação de parâmetros, testes de hipóteses paramétricos e não paramétricos. Previsão: médias móveis e decomposição de séries, Holt-Winters e outros métodos determinísticos. Regressão simples e múltipla. Modelos ARIMA.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EPS7003","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7009":{"codigo":"EPS7009","nome":"Teoria de Decisão","ementa":"- Introdução: Teoria Normativa e a Teoria Descritiva. Estruturação de problemas de decisão: modelagem de alternativas, modelagem das influências do ambiente e modelagem de preferências. Matriz e árvore de decisão. Princípio da Dominância. Decisão sob incerteza. Decisão sob risco. Princípio de Bernoulli. Avaliação e levantamento da informação. Noções sobre decisão com múltiplos objetivos: função de valor, método AHP, métodos outranking.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EPS2340","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7060":{"codigo":"EPS7060","nome":"Gestão Ambiental","ementa":"Fundamentos da questão ambiental. Modelos de produção e sustentabilidade. Ferramentas da gestão ambiental. Leis e normas ambientais e métodos de avaliação de impactos. Gerenciamento de resíduos. Desastres ambientais.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"","prerequisito":"EPS2302 ou EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5207":{"codigo":"FSC5207","nome":"Mecânica II - Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Dinâmica da partícula e do corpo rígido.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"(FSC5101 ou FSC5102) e (MTM3102 ou MTM3120 ou MTM5162)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3104":{"codigo":"MTM3104","nome":"Cálculo 4","ementa":"Sequências e séries numéricas. Sequências e séries de funções: séries de potências e séries de Fourier. Equações diferenciais parciais: método da separação de variáveis nas equações clássicas da onda, do calor e de Laplace.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"MTM5164","prerequisito":"MTM3102 ou MTM3131 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5138":{"codigo":"EMC5138","nome":"Mecânica dos Sólidos B","ementa":"Introduzir  conceitos  de  campos  de  deslocamentos,  de  tensões  e  de  energia  de  deformação  e  aplica-los  através  das  equações  fundamentais  da  mecânica  dos  sólidos:  equações  cinemáticas,  de  equilíbrio,  constitutiva  elástica,  e  identificação  de  condições  de  contorno  em  problemas  mecânicos.  Campos  de  tensão  em  cascas  cilíndricas  e  esféricas  delgadas.  Solução  do  problema  de  deflexão  de  vigas  isostáticas  e  hiperestáticas  pelo  método  da  integração  da  equação  diferencial  de  equilíbrio.  Flambagem elástica  e  inelástica  de  barras.  Introdução  ao  método  de  elementos  finitos  de  barras  e  vigas  em  estruturas  planas  e  espaciais.  Fornecer  aos  alunos  uma  visão  integrada  do  problema  de  falha  de  um  sistema  mecânico.  Definição  de modo  de  falha.  Teoria  de  fadiga  de  metais  por  nucleação  de  trinca.  Curva  tensão-vida.  Concentração  de  tensões  em entalhes.  Efeito  de  tensão  média.  Tensões  plásticas  de  flexão  de  vigas.  Efeitos  de  tensões  residuais  na  vida  de  fadiga.","carga_horaria":108,"fase_sugestao":5,"equivalencia":"EMC5121 e EMC5129","prerequisito":"EMC5128","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5236":{"codigo":"EMC5236","nome":"Medição de Grandezas Mecânicas","ementa":"Noções sobre experimentação. Grandezas a medir. Sistemas de medição. Características estatísticas e dinâmicas. Medição elétrica de grandezas mecânicas. Aparelhos para indicação e registro. Transdutores ativos. Transdutores passivos. Sistema de medição digital. Automação da medição.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5222","prerequisito":"EPS7000 ou EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5407":{"codigo":"EMC5407","nome":"Mecânica dos Fluidos I","ementa":"Conceitos  Fundamentais;  Estática  dos  Fluidos;  Formulações  Integral  e  Diferencial  de  Leis  de  Conservação;  Escoamento  Invíscido  Incompressível;  Análise  Dimensional  e  Semelhança;  Escoamento  Interno  Viscoso  Incompressível.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5445","prerequisito":"(EMC5405 e FSC5103 e MTM5163) ou EMC5405 e (FSC5103 e MTM3103)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5418":{"codigo":"EMC5418","nome":"Termodinâmica Aplicada","ementa":"Energia  disponível,  trabalho  reversível  e  irreversibilidade;  disponibilidade  e  eficiência  de  acordo  com  a  segunda  lei  da  termodinâmica;  equação  do  balanço  de  exergia.  Ciclos  de  potência;  co-geração;  ciclos  motores  e  ciclos  de  refrigeração.  Considerações  gerais  e  misturas  de  gases  perfeitos;  misturas  compostas  por  gases  e  um  vapor;  primeira  lei  da  termodinâmica  aplicada  às  misturas  de  gás  e  vapor;  processo  de  saturação  adiabática;  temperaturas  de  bulbo  úmido  e  de  bulbo  seco;  carta  psicrométrica.  Combustíveis  e  o  processo  de  combustão;  entalpia  de  formação;  aplicação  da  primeira  lei  da  termodinâmica  em  reações  químicas;  entalpia,  energia  interna  de  combustão  e  calor  de  reação;  temperatura  adiabática  de  chama;  terceira  lei  da  termodinâmica  e  entropia  absoluta;  aplicação  da  segunda  lei  da  termodinâmica  em  reações  químicas;  células  combustíveis;  processos  reais  de  combustão.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMC5406","prerequisito":"EMC5405","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7005":{"codigo":"EPS7005","nome":"Pesquisa Operacional","ementa":"Introdução: histórico, objetivos, restrições e modelos. Condições de otimalidade. Programação linear: modelos de programação linear, método simplex, dualidade, análise de sensibilidade e pós-otimalidade. Problemas lineares especiais.Programação não-linear; otimização multivariada; otimização sem restrições. Programação Inteira, Binária e Mista: algoritmos e modelos. Programação Dinâmica determinística e estocástica.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"(EPS2301 ou EPS7001) e (EPS2340 ou EPS7009)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7010":{"codigo":"EPS7010","nome":"Gestão Patrimonial","ementa":"Informação contábil no processo de produção das organizações. Dinâmica dos fluxos operacionais de curto e longo prazo. Princípios e procedimentos contábeis básicos. Demonstrativos contábeis para a gestão da produção. Indicadores financeiros do desempenho. Capital de giro, endividamento e estrutura de capital. Liquidez e fluxos de caixa. Rentabilidade, origem e aplicações de recursos.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS2350","prerequisito":"EPS2320 ou EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7020":{"codigo":"EPS7020","nome":"Ergonomia","ementa":"Introdução à Ergonomia: definições e histórico. Princípios de fisiologia do trabalho. Princípios de psicologia do trabalho. Antropometria e biomecânica. Princípios de organização do trabalho. Condições ambientais de trabalho. O projeto do trabalho. Introdução a Análise Ergonômica do Trabalho.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS2362","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5110":{"codigo":"EMC5110","nome":"Laboratório em Propriedades Mecânicas","ementa":"Medição  de  grandezas  físicas  como  resistência  à  tração,  deformação  elástica  e  plástica  de  materiais.  Estudo  e  execução  de  experimentos  em  mecânica  dos  sólidos  e  materiais  de  construção  mecânica.  Cálculo  de  constantes  elásticas,  ductilidade,  tenacidade,  resistência  ao  impacto,  vida  sob  fadiga.  Resistência  à  flexão  para  sólidos  frágeis.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMC5138 e EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5123":{"codigo":"EMC5123","nome":"Mecanismos","ementa":"Introdução. Conceitos e notações aplicado a mecanismos. Estudo de tipos de mecanismos. Síntese dimensional de mecanismos articulados. Análise e cinemática de cames planos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"FSC5207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5202":{"codigo":"EMC5202","nome":"Usinagem dos Materiais","ementa":"Conceituação  e  relevância  da  técnica  de  usinagem  dos  materiais  na  obtenção  de  componentes  e  produtos  de  engenharia  com  elevado  valor  agregado,  mediante  transformação  da  forma  e  dimensões  da  matéria-prima.  Conceito,  caracterização  e  funções  do  sistema  máquina  -  ferramenta  -  peça.  Sistemas,  processos  e  fundamente  da  usinagem  por  ação  mecânica  com  ferramentas  de  geometria  definida  e  não  definida;  por  ação  térmica  e  termo-química;  as  principais  variáveis  de  processo  em  cada  caso.  Fenômenos  térmicos,  mecânicos  e  químicos  envolvidos  nos  processos  de  usinagem.  Ferramenta  para  usinagem:  fundamentação  geométrica;  os  materiais  envolvidos  na  construção  destas;  os  mecanismos  de  desgaste  e  falha  (falência)  das  ferramentas,  as  principais  famílias  de  sistemas  (máquinas  ferramenta),  suas  características  e  aplicações.  Determinação  dos  custos  de  usinagem  e  análise  de  produtividade.  Os  defeitos  introduzidos  nos  produtos  usinados  por  ação  de  processos  e  as  conseqüências  desses  defeitos  para  a  aplicação  e  desempenho  dos  produtos.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5240","prerequisito":"EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5203":{"codigo":"EMC5203","nome":"Conformação de Metais e Moldagem de Polímeros","ementa":"Classificação  e  descrição  sumária  dos  diversos  processos  de  conformação  mecânica.  Tecnologia  e  campos  de  aplicação  dos  processos  de  forjamento,  laminação,  trefilação  e  extrusão.  Processos  de  conformação  de  chapas:  operação  de  corte,  dobramento,  estiramento  e  embutimento.  Introdução  a  estampabilidade  de  chapas.  Ferramentas.  Máquinas  utilizadas.  Fundamentos  do  processamento  de  polímeros.  Moldagem  por  extrusão  Moldagem  por  sopro.  Termoformagem. Moldagem  por  injeção.    Variantes  do  processo  e  tipos  de  moldes.  Projeto  e  fabricacao  de  moldes  com  CAE\/CAD\/CAM.  Confecção  de  moldes  com  técnicas","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5241 e EMC5261","prerequisito":"EMC5201 e EMC5236","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5410":{"codigo":"EMC5410","nome":"Laboratório em Ciências Térmicas","ementa":"Medição  de  grandezas  físicas  como  temperatura,  pressão,  fluxo  de  calor,  velocidade  e  vazão.  Estudo  e  execução  de  experimentos  em  termodinâmica,  mecânica  dos  fluidos  e  transmissão  de  calor.  Execução  de  balanços  de  energia,  avaliação  de  rendimentos,  contato  com  equipamentos  diversos.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMC5405","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5417":{"codigo":"EMC5417","nome":"Transmissão de Calor","ementa":"Mecanismos  básicos  de  transmissão  de  calor.  Princípios  básicos  da  condução  de  calor.  Condução  unidimensional.  Condução  bidimensional.  Condução  transiente.  Métodos  numéricos  na  condução.  Princípios  básicos  da  radiação  térmica.  Radiação  entre  superfícies.  Aplicações","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5403","prerequisito":"(EMC5405 e MTM5163) ou (EMC5405 e MTM3103)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5419":{"codigo":"EMC5419","nome":"Mecânica de Fluidos II","ementa":"Escoamentos  Turbulentos;  Escoamento  Externo  Viscoso  Incompressível;  Máquinas  de  Fluxo;  Escoamento  Compressível.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMC5408","prerequisito":"(EMC5407 e FSC5207 e MTM3104) ou (EMC5407 e FSC5207 e MTM5164)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7018":{"codigo":"EPS7018","nome":"Análise Gerencial de Custos","ementa":"- Princípios e métodos de custo. Análise de custo-volume-lucro. Custo padrão. Método dos centros de custos. Custeio baseado em atividades (ABC). Método da unidade de esforço de produção (UEP). Gestão por atividade (ABM).","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS2363","prerequisito":"EPS2350 ou EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7019":{"codigo":"EPS7019","nome":"Engenharia Econômica","ementa":"- Matemática Financeira: conceito de juros; relações de equivalência; taxas nominais e efetivas; amortização de dívidas (Price, SAC e Misto). Inflação e correção monetária. Análise econômica de investimentos: princípios e conceitos; VAUE, TIR e Pay-back; substituição de equipamentos; aluguel, leasing e financiamentos. Risco, incerteza e análise de sensibilidade. Calculadoras financeiras e planilhas.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS7009","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5113":{"codigo":"EEL5113","nome":"Eletrotécnica Geral","ementa":"Noções básicas de Eletricidade. Circuitos Elétricos. Transformadores. Motores Elétricos. Medidas Elétricas.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"EEL5115","prerequisito":"FSC5113 ou FSC5133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5210":{"codigo":"EMC5210","nome":"Laboratório em Manufatura e Metrologia","ementa":"Desenvolvimento  de  trabalhos  em  laboratórios  com  ênfase  em  atividades  práticas  nas  área  de  metrologia,  fundição,  conformação,  usinagem  e  processamento  de  polímeros.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMC5202 e EMC5203 e EMC5236","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5335":{"codigo":"EMC5335","nome":"Elementos de Máquinas","ementa":"Capacidade  de  carga  de  engrenagens  cilíndricas.  Uniões  por  parafusos.  Molas  helicoidais.  Eixos  e  Árvores.  Ligações  entre  cubo  e  eixo.  Mancais  de  rolamento  e  escorregamento.  Redutores.  Acoplamentos.  Freios  e  embreagens.  Correias  e  correntes.","carga_horaria":90,"fase_sugestao":7,"equivalencia":"EMC5330 e EMC5332","prerequisito":"EMC5123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5404":{"codigo":"EMC5404","nome":"Transmissão de Calor II","ementa":"Equações governantes da convecção; conceito da camada limite; efeitos da turbulência; solução de blasius; correlações para escoamentos externos; escoamentos internos; correlações; convecção natural;  equações governantes; correlações; modos de ebulição e condensação; correlações, trodadores de calor.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMC5407 e EMC5417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5222":{"codigo":"EPS5222","nome":"Modelos Econômicos Quantitativos","ementa":"Mercado: oferta e demanda. Formação da demanda: demanda individual e do mercado. Produção: tecnologia, insumos, produtividade e custos; maximização de lucros. Tipos de mercados: monopólio, monopsônio, concorrência perfeita, oligopólios. Estruturas de mercados e formação de preços. Teoria dos jogos e estratégia competitiva. Mercado para fatores de produção. Externalidades e bens públicos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS2330","prerequisito":"EPS7005 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5235":{"codigo":"EPS5235","nome":"Planejamento e Controle da Produção","ementa":"Visão geral dos sistemas de produção. Planejamento estratégico da produção. Planejamento mestre da produção. Programação da produção: administração de estoques, seqüenciamento,emissão e liberação de ordens. Acompanhamento da produção.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS7000 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7021":{"codigo":"EPS7021","nome":"Planejamento e Projeto do Produto","ementa":"Morfologia. Análise de valor. Ciclo de vida. Informações de projeto: levantamento das necessidades, requisitos de projeto. Projeto preliminar: geração de soluções, matrizes de seleção, análise de varáveis. Detalhamento de projeto. Projeto para fabricação. Aspectos ambientais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EPS2382","prerequisito":"(EPS2363 ou EPS7018) e (EPS2362 ou EPS7020)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5140":{"codigo":"EMC5140","nome":"Controle de Vibrações","ementa":"Caracterização dos movimentos vibratórios. Respostas de sistemas lineares estáveis. Modelagem matemática de sistemas mecânicos. Sistemas modelados com grau de liberdade. Informações sobre medição de vibrações. Problemas em máquinas rotativas. Sistemas modulados com dois ou mais graus de liberdade. Técnicas para o controle de vibrações.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"(EMC5138 e FSC5207) e (MTM3104 ou MTM5164)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5204":{"codigo":"EMC5204","nome":"Soldagem","ementa":"Características  gerais  dos  processos  de  soldagem  a  arco  voltaico.  O  arco  voltaico.  Fontes  de  energia  para  soldagem.  Processo  TIG.  Soldagem  com  eletrodos  consumíveis.  Processo  MIG\/MAG.  Soldagem  com  eletrodo  revestido.  Arame  tubular.  Efeitos  do  calor  em  soldagem.  Conceito  de  soldabilidade  e  descontinuidades.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMC5262","prerequisito":"EEL5113 e EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5227":{"codigo":"EPS5227","nome":"Planejamento Industrial","ementa":"Noções de planejamento empresarial. Etapas de um empreendimento industrial. Metodologia para elaboração dos ante-projetos. Estudos de mercado. Estudos de localização. Análise de tecnologias e fatores de produção. Caracterização do processo produtivo. Estudo do tamanho. Determinação do investimento. Projeção de receitas e custos. Análise de retorno do investimento.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2375","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5240":{"codigo":"EPS5240","nome":"Gerenciamento de Projetos","ementa":"O ciclo de vida do projeto. As funções administrativas no projeto. O gerente do projeto. Organização da equipe. Planejamento do projeto. Programação. Cronogramas. Rêdes. Orçamentos. Controle do projeto. Interligação do projeto com a empresa.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2351","prerequisito":"EPS7000 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7008":{"codigo":"EPS7008","nome":"Gestão Estratégica da Tecnologia da Informação","ementa":"Competitividade; Empresas Inteligentes (Gerenciamento na Era da Informação); Plano de ação em GC; Gestão da Informação e o Suporte à Decisão; Tecnologia da Informação e BI; Tecnologias da informação e GC; Implantação de Projetos de TI e GC.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2361","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7022":{"codigo":"EPS7022","nome":"Engenharia do Trabalho","ementa":"- Técnicas de registro e análise do processo. Metodologias de resolução de problemas. Análise do posto do trabalho. Programas de participação do trabalhador na melhoria dos métodos de trabalho. Medida do trabalho: cronometragem, amostragem do trabalho e tempos pré- prédeterminados. \nEscolas de organização do trabalho: escolas clássicas (Taylor e Ford), escola de  relações humanas (enriquecimento de cargos), escolas sócio-técnicas, grupos semi-autônomos.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EPS2372","prerequisito":"EPS2362 ou EPS7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7023":{"codigo":"EPS7023","nome":"Gestão e Avaliação da Qualidade","ementa":"- Qualidade total: conceitos; o planejamento e a gestão; modelos in-line, off-line e on-line; qualidade total em produtos e serviços; estratégias e ferramentas para a implantação da qualidade; avaliação da qualidade. Normalização e certificaão para a qualidade. Gráficos de controle. Inspeção por atributos e por variáveis. Planos de amostragem.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2360 e EPS2381","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7031":{"codigo":"EPS7031","nome":"Monografia I","ementa":"- Planejamento técnico do trabalho junto com o orientador escolhido; Elaboração do cronograma do trabalho; Definição da metodologia e das ferramentas a serem empregadas no trabalho; Busca da literatura.","carga_horaria":18,"fase_sugestao":8,"equivalencia":"EPS2384","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1401":{"codigo":"ZZT1401","nome":"Disciplinas Optativas","ementa":"","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EPS7080":{"codigo":"EPS7080","nome":"Estágio Supervisionado em Engenharia de Produção","ementa":"","carga_horaria":306,"fase_sugestao":9,"equivalencia":"EPS7017 ou EPS7040","prerequisito":"EPS5235 e EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7024":{"codigo":"EPS7024","nome":"Métodos Quantitativos na Gestão da Produção Industrial","ementa":"Introdução: Teoria da Produção; fatores de produção; planejamento e controle da produção; caracterização dos sistemas de produção. 2 Linhas de Produção: Introdução e formulação do problema; procedimentos heurísticos; sequenciamento de linhas mistas (múltiplos produtos). Plano Mestre da Produção (16 horas-aula) - Introdução e objetivos; políticas de encomendas; modelos dinâmicos de determinação de lotes; métodos heurísticos; modelos considerando capacidade limitada. Programação da Produção:  Introdução e definição do problema; flow-shop com uma máquina; flow-shop com duas ou mais máquinas; job shop; regras de despacho. Planejamento de Materiais: Introdução; heurísticas para definição de lotes de material na produção com múltiplos estágios; cálculo das necessidades de material; MRP. Tecnologia de Grupo: Definições; codificação e classificação de peças; algoritmos de clusterização.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7025":{"codigo":"EPS7025","nome":"Projeto de Instalações","ementa":"- Unidades de uma instalação: produtiva e administrativa. Instalações e normas técnicas. Movimentação de materiais: conceito e equipamentos. Arranjo físico: conceito, tipos de arranjo físico, estudo do fluxo, dimensionamento, métodos para elaboração de arranjo físico, layout do almoxarifado, layout de células de produção. Manufatura celular. Segurança Industrial: Introdução e conceitos básicos. Legislação. Riscos ambientais.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"EPS2341 e EPS2380","prerequisito":"(EPS2375 ou EPS5227) e (EPS2372 ou EPS7022)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7026":{"codigo":"EPS7026","nome":"Logística Empresarial","ementa":"- O ambiente de negócios. Conceito e evolução da logística. Cadeia de suprimentos (supply chain). O sistema logístico. Custos logísticos. Nível de serviço ao cliente. A logística de suprimento. A distribuição física de produtos. O subsistema transporte: os modais de transporte; característica e escolha do modal; os processos de coleta, transferência e distribuição. O subsistema armazém: funções e meios de armazenagem; unitização de cargas;sistemas de endereçamento dos produtos. O gerenciamento de estoques: classificação ABC, sistemática de re-suprimento.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS2370","prerequisito":"EPS5235 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7028":{"codigo":"EPS7028","nome":"Planejamento Estratégico","ementa":"- Planejamento estratégico e objetivo. Sistemas de planejamento estratégico. Sistemas de planos. O processo de planejamento estratégico. O subsistema de decisão para planejamento. Subsistema de informação e organização para planejamento. Subsistema de gerência para planejamento. Estratégia de marketing.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"EPS2363 ou EPS7018","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7029":{"codigo":"EPS7029","nome":"Ética e Exercício Profissional","ementa":"- Fundamentos: ética, sociabilidade e grupo profissional. Conduta: liberdade, igualdade, limites da ação, normas éticas e normas jurídicas, conduta individual, direitos e deveres. Obrigações e responsbilidades. Cidadania e organização profissional: cidadania, valorização profissional, organizações produtivas, organizações corporativas, organizações desenvolvedoras  instituições de ensino. Controle do exercício profissional: o estado, o sistema CONFEA\/CREA. Legislação profissional. Codificação ética da profissão.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1200,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7032":{"codigo":"EPS7032","nome":"Monografia II","ementa":"- Aplicação prática dos tópicos estudados no curso de Engenharia de Produção, na forma de projetos técnicos e\/ou científicos ao nível dos atribuídos a um engenheiro.","carga_horaria":18,"fase_sugestao":10,"equivalencia":"","prerequisito":"EPS7031","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT6465":{"codigo":"ZZT6465","nome":"Disciplinas Optativas","ementa":"","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"CAD7232":{"codigo":"CAD7232","nome":"Estratégia Mercadológica","ementa":"Segmentação e posicionamento de Mercado; Sistema de Informação de Marketing; Tipologias e ferramentas de estratégias de marketing; O marketing de relacionamento e de serviço; Posturas estratégicas de marketing: de preço, de praça, de promoção e de produto. Planejamento e plano de marketing; Metodologias para a elaboração do plano de marketing; Tópicos emergentes de marketing: esportivo, social, marketing internacional, E-Marketing, e, universitário.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5013":{"codigo":"EGC5013","nome":"Gestão do Conhecimento nas Organizações","ementa":"Conceitos, histórico (dados, informação e conhecimento). Diretrizes e recomendações básicas e principais abordagens utilizadas na gestão do conhecimento. Criação do conhecimento: formatos e conversões. Facilitadores do trabalho com o formato tácito e explícito do conhecimento. Aplicações da tecnologia da informação na gestão do conhecimento. Aplicação da gestão do conhecimento na organização por meio de seus processos empresariais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5263":{"codigo":"EGC5263","nome":"Finanças Pessoais","ementa":"Planejamento financeiro; processo de planejamento financeiro pessoal, objetivos, necessidades e prioridades do cliente; nível de tolerância ao risco; coleta de dados; relacionamento com o mercado e instituições; desenvolvimento e apresentação de um plano financeiro; implementação e monitoramento. \n  \nPROGRAMA \n1. Comportamento humano: personalidade e resistências a mudanças; perfis psicológicos; fatores restritivos da personalidade; administrando as emoções e os conflitos. \n2. Valores culturais e a personalidade, stress, mudanças e plano de ação. \n3. Operações de Crédito; Conceitos básicos de crédito. \n4. Análise e seleção de seguros e previdência privada; conceitos básicos de seguros; riscos e exposição ao risco; seguros de pessoas; seguro de vida; seguro saúde. \n5. Fundamentos de previdência privada; benefícios; previdência social e previdência privada; órgãos regulatórios; características específicas; perfil do investidor. \n6. Investimento imobiliário. \n7. Investimento e gestão de risco; Intermediação financeira; eficiência dos mercados e instituições financeiras; Alocação patrimonial  (asset allocation). Avaliação dos principais produtos financeiros negociados no mercado; fundos de investimentos; mercado de títulos de renda fixa e de renda variável no Brasil. \n8. Investimento em Tesouro Direto. \n9. Investimento em Renda Variável \u0096 ações. \n10. Comportamento do investidor perante o risco; teoria de carteiras; diversificação; opções; derivativos; riscos com derivativos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5003":{"codigo":"EMC5003","nome":"Tecnologia e Desenvolvimento","ementa":"O que é CTS. Definições de ciência, tecnologia e técnica. Revolução industrial. Desenvolvimento tecnológico e desenvolvimento social. Difusão de novas tecnologias. Sociedade tecnológica e suas implicações. As imagens da tecnologia. As noções de risco e de impacto tecnológico. Modelos de produção e modelos de sociedade. Desafios contemporâneos. Influências da ciência e da tecnologia na organização social. Relações entre ciência, tecnologia e sociedade. Questões éticas e políticas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5010":{"codigo":"EMC5010","nome":"Tópicos Especiais - Projeto Fabricação Térmica e Materiais","ementa":"Projeto, fabricação, construção, especificação de materiais e testes para o desenvolvimento de um veículo monoposto de acordo com o Regulamento Mini Baja - SAE 96, com fins experimentais e comerciais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5139":{"codigo":"EMC5139","nome":"Mecânica dos Sólidos C","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5141":{"codigo":"EMC5141","nome":"Vibrações Mecânicas em Sistemas Lineares","ementa":"Análise vibratória de sistemas com vários graus de liberdade e de sistemas contínuos. Análise Modal experimental. Teorema de Convolução. Princípio do trabalho virtual. Princípio de D`Álembert. Freqüências naturais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5140","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5209":{"codigo":"EMC5209","nome":"Processos de Conformação Contínua","ementa":"Estudo dos processos de conformação a frio, trefilação e extrusão. Projeto de peças e sequência de operação. Forças e trabalho necessários à conformação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5211":{"codigo":"EMC5211","nome":"Administração-Produção-Fundamentos da Manufatura Enxuta","ementa":"Introdução  a  Administração  da  Produção;  Papel  Estratégico  e  Objetivo  da  Produção;  Estratégia  de  Produção;  Projeto  da  Rede  de  Operações  Produtivas;  Arranjo  Físico  e  Fluxo;  Tecnologia  de  Processo;  Projeto  e  Organização  do  Trabalho;  Natureza  do  Planejamento  e  Controle;  Planejamento  e  Controle  de  Capacidade  Produtiva;  Planejamento  e  Controle  de  Estoque;  Planejamento  e  Controle  da  Cadeia  de  Suprimentos;  MRP  e  OPT;  Planejamento  e  Controle  Enxuto;  Planejamento  e  Controle  de  Projetos;  Melhoramento  da  Produção.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5212":{"codigo":"EMC5212","nome":"Textura-Integridade de Superfícies Usinadas","ementa":"Conceito  de  textura  e  integridade  de  superfícies;  as  superfícies  de  corpos  técnicos.  Tipos  de  solicitação  a  que  estão  submetidos  as  superfícies  (  corpos  técnicos  ).  Principais  tipos  de  alterações  que  são  introduzidas  nos  corpos  técnicos  por  ação  dos  processos  de  usinagem  \u0096  efeito  mecânico,  térmico  e  químico.  Defeitos  de  1a  a  5a  ordem.  A  textura  das  superfícies  \u0096  parâmetros  bi  e  tri  \u0096  dimensionais.  Métodos  e  instrumentos  para  caracterizar  a  integridade  das  superfícies.  Os  processos  de  usinagem  e  seus  efeitos  sobre  a  textura  e  a  integridade.  A  influência  da  textura  e  integridade  sobe  as  propriedades  e  desempenho  dos  componentes  usinados.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5213":{"codigo":"EMC5213","nome":"Tecnologia-Conformação-Metais-Modelagem de Polímeros","ementa":"Classificação  e  descrição  sumária  dos  diversos  processos  de  conformação  mecânica.  Tecnologia  e  campos  de  aplicação  dos  processos  de  forjamento,  laminação,  trefilação  e  extrusão.  Processos  de  conformação  de  chapas:  operação  de  corte,  dobramento,  estiramento  e  embutimento.  Introdução  a  estampabilidade  de  chapas.  Ferramentas.  Máquinas  utilizadas.  Fundamentos  do  processamento  de  polímeros.  Moldagem  por  extrusão  Moldagem  por  sopro.  Termoformagem.  Moldagem  por  injeção.    Variantes  do  processo  e  tipos  de  moldes.  Uso  de  sistemas  CAE\/CAD\/CAM.  Confecção  de  moldes  com  prototipagem  rápida  (rapid  tooling).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EGR5214 e EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5217":{"codigo":"EMC5217","nome":"Trabalho em Chapas","ementa":"Operação de trabalho em chapas. Elementos construtivos dos diversos tipos de ferramentas. Ferramentas de corte, de dobramento e curvamento, de embutimento e estiramento,  para trabalhos mistos progressivos. Exemplos de ferramentas para fabricação de peças estampadas. Ferramentas com matrizes e estampos de metal duro. Estampagem fina. Projeto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5218":{"codigo":"EMC5218","nome":"Comando Numérico","ementa":"Conceito de Comando Numérico (NC) e sua importância no contexto da Automatização Industrial, Características dos sistemas NC envolvendo a máquina, o comando e a programação. Vantagens e limitações do NC. Conceito de programação manual incluindo estudo de dasos através de exercícios (didáticas e práticos) de programação. Aspectos modernos da fabricação assistida por computador, relacionando NC com sistemas CAD\/CAM.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5224":{"codigo":"EMC5224","nome":"Metalurgia do Pó e Materiais Conjugados","ementa":"Processos de obtenção de pós. Caracterização e propriedades dos pós. Métodos de compactação e moldagem. Processos de sinterização e homogeneização. Principais ensaios em materiais sinterizados. Peças estruturais-Producão em grandes séries. Materiais porosos. Materiais de alto ponto de fusão. Materiais conjugados. Materiais sinterizados magnéticos. Produção e propriedades de materiais cerâmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5237":{"codigo":"EMC5237","nome":"Processamento de Polímeros","ementa":"Materiais poliméricos: termoplásticos e termofixos. Processamento de polímeros. Moldagem por injeção, compressão, sopro, centrifugação. Conformação à vácuo e por embutimento. Conformação de poliestireno expandido. Matrizesde silicone borrachóide. Normas. Equipamentos para a conformação de plásticos. Projeto de uma matriz.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5239":{"codigo":"EMC5239","nome":"Forjamento em Matriz","ementa":"Fundamentos teóricos. Regras de projeto. Métodos de forjamento. Estudo e dimensionamento das matrizes. Máquinas e fornos de forjamento. Exigências de material e energia para forjamento. Projeto de peças e ferramentas para o forjamento em matriz.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5242":{"codigo":"EMC5242","nome":"Projeto do Experimento para  Produtos e Processos Técnica- Taguchi","ementa":"Princípios e objetivos da experimentação para produtos e processos; Análise de variância; Arranjos ortogonais; Projetos  do experimento; Projeto de parâmetros e tolerâncias; Projeto robusto.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5243":{"codigo":"EMC5243","nome":"Tópicos Especiais em Fabricação","ementa":"Assuntos relacionados com algum tema específico da área de fabricação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5244":{"codigo":"EMC5244","nome":"Dinâmica e Controle de Sistemas","ementa":"Introdução aos sistemas dinâmicos de comando\/controle. Sistemas dinâmicos: classificação, analogias. Modelos gráficos da estrutura de sistemas dinâmicos generalizados. Componentes de sistemas dinâmicos fásicos. Sistemas generalizado. Controle de sistemas dinâmicos: análise e síntese, representação gráfica.  Tópicos especiais: eletrônica aplicada, acionamentos, simulação de sistemas, CNC - CPL, medidas de comportamento dinâmico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5253":{"codigo":"EMC5253","nome":"Introdução ao Processamento de Materiais por Laser","ementa":"Níveis Eletrônicos. Radiação Eletromagnética. Componentes ópticos e óptica geométrica. Laser. Interação da radiação com a matéria. Efeitos Térmicos. Tipos Laser. Laser de CO2 e Nd: YAG. Ação do laser de CO2 em diversos materiais (experimental)","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5405","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5272":{"codigo":"EMC5272","nome":"Processos de Soldagem","ementa":"Classificação dos processos. Fontes de soldagem convencionais e modernas. Propriedades do arco voltáico dos diversos processos e suas implicações nas características das fontes de soldagem. Estudo teórico  experimental da  transferência metálica no processo MIG\/MAG. O processo TIG e MIG\/MAG convencionais e pulsados. Soldagem e corte plasma","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5273":{"codigo":"EMC5273","nome":"Especificação de Procedimentos de Soldagem","ementa":"Fundamenteos de metalurgia da soldagem. Conhecimento básico da correlação entre variáveis de processo, ciclos térmicos de soldagem e a microestrutura e propriedades mecânicas de juntas soldadas. Soldabilidade de aços comuns, aços ligados, aços inoxidáveis e ferros fundidos. Importância da brasagem como técnicas especial de união e revestimento. Noções de processos e  aplicação  da aspersão térmica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5274":{"codigo":"EMC5274","nome":"Tecnologia da Usinagem com Ferramentas de Geometria não Definida","ementa":"Tecnologia dos processos de usinagem que empregam ferramentas de corte com cunhas de geometria não definida. Estudo émpírico dos mecanismos de formção de cavacos, dos mecanismos de  desgaste, apresentação dos materiais de ferramentas, fabricação de abrasivos ligados. Estudo dos processos de retificação, brunimento e lapidação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5275":{"codigo":"EMC5275","nome":"Tecnologia da Usinagem com Ferramentas de Geometria Definida","ementa":"Tecnologia dos processos de usinagem que empregam ferramentas de corte com cunhas cortantes de geometria definida. Estudo  empírico  dos mecanismos de formação  de cavacos, dos mecanismos de desgaste, apresentação dos materiais de ferramentas, estudo da influência do fluido de corte sobre o  processo de usinagem, da usinabilidadde dos materias de peças para os diversos  materiais de ferramentas. Determinação econômica das condições de usinagem.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5277":{"codigo":"EMC5277","nome":"Tecnologia de Processos Especiais de Usinagem","ementa":"Tecnologia dos processos de remoção térmica por descargas elétricas, remoção química, remoção térmo-química, remoção elétro-química, remoção por ultra-som, remoção por raio Laser, remoção por feixe de  elétros e remoção por jato de água. São apresentados os principais parâmetros dos processos, os meios auxiliares e as potenciais aplicações, mostrando exemplos práticos para os processos em questão.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5278":{"codigo":"EMC5278","nome":"Economia e Planejamento da Usinagem","ementa":"Equações de vida de ferramenta. Tempos de usinagem. Custos de usinagem. Sequência de usinagem. Dispositivos especiais de usinagem. Dispositivos de fixação e alimentação. Otimização das condições de usinagem em relação ao tempo, custo e rendimento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5279":{"codigo":"EMC5279","nome":"Projeto de Sistemas de Qualidade","ementa":"Conceituacão. Métodos e técnicas estatísticas básicas. Controle do produto acabado. Técnicas de controle de processos. Métodos Taguchi e QFD. Norma ISO série 9000 e qualidade  total. Sistemas integrados de qualidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5280":{"codigo":"EMC5280","nome":"Planejamento do Processo","ementa":"Definição do planejamento do processo. O planejamento do processo no contextode sistemas de manufatura. Capacidade dos processos. Referências de projeto, fabricação e fixação. Roteamento do  processo. Seleção das operações de usinagem. Sistemas CAPP variante e generativo. Algoritmos determinísticos e sistemas especialistas para o Planejamento do Processo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5310":{"codigo":"EMC5310","nome":"Projeto de Estruturas","ementa":"Processo de projeto estrutural. Modelamento de sistemas físicos. Análise denâmica. Critérios de  projeto, modos de falha e confiabilidade. Estruturas soldadas. Estruturas otimizadas. Estabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5315":{"codigo":"EMC5315","nome":"Tribologia","ementa":"Atrito seco e misto. Desgaste. Lubrificantes. Materiais para superfícies atritantes. Falhas e reparos de superfícies atritantes. Introdução à teoria da lubrificação. Equação de Reynold e de energia. Métodos de solução. Lubrificação hidrostática e hidrodinâmica. Esmagamento da película de lubrificante.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5317":{"codigo":"EMC5317","nome":"Controle de Ruído","ementa":"Introdução à acústica aplicada; grandezas acústicas: pressão, intensidade, potência, impedância. Efeito de ruído no homen; limite permitido para ruído industrial, portaria 3214 do Mtb, critérios para conforto acústico, lei do silêncio. Instrumentação de medição e análise de ruído; microfones, medidores de nível de pressão sonora, dosimetro, filtro calibrador. Materiais e dispositivos para controle de ruído; materiais fibrosos, materiais porosos, medição de absorção acústica dos materiais. Isolamento de ruído; perda de transmissão, lei de massa, efeito de ressonância e coincidência, efeito das frestas e abertura. Controle de ruído por enclausuramento. Protetores auriculares.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5140","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5318":{"codigo":"EMC5318","nome":"Dinâmica Veicular","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5321":{"codigo":"EMC5321","nome":"Sistemas CAE\/CAD\/CAM em Engenharia","ementa":"Desenvolvimento e configuração dos sistemas CAE\/CAD\/CAM. Periféricos. Sistemas gráficos. Modelamento sólido. Definições de superfícies. Transformações de escala, translação, rotação, reflexão e perspectiva. Padrões gráficos. Simulação e validação. Seleção de sistemas. Uso do sistema.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EGR5214 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5323":{"codigo":"EMC5323","nome":"Transportadores Industriais","ementa":"Características  dos  transportadores  industriais.  Critérios  de  seleção,  projeto  e  fabricação  de  transportadores  industriais","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5335","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5325":{"codigo":"EMC5325","nome":"Projeto de Máquinas Ferramenta","ementa":"Método de trabalho de projeto. Análise e e seleção de soluções alternativas. Variadores de velocidade escalonados e contínuos. Árvores principais. Mancais de rolamento e hidrostáticos. Guias de máquinas ferramentais: escorregamento, rolamento e hidrostáticas. Estruturas de máquinas ferramentas. Teoria dos modelos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5335","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5336":{"codigo":"EMC5336","nome":"Controle de Sistemas Dinâmicos","ementa":"Introdução  aos  sistemas  realimentados.  Modelos  Dinâmicos  de  Sistemas  Mecânicos,  Elétricos  e  Eletromecânicos.  Resposta  Dinâmica.  Propriedades  básicas  de  sistemas  realimentados.  O  método  do  lugar  das  raízes.  O  método  da  resposta  em  freqüência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM3104 ou MTM5164","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5341":{"codigo":"EMC5341","nome":"Otimização","ementa":"Programacão linear. O problema geral de programação não linear. Método de programação não linear sem restrições. Processo usando deviradas e de busca direta. Métodos de programação não linear com restrições.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM3104 ou MTM5164","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5343":{"codigo":"EMC5343","nome":"Projeto Estrutural com Materiais Compostos","ementa":"O objetivo é o de habilitar o aluno a projetar e analizar estruturas simples constituídas por laminados planos ou cursos constituídos por lâminas de resina reforçadas por fibras continuas ou descontinuas. Ao fim do  curso o alundevera ser capaz de:* identificar se um dado componente pode ser vantajosamente  construido por material composto e fazer a escolha do tipo mais adequado e do processo de fabricação;* identificar propriedades mecânicas importantes e escolher os ensaios mecânicos necessários para a determinação destes valores;* dadas as propriedades mecânicas de um dado tipo de fibra e matriz, estimar as propriedades da lâmina;* dadas as propriedades elásticas (em forma matricial) e da resistência de cada lâmina, nas sua direções principais, obter as matrizes de rigidez do laminado;* dadas as matrizes de rigidez do laminado s os valores de forças e momentos resultantes, obter deformações e tensões em cada lâmina;* usar valores das tensões principais de uma lâmina e verificar a segurança segundo  um dos critérios de falhas estudados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5351":{"codigo":"EMC5351","nome":"Engenharia de Manutenção e Mantenabilidade","ementa":"Atribuição  da  engenharia  de  manutenção  e  conceitos  de  mantenabilidade.  Gestão  da  manutenção:  manutenção  para  produtividade  total  (TPM),  manutenção  centrada  em  confiabilidade  (MCC),  manutenção  classe  mundial,  outros  modelos.  Ferramentas  para  análise  de  falha:  Árvore  de  falha  (FTA),  análise  dos  modos  de  falha  e  dos  efeitos  (FMEA),  análise  dos  modos  de  falha,  dos  efeitos  e  da  criticidade  (FMECA),  árvore  de  eventos  (ET).  Técnicas  de  análise  na  manutenção,  monitoração  visual,  da  integridade  estrutural,  de  ruído,  de  vibrações,  de  óleos,  de  lubrificantes,  de  partículas  de  desgaste  e  monitoração  dos  instrumentos  e  de  suas  medidas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5140 e EMC5335","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5352":{"codigo":"EMC5352","nome":"Introdução ao Projeto Aeronáutico","ementa":"Definição  do  projeto  aeronáutico.  Conceitos  de  aerodinâmica.  Escoamento  bidimensional,  perfis,  camada  limite,  resistência  aerodinâmica.  Propulsão,  performance  e  estabilidade.  Projeto  estrutural,  materiais,  técnicas  de  fabricação,  ensaios.  Regulamentação  do  vôo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5353":{"codigo":"EMC5353","nome":"Mecânica dos Sólidos Computacional I","ementa":"Revisão  de  Mecânica  de  Sólidos.  Tensor  de  tensões.  Tensor  de  deformação  finita  e  infinitesimal.  Relações  constitutivas.  Material  elástico  linear.  Equação  diferencial  de  equilíbrio.  Princípio  dos    Trabalhos  Virtuais.  Princípio  de  Mínima  Energia  de  Deformação.  Aproximação  por  Elementos  Finitos.  Elementos  Finitos  de  Barras,  Vigas,  de  estados  planos  de  deformação  e  tensão.  Elementos  Sólidos  de  Revolução,  Sólidos  3D  e  Placas.  Recomendações  de  técnicas  de  Modelagem  e  Práticas  com  softwares  comerciais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5354":{"codigo":"EMC5354","nome":"Mecânica dos Sólidos Computacional II","ementa":"Dinâmica  estrutural.  Modelagem  numérica  de  vibrações  estruturais.  Estabilidade  de  estruturas.  Estabilidade  de  estruturas  por  métodos  numéricos.  Tópicos  de  modelagem  numérica  de  plasticidade  estrutural.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5353","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5355":{"codigo":"EMC5355","nome":"Projeto de Redutores e Variadores de Velocidade","ementa":"Revisão  de  engrenagens.  Princípios  de  projeto  de  trens  de  engrenagem.  trens  de  engrenagem  simples  e  epicicloidais.  Variadores  e  redutores  de  velocidades.  Câmbios  automotivos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5356":{"codigo":"EMC5356","nome":"Veículos Automotores I","ementa":"Pneus,  resistências  ao  movimento,  transmissão  de  forças  ao  solo  e  mecânica  da  frenagem,  balanço  de  potências,  estabilidade,  direção,  suspensão  e  princípios  de  carrocerias  aerodinâmicas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5357":{"codigo":"EMC5357","nome":"Construção de Automóveis","ementa":"Pneus,  resistências  ao  movimento,  transmissão  de  forças  ao  solo,  balanço  de  potências,  estabilidade,  direção  e  suspensão.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5409":{"codigo":"EMC5409","nome":"Escoamento de Fluídos em Meios Porosos","ementa":"Caracterização  da  microestrutura  de  materiais  porosos.  Modelos  microestruturais.  Equilíbrio  de  fases  em  meios  porosos.  Equação  de  Young-Laplace.  Escoamentos  monofásicos.  Lei  de  Darcy.  Permeabilidade  intrínseca.  Escoamentos  multifásicos  imiscíveis  em  meios  porosos.  Permeabilidades  relativas.  Métodos  para  a  estimativa  da  permeablidade  intrínseca  de  materiais  porosos.  Permeabilidade  intrínseca  de  rochas  reservatório.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5411":{"codigo":"EMC5411","nome":"Introdução a Microfluidodinâmica","ementa":"Introdução.  Função  distribuição  e  equação  de  Boltzmann.  Métodos  mesoscópicos  em  mecânica  dos  fluidos.  Modelos  de  rede:  modelo  booleano  e  suas  aplicações.  Modelos  de  rede  de  Boltzmann  para  escoamentos  monofásicos,  aplicações  e  condições  de  contorno.  Fluidos  imiscíveis,  molhabilidade  e  capilaridade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5412":{"codigo":"EMC5412","nome":"Transferência-Calor-Mecânica dos Fluidos Computacional","ementa":"Métodos  de  solução  de  problemas  de  Mecânica  dos  Fluidos  e  de  Transferência  de  Calor.  Equação  da  condução.  Discretização  pelo  método  das  diferenças  finitas.  Discretização  pelo  método  dos  volumes  finitos:  método  dos  balanços  e  integração  aproximada  das  equações  diferenciais.  Volumes  adjacentes  às  fronteiras:  aplicação  das  condições  de  contorno.  Técnicas  de  solução  dos  sistemas  lineares.  Problemas  não-lineares.  Aplicações  a  problemas  bi  e  tridimensionais  em  regime  permanente.  Condução  transiente:  formulações  explícita  e  implícita.  Problemas  de  difusão  e  advecção.  Funções  de  interpolação.  Falsa  difusão.  Cálculo  do  campo  de  velocidades.  Métodos  de  solução  simultâneo  e  segregado.  Tratamento  do  acoplamento  pressão-velocidade.  Introdução  ao  EbFVM  -  Método  dos  Volumes  Finitos  baseado  em  Elementos:  geração  da  malha,  definições  de  elementos  e  volumes  de  controle.  Pontos  de  integração  e  funções  de  forma.  Aplicação  de  softwares  comerciais  para  a  solução  de  problemas  reais  de  mecânica  dos  fluidos  e  transferência  de  calor","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5405","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5413":{"codigo":"EMC5413","nome":"Introdução aos Escoamentos Multifásicos","ementa":"Modelagem  Multifásica;  Escoamentos  Gás-Líquido,  Líquido-Líquido  e  Líquido-Líquido-Gás;  Noções  Básicas  de  Mudança  de  Fase  e  Equilíbrio  Líquido-Vapor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5414":{"codigo":"EMC5414","nome":"Geradores de Vapor","ementa":"Aplicação da transferência de calor em projetos de geradores de vapor. Fornalhas e processos de combustão e dimensionamento. Aproveitamento do calor residual dos gases de combustão. Sueperaquecedores, economizadores e pré-aquecedores de ar. Circulação e purificação do vapor.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5428":{"codigo":"EMC5428","nome":"Projeto de Motores a Combustão Interna","ementa":"Sistema de combustão nos motores ICE e ICO, construção do diagrama indicado. Capacidade de ar nos motores de quatro tempos. Lavagem em motores de dois tempos. Análise térmica do conjunto. Balanço térmico de motores. Anteprojeto de motores. Análise dinâmica do mecanismo bielamanivela e do mecanismo de transmissão. Cálculo do volante.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5404 e EMC5473","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5429":{"codigo":"EMC5429","nome":"Maquinas de Fluxo","ementa":"Permitir o entendimento, avaliação, discussão e análise dos fenômenos físicos que regem o  funcionamento das máquinas de fluxo, seus principais modos de instalação, características de  composição, montagem e funcionamento frente a situações diversas e dominar os fundamentos necessários para seu dimensionamento e seleção.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5437":{"codigo":"EMC5437","nome":"Experimentos Básicos em Ciências Térmicas","ementa":"Medição de grandezas termofísicas: temperatura, pressão, fluxo de calor, velocidade e vazão. Estudo e execução de experimentos básicos em termodinâmica, mecânica dos fluídos e transmissão de calor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5443":{"codigo":"EMC5443","nome":"Fundamentos de Sistemas Hidráulicos e Pneumáticos","ementa":"Parte I - Sistemas hidraúlicos: Definição, campo de aplicação e características. Revisão dos conceitos da mecãnica de fluidos (Hidrostática e Hidrodinâmica) aplicados aos sistemas hidráulicos. Fluidos hidráulicos: propriedades, compressibilidade, expansão térmica, tipos de fluidos, classificação. Componentes de sistemas hidráulicos: bombas e atuadores lineares e rotativos, válvulas de controle direcional, de pressão e de vazão, válvulas de controle contínuo (servoválvula e válvula proporcional), válvulas tipo cartucho. Acumuladores, reservatórios, filtros. Acionamentos hidrostáticos e sistemas  hidráulicos básicos. Dimensionamento.Parte II -  Sistemas pneumáticos: Definições: comandos, controles, grandezas analógicas e digitais. Principais elementos pneumáticos: atuadores, elementos de comando de sinal e  de processamento do sinal. Projeto de comandos combinatórios e seqüencias. Aplicações à automação industrial. Dimensionamento de atuadores e elementos de comando. Geração, e distribuição do ar comprimido: compressores, canalizações, reguladores, lubrificadores e filtros.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5407","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5444":{"codigo":"EMC5444","nome":"Projeto de Sistemas Térmicos","ementa":"Metodologia do projeto. Noções de economia aplicada à análise de investimentos. Ajustes de equações. Modelação. Simulação. Otimização. Técnicas de otimização aplicadas ao projeto de sistemas térmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5447":{"codigo":"EMC5447","nome":"Tubulações Industriais","ementa":"Aplicações de tubulações no meio industrial. Critérios  utilizados no dimensionsmento e instalação de tubulações. Tensões admissíveis e noções de flexibilidade. Traçado e detalhamento de tubulações. Informações complementares.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5471","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5452":{"codigo":"EMC5452","nome":"Conservação de e Energia","ementa":"Aspectos gerias em conservação de energia na indústria. Combustíveis industriais. Balanço energético. nacional. Tendência atuais. Auditoria energética. Balanço  térmico de equipamentos. Primeira e segunda lei da temodinâmica. Energia eficiência energética. Copgeração. Recursos renováveis. Fontes alternativas de energia. Biogás, energia solar e energia eólica. Análise econômica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5406 ou EMC5418","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5453":{"codigo":"EMC5453","nome":"Projeto em Refrigeração e Ar Condicionado","ementa":"Componentes básicos do ciclo, análise. Ciclo total de compressão de vapor, análise. Refrigerantes, testes da instalação. Processos Psicométricos. Projetos de câmaras e de instalações de ar condicionado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5472","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5457":{"codigo":"EMC5457","nome":"Ventilação Industrial","ementa":"Captadores. Principais tipos de coletores. Noções sobre transporte pneumático. Cálculo de dutos. Seleção dos equipamentos. Detalhes de projeto. Balanceamento e testes das instalações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5458":{"codigo":"EMC5458","nome":"Transporte de Massa","ementa":"Fundamentos. Equações de transferência de massa. Difusão em regime transiente. Transferência de massa por convecção. Processos de interface. Correlações. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5459":{"codigo":"EMC5459","nome":"Energia Solar","ementa":"Revisão de transferência de calor. Radiação solar. Coletores planos. Dimensionamento de coletores. Desempenho. Fatores de transferência de calor. Armazenamento do calor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5464":{"codigo":"EMC5464","nome":"Tópicos de Sistemas Hidráulicos","ementa":"Revisão de alguns aspectos básicos de sistemas hidráulicos oferecidos na disciplina de Fundamentos de Sistemas Hidráulicos e Pneumáticos -","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5443","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5471":{"codigo":"EMC5471","nome":"Geração e Distribuição de Vapor","ementa":"Unidades geradoras de vapor. Tipos existentes e princípio de funcionamento. Componentes principais.     Rendimento térmico. Aspectos gerais sobre fornalhas. Combustíveis industriais. Teoria da combustão. Aspectos gerais sobre caldeiras. Circulação natural, assistida e forçada. Acessórios. Controle e segurança de caldeiras. Tiragem. Transferência de calor em fornalhas. Convecção e radiação gasosa em fexes tubulares. Balanço energético de caldeiras. Economia de energia.  Tubulações de vapor. Metodologia de projeto de tubulações. Traçado de tubulações em isométrico e em planta baixa. Sistemas de controle de temperatura e de pressão do vapor. Acessórios. Dilatação térmica e flexibilidade de tubulações. Perdas de calor e formação de  condensado. Purgadores de vapor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5472":{"codigo":"EMC5472","nome":"Princípios de Refrigeração e Condicionamento de Ar","ementa":"Aspectos teóricos e ambientais. Sistemas de único estágio, ciclo de refrigeração de Carnot, ciclo de refrigeração padrão, ciclos com subresfriamento e superaquecimento, ciclo com trocador de calor intermediário. Sistemas de múltiplos estágios, componentes adicionais, ciclos com múltiplos componentes. Dispositivos de expansão fixa, válvula de expansão manuais, tubos capilares, tubos curtos. Dispositivos de expansão variável, válvulas de expansão tipo bóia, válvulas de expansão pressostáticas, vávulas de expansão termostáticas. válvulas elétricas. Compressores alternativos, processo de compressão, rendimento volumétrico, métodos de controle de capacidade. Propriedades psicrométricas. Processos psicrométricos. Sistemas psicrométricos de zona única, controle do ar externo, sistema clássico de verão. Sistemas psicrométricos de zonas múltiplas, sistemas com  reaquecimento terminal, sistemas de dutos duplos. Sistemas de volume de ar variável.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5404","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5473":{"codigo":"EMC5473","nome":"Motores a Combustão Interna","ementa":"Motores de combustão interna. Conceitos fundamentais. Ciclos teóricos e indicados. Combustíveis. Sistemas de lubrificação de refrigeração e de distribuição. Desempenho de motores. Combustão nos motores ICO e ICE. Ignição. Sistemas de alimentação. Injeção. Sobrealimentação. Detecção de defeitos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5482":{"codigo":"EMC5482","nome":"Tópicos Especiais Ciências Térmicas II","ementa":"Disciplina  genérica  a  ser  utilizada  para  ministrar  algum  tópico  especial,  de  caráter  temporário,  da  Área  de  Ciências  Térmicas.  A  ementa  será  definida  conforme  o  tópico  abordado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5483":{"codigo":"EMC5483","nome":"Tópicos Especiais Ciências Térmicas III","ementa":"Disciplina  genérica  a  ser  utilizada  para  ministrar  algum  tópico  especial,  de  caráter  temporário,  da  Área  de  Ciências  Térmicas.  A  ementa  será  definida  conforme  o  tópico  abordado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5489":{"codigo":"EMC5489","nome":"Energias Renováveis","ementa":"Introdução. Um pouco da história das tecnologias de energia. Matriz energética\nbrasileira e sua comparação com a mundial. Participação das fontes renováveis na matriz\nenergética brasileira- um caso de sucesso. A geração de energia elétrica e sua distribuição. O\npapel das termelétricas na garantia da oferta de eletricidade no Brasil. Energia de reserva. Como\nflexibilizar a matriz energética brasileira. Futuro dos recursos. Energia eólica. A situação no Brasil\ne no mundo. Tipos de aerogeradores. Os modernos aerogeradores. Rendimento de Betz. Curva\nde potência. Fator de capacidade. O recurso eólico. Como medir o vento. Distribuição de Weibull. Camada limite atmosférica. Conceitos de arodinâmica. Camada limite sobre um perfil de asa.\nEstudo dirigido sobre a utilização do programa WASP. Perspectivas futuras para a energia eólica.\nEnergia solar. Radiação solar. Mapa solarimétrico. Instrumentação para se medir o potencial\nsolarimétrico. Geração fotovoltaica. Heliotérmica. Termossolar para aquecimento de água.\nBiomassa. As fontes de biomassa. Participação da biomassa na matriz energética brasileira.\nProcessos de conversão energética da biomassa. Geração elétrica e biocombustíveis. Bioetanol.\nProcessos de produção do etanol. Usinas de cogeração. Biodiesel. Produção de biodiesel no Brasil\ne mundial. Transesterificação de triglicerídeos. Processos de obtenção do biodiesel,\ntransesterificação do óleo. Participação das matérias-primas utilizadas na produção do biodiesel.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5407","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5602":{"codigo":"EMC5602","nome":"Projeto de Componentes de Mecânica de Precisão I","ementa":"Histórico da mecânica de precisão. Classificação. Juntas da mecânica de precisão. Fixações de componentes ópticos. Guias de precisão. Mancais de precisão.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5138","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5603":{"codigo":"EMC5603","nome":"Projeto de Componente Mecânica Precisão II","ementa":"Travamentos. Limitadores de cursos. Acoplamentos de mecânica de precisão. Armazenamento de energia de molas e massas em instrumentos. Dispositivos de partida. Projeto de mecanismos diversos em mecânica de precisão.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5602","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5605":{"codigo":"EMC5605","nome":"Fabricação Experimental","ementa":"Desenvolvimento de trabalhos laboratoriais com enfase na determinação de condições de usinagem otimizada e da faixa operacional de ferramentas de precisão. O trabalho é desenvolvido em grupos de dois à tres alunos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5606":{"codigo":"EMC5606","nome":"Metrologia Experimental","ementa":"Estatística aplicada ao controle de qualidade. Medição de temperatura. Sistemas de medição. Medição de peças com máquina de medir por coordenadas. Ensaio geométrico. Calibração de um sistema de medição. Medição de grandezas elétricas. Medição de forma e deslocamentos por processo interferométrico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5609":{"codigo":"EMC5609","nome":"Componentes e Projeto de Controles","ementa":"Sistemas dinâmicos em malha de controle. Comparação com sistemas malha aberta. Controladores. Exemplos de aplicação técnica de controladores. Técnicas de projeto de sistemas de controle. Aplicações de controles em automação de acionamentos eletromecânicos. Tópicos especiais de controle.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMC5244","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5614":{"codigo":"EMC5614","nome":"Automação e Controle Experimental","ementa":"Experimentos de laboratório cobrindo conteúdos de Eletrônica, Circuitos Eletrônicos, Dinâmica de Sistemas, Componentes e Projetos de Controle.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS2383":{"codigo":"EPS2383","nome":"Manutenção e Confiabilidade","ementa":"Medidas de confiabilidade e distribuições de tempo de vida. Confiabilidade de componentes em série e paralelo. \nFMEA e FTA. A função manutenção. Manutenção Corretiva. Manutenção Preventiva. Manutenção Preditiva. \nManutenção Centrada em Confiabilidade. Manutenção Produtiva Total.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC5351","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5115":{"codigo":"EPS5115","nome":"Pesquisa Operacional III","ementa":"Familiarização com conceitos e técnicas de teoria de grafos: definições básicas; árvores; problemas de cobertura e partição de conjuntos; problemas de p-medianas e p-centros; coloração de grafos; algoritmos de busca e caminhos mínimos; fluxos em redes; problemas Eulerianos e Hamiltoneanos; emparelhamento. Métodos meta-heurísticos: busca tabu, algoritmo genético, simulated annealing, ant systems. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5141":{"codigo":"EPS5141","nome":"Tópicos Especiais em Pesquisa Operacional","ementa":"Estudo de caso com aplicações de técnicas de Pesquisa Operacional. \n- Artigos diversos publicados em revistas sobre temas relacionados com os estudos de caso \nrealizados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7011":{"codigo":"EPS7011","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando à realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovado pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7012":{"codigo":"EPS7012","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programas de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7013":{"codigo":"EPS7013","nome":"Empreendedorismo","ementa":"- A formação da Personalidade; O processo comportamental; As necessidades do empreendedor; O conhecimento para empreender; O empreendedor e suas habilidades; Os valores do empreendedor; O processo evolutivo das empresas; Modelos de Ciclo de Vida; A personalidade do empreendedor e o ciclo de vida da organização.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7018","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7014":{"codigo":"EPS7014","nome":"Redes de Empresa","ementa":"Globalização e Competitividade, Competitividade Regional, Aglomerações Produtivas, Redes e Consórcios de Empresas, Cadeias de Fornecedores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7015":{"codigo":"EPS7015","nome":"Engenharia de Serviços","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021 e EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7030":{"codigo":"EPS7030","nome":"Finanças","ementa":"Introdução a moderna teoria de investimentos, títulos e mercados. Conceitos estatísticos para gestão de carteiras: retorno médio, desvio padrão, variância, covariância, grau de correlação. Carteira eficiente. Relação entre risco, retor-no esperado e medidas de desempenho. Mercado de capitais e carteira do mercado","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7033":{"codigo":"EPS7033","nome":"Gestão da Inovação","ementa":"Inovação: Definição e Perspectivas; Processo de Inovação: Conceito, Fases e Gerenciamento - Criação, Adoção, Implementação e Disseminação da Inovação; Formulação de Estratégias; Inovação em Serviços, Geração e Avaliação de Idéias.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EGC5018","prerequisito":"EPS7008","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7035":{"codigo":"EPS7035","nome":"Avaliação de Desempenho","ementa":"- Conceito e evolução das técnicas de Avaliação de Desempenho. Métodos Locais - Estatísticos, Mapas, Gráficos, Diagramas e Pareto. Métodos Corporativos - BSC, Baldrige, FPNQ, Nevada,Hronec, McKinsey 7-S, etc. Métodos Construtivistas - SSM, MCDA-C. Estruturação - Contextualização, Elementos Primários de Avaliação, Conceitos, Mapas meio-fim, Árvore de Valor, descritores, níveis âncora. Avaliação - função de valor, independência, taxas, perfil de desempenho. Recomendações - análise de sensibilidade, processo gerador de ações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002 e EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7036":{"codigo":"EPS7036","nome":"Atividades Complementares A","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7037":{"codigo":"EPS7037","nome":"Atividades Complementares B","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7038":{"codigo":"EPS7038","nome":"Sistemas de Produção Enxutos","ementa":"Origens, visão geral do Sistema Toyota de Produção (STP). O Mecanismo da Função Produção: a função processo e a função operação. Princípios da Manufatura Enxuta. Valor e desperdícios no sistema produtivo. Mapeamento de fluxo de valor. Tempo Takt. Inventário. Supermercado. Troca rápida de ferramentas (TRF). Fluxo contínuo. Células. Balanceamento de linha, Trabalho padronizado, TPM, Sistemas Canban, Linha FIFO, Programação de produção,  Controle de qualidade zero defeitos e poka-yokes, gerenciamento visual e kaizen (melhoria contínua). Implantação da Manufatura Enxuta. Desenvolvimento Enxuto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7039":{"codigo":"EPS7039","nome":"Projeto para Manufatura Enxuta","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7043":{"codigo":"EPS7043","nome":"Usabilidade e Projeto de Produtos","ementa":"Introdução ao conceito de Usabilidade. Componentes da usabilidade. As medidas da usabilidade: eficiência e eficácia. As normas de usabilidade. Princípios de projeto centrado no usuário. Especificando as características do usuário.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7044":{"codigo":"EPS7044","nome":"Sistemas de Gestão e Garantia da Qualidade e Meio Ambiente","ementa":"Introdução a Sistemas de Gestão e Garantia da Qualidade e Meio Ambiente; Princípios da Gestão e Garantia da Qualidade; Sistemas de Gestão Baseado em Normas; Auditoria da Qualidade","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7045":{"codigo":"EPS7045","nome":"Princípios do Programa Seis Sigma","ementa":"Bases do programa seis sigma; Projetos seis sigma para a melhoria da qualidade e produtividade; Implementação do programa seis sigma; Outras aplicações do seis sigma","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7050":{"codigo":"EPS7050","nome":"Tópicos Especiais em Gestão da Produção","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7051":{"codigo":"EPS7051","nome":"Tópicos Especiais em Engenharia Econômica","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7052":{"codigo":"EPS7052","nome":"Tópicos Especiais em Engenharia Organizacional","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7053":{"codigo":"EPS7053","nome":"Tópicos Especiais em Engenharia da Qualidade","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7054":{"codigo":"EPS7054","nome":"Tópicos Especiais em Transporte e Logística","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7055":{"codigo":"EPS7055","nome":"Tópicos Especiais em Engenharia do Produto","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7056":{"codigo":"EPS7056","nome":"Jogos de Empresas","ementa":"Fundamentos da Teoria de Decisão - Modelos Básicos da Teoria dos Jogos - Conceituação e Caracterização de Jogos de Empresas - Estruturação de Processos de Decisão - Modelos de Avaliação de Resultados - Aplicação Prática de Jogo de Empresas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS7046","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7062":{"codigo":"EPS7062","nome":"Desenvolvimento de Ideias e Modelagem Prática do Negócio","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7065":{"codigo":"EPS7065","nome":"Análise de Dados e Introdução ao Aprendizado - Máquina","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7066":{"codigo":"EPS7066","nome":"Introduction to Data Science and Machine Learning","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7067":{"codigo":"EPS7067","nome":"Principles of Six Sigma Program","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS0323","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7068":{"codigo":"EPS7068","nome":"Gerenciamento de Projetos II","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7070":{"codigo":"EPS7070","nome":"Tópicos Especiais em Simulação","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7075":{"codigo":"EPS7075","nome":"Economia Circular","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS0423","prerequisito":"EPS7060","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIL5123":{"codigo":"FIL5123","nome":"Metodologia Científica e Filosofia da Ciência","ementa":"Fundamentos da Ciência: Divisão, métodos, leis e teorias. Ciência formal e Ciência empírica. Conhecimento ordinário e científico. Ciência e ideologia.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLV5178":{"codigo":"LLV5178","nome":"Redação Técnica","ementa":"Redação técnica: anotações, esquemas, sínteses, resumo, sinopse, curriculum vitae, descrição técnica, relatório técnico, análise e classificação, resumo crítico, dissertação, monografia, pesquisa; auxiliares lingüísticos: premissas, silogismos, dedução e indução, razão e conseqüência, encadeamento, seqüência, progressão, definição e generalização; estruturas de expressão: fim, causa, lugar, tempo, comparação, correlação, paralelismo, analogia, etc.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LLE7881","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5205":{"codigo":"PSI5205","nome":"Psicologia Organizacional","ementa":"Processos humanos nas organizações. Integração indivíduo X organização. Organização como contexto social. Poder nas organizações e administração de conflitos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"PSI7002","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}}}}