{"codigo":713,"nome":"EaD_UAB ADMINISTRAÇÃO PÚBLICA","sigla_centro":"CSE","sigla_departamento":"CAD","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20092":20092,"20111":20111,"20132":20132,"20171":20171},"situacao":0,"situacao_descricao":"regular","num_vagas_total":150,"num_vagas_primeiro_semestre":0,"num_vagas_segundo_semestre":0,"presencial":false,"curriculos":{"20092":{"id":"480","codigo":20092,"codigo_curso":713,"carga_horaria_ufsc":3000,"carga_horaria_mec":3000,"aulas_semana_min":15,"aulas_semana_esperado":20,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":9,"num_periodos_max":16,"descricao":"Referente a Primeira Edição PNAP\/UAB","ucs":{"CAD9108":{"codigo":"CAD9108","nome":"Teorias da Administração I","ementa":"Introdução à Administração: mercado de trabalho; conceito de administração; o Administrador e seu papel na sociedade atual; formação e legislação profissional. As organizações: conceitos e ambientes competitivos globalizados. Funções administrativas e organizacionais. Composição Organizacional e Processo Administrativo. Novas tendências.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9120":{"codigo":"CAD9120","nome":"Seminário Integrador","ementa":"","carga_horaria":30,"fase_sugestao":1,"equivalencia":"CAD9109","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9124":{"codigo":"CAD9124","nome":"Metodologia de Estudo e de Pesquisa em Administração","ementa":"Métodos de estudo: orientação para a leitura, análise e interpretação de texto. Ciência, metodologia e pesquisa em administração. Tipos de pesquisa. O processo de pesquisa. Instrumentos e técnicas de coleta e análise de dados. Estrutura e organização de trabalhos científicos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9105":{"codigo":"CNM9105","nome":"Introdução à Economia","ementa":"Conceitos e princípios de economia. Evolução do Pensamento Econômico. Noções de Microeconomia: mercado e preços; demanda e oferta; teoria do consumidor; teoria da firma; e estrutura de mercado e eficiência. Noções de Macroeconomia: determinação da renda e do produto nacional; mercado de bens e serviços; e lado monetário. O setor externo, câmbio e estrutura de balança de pagamento. Setor Público: funções econômicas; estrutura tributária e déficit público. Desenvolvimento Econômico, fontes de crescimento, financiamento e modelos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIL9102":{"codigo":"FIL9102","nome":"Filosofia e Ética","ementa":"Conceito de filosofia: filosofia como doutrina e como ato de pensar. Filosofia e outras formas de conhecimento humano. Características gerais dos grandes períodos da história da filosofia. Conceito de ética. Ética como problema teórico e como problema prático. Ética e responsabilidade. Teorias morais. Ética e 'ética profissional'. Ética e política.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9104":{"codigo":"PSI9104","nome":"Psicologia Organizacional","ementa":"Contribuições das teorias psicológicas para o campo do estudo das organizações. Impacto dos diversos modos de organização do trabalho na vida e saúde das pessoas. Temas da psicologia na interface com os estudos organizacionais: motivação, aprendizagem, percepção e grupos. Tensão e conflito. Processo de liderança.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9139":{"codigo":"CAD9139","nome":"Teorias da Administração II","ementa":"Escolas e Evolução do Pensamento Administrativo. Gestão por função e gestão por processos. Sistema administrativo e mudança organizacional.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"CAD9108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9161":{"codigo":"CAD9161","nome":"Seminário Temático I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9100":{"codigo":"CCN9100","nome":"Contabilidade Geral","ementa":"Elementos de Contabilidade: definições. Aplicação. Exigências legais e finalidades de Contabilidade. Organização das unidades econômicas. Fatos contábeis e econômicos. Método das Partidas Dobradas: registros e sistemas contábeis. Demonstrações contábeis. Apuração do resultado do exercício. Balanço patrimonial e demonstração de resultado do exercício. Aspectos fundamentais da teoria contábil. Análise das informações contábeis.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9106":{"codigo":"CNM9106","nome":"Macroeconomia","ementa":"Fundamentos da análise macroeconômica; Problemas macroeconômicos; Modelos macroeconômicos; Contabilidade Nacional; Determinantes da demanda e oferta agregada; Moeda, juros e renda; Economia Aberta; Política econômica; O papel do governo; Inflação.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9104":{"codigo":"MTM9104","nome":"Matemática para Administradores","ementa":"Teoria dos Conjuntos. Matrizes. Sistemas de equações lineares. Funções. Limites. Continuidade. Derivadas. Aplicação do conteúdo estudado em problemas administrativos.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9101":{"codigo":"SPO9101","nome":"Ciência Política","ementa":"Conceitos básicos em ciências políticas ao invés de objeto; Fundamentos teóricos das ciências políticas; Formas de governo e regimes políticos; Representação e sistemas partidários.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9140":{"codigo":"CAD9140","nome":"Teorias da Administração Pública","ementa":"O Estado, o governo e a sociedade. Evolução da administração pública brasileira: patrimonialismo, burocracia e gerencialismo. Contexto contemporâneo da atuação do Estado. Governabilidade, governança e descentralização do poder. Estrutura e função da administração pública. Eficiência, eficácia e efetividade na administração pública. Reformas administrativas e programas de desburocratização: DASP, Decreto-Lei nº 200\/67; Constituição de 1988 e Emenda Constitucional nº 19\/98. Considerações sobre o novo papel do Estado e da administração pública. A reforma de Estado e da administração pública: experiências inglesa, americana e brasileira. Representação e participação: gestão pública e privada. Accountability e Responsiveness: as relações entre demandas, políticas, ação governamental, controles e resultados.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9162":{"codigo":"CAD9162","nome":"Seminário Temático II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9143":{"codigo":"CCN9143","nome":"Contabilidade Pública","ementa":"Elementos de contabilidade geral. Contabilidade Pública: métodos e sistemas de escrituração. Receita e despesa pública. Contabilidade orçamentária, financeira e patrimonial. Demonstrações contábeis: balanços, variações patrimoniais, consolidação e prestação de contas. Lançamentos contábeis. Planificação contábil. Contabilização em empresas públicas. Campo de aplicação da contabilidade pública. Patrimônio público. Exercício financeiro. Aspectos fundamentais. Relatórios RREO e RGF.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"CAD9143","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9108":{"codigo":"CNM9108","nome":"Economia Brasileira","ementa":"Evolução histórica da economia brasileira no período republicano. A evolução recente da economia no Brasil: agricultura e indústria; comércio exterior; inflação; relações Inter setoriais e regionais. Temas emergentes na economia brasileira e a atualidade: o problema da distribuição de renda e indicadores socioeconômicos; desemprego e informalidade; globalização, inserção periférica e acordos internacionais","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9954":{"codigo":"DIR9954","nome":"Instituições de Direito Público e Privado","ementa":"Noções de Direito; Norma jurídica e outras normas sociais. Direito público e direito privado. Subdivisões. Fontes do direito. Conceito de Estado, sua origem e formação; Elementos de Estado: Estado de Direito, Estado Social de Direito e Estado Democrático de Direito; Poder e funções do Estado; Formas de Estado, formas de Governo e sistemas de Governo. Conceito de Constituição; classificação e poder constituinte; Supremacia da Constituição e controle de constitucionalidade; As Constituições brasileiras. A constituição vigente. Organização do Estado Brasileiro: Forma de Estado, forma de Governo e sistema de Governo; Poder legislativo: função, organização, garantias; Poder Judiciário: funções, organização, garantias. Poder Executivo: funções, organização, atribuições e responsabilidade. Conceito de Administração pública; Princípios; Organização administrativa. Administração Direta e indireta; Servidores públicos. Direitos e Garantias Individuais; Direitos fundamentais do Homem.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9103":{"codigo":"SPO9103","nome":"Sociologia Organizacional","ementa":"A Sociologia e seu objeto de estudo. Conceitos básicos: relação social, estrutura e paradigmas de relacionamento, socialização e formação da cultura. Interação social: o indivíduo e a sociedade. Papel social, grupos e organização social. Organização formal e organização informal. Atitudes, valores e comportamento nas organizações. Cultura organizacional: tipologia, características e planejamento de mudanças.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9144":{"codigo":"CAD9144","nome":"Teorias das Finanças Públicas","ementa":"Finanças públicas: teorias, conceitos, evolução. Finanças públicas no Brasil. Instituições financeiras brasileiras. Política fiscal, atividade econômica e finanças públicas: tributação e gasto público. Necessidade de financiamento do setor público, déficits e dívida pública. Renúncia de receita. Política fiscal e distribuição de renda. O problema previdenciário no Brasil. Reforma tributária e federalismo fiscal.","carga_horaria":0,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9146":{"codigo":"CAD9146","nome":"Sistemas de Informação e Comunicação no Setor Público","ementa":"Fundamentos de sistemas, processos e informações; Tecnologia e sistemas de informações; aplicações no setor público e privado; Gestão de tecnologia da informação no setor público; Planejamento Estratégico e Tecnologia da Informação; Governo Eletrônico; Governança Tecnológica; Padrões de Sistemas de Informação e Políticas Públicas.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9163":{"codigo":"CAD9163","nome":"Seminário Temático III - GESTÃO EM SAÚDE","ementa":"","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9214":{"codigo":"CAD9214","nome":"Organização, Processo e Tomada de Decisão","ementa":"Organização e reorganização. Organogramas. Aproveitamento racional do espaço físico. Processos: fluxogramas e otimização. Condicionantes e componentes da estrutura organizacional: autoridade, responsabilidade e comunicação; estratégia, tecnologia, ambiente, pessoas e objetivos. Departamentalização. Centralização e Descentralização. Métodos e instrumentos de modernização de estruturas, sistemas e processos das organizações. Estruturas alternativas; tendências atuais. A função decisão no contexto da Administração. Administração como um processo de tomada de decisões empresarial: análise estratégica, alocação e mobilização dos recursos, especificações e desempenho. Tipos de decisão. Métodos e processos de tomada de decisão. Instrumentos para a tomada de decisão.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9955":{"codigo":"DIR9955","nome":"Direito Administrativo","ementa":"Conceito. Campo de Aplicação. Objeto do Direito. Sujeito direito. Pessoas jurídicas e administrativas. Fontes do Direito Administrativo. Administração Pública. Autarquias. Sociedades de economia mista. Empresas públicas. Fundações. Função pública e bens públicos. Relação de Direito Administrativo. Regime Jurídico- Administrativo. Princípios Constitucionais do Direito Administrativo. Poderes Administrativos. Organização Administrativa. Órgãos Administrativos. Atos Administrativos. Noções Gerais sobre Procedimento Administrativo. Licitação. Contratos Administrativos. Domínio público. Intervenção na propriedade. Responsabilidade civil da administração pública. Crimes contra a administração pública.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE9103":{"codigo":"INE9103","nome":"Estatística","ementa":"Fases do método estatístico. Dados brutos e derivados. Medidas de tendência central, separatrizes, medidas de dispersão. Probabilidade. Distribuições discretas e contínuas. Amostras e populações. Testes de hipóteses.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9147":{"codigo":"CAD9147","nome":"Planejamento e Programação na Administração Pública","ementa":"Planejamento e políticas públicas. Teorias e modelos de planejamento governamental. Enfoque sistêmico e estratégico de planejamento. Métodos, técnicas\/características e etapas. Avaliação e acompanhamento como parte do processo de planejamento. Construção de indicadores de monitoramento e avaliação. Evolução do planejamento governamental no Brasil. Os Planos Nacionais de Desenvolvimento. Planejamento governamental no Brasil contemporâneo: concepção, estrutura e sistema do PPA.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9148":{"codigo":"CAD9148","nome":"Gestão de Pessoas no Setor Público","ementa":"Evolução da gestão de pessoas. Conceitos da gestão de pessoas. Processos de gestão de pessoas. Planejamento estratégico de pessoas. Gestão de equipes, gestão por competências e gestão do conhecimento. Gestão de pessoas no setor público: teoria e prática. Admissão e dispensa de servidores públicos. Cargos e salários. Programas de incentivos e benefícios. Prêmios e recompensas. Desenvolvimento de pessoas. Políticas de desenvolvimento de servidores. Carreiras: estruturação de cargos e funções no setor público. Avaliação de desempenho individual. Sistemas de informações gerenciais na gestão de pessoas. Higiene e segurança no trabalho. Qualidade de vida no trabalho. Gestão de pessoas no contexto da organização moderna. Tendências da área de gestão, de pessoas no serviço público.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9149":{"codigo":"CAD9149","nome":"Gestão de Operações e Logística I","ementa":"Evolução e conceitos de logística e de administração de materiais. Previsão da demanda interna de bens e serviços. Estudo do gerenciamento da administração de recursos materiais, como função básica de administração. Gestão de transportes. Gestão de estoques e materiais. Gestão de compras. Gestão de fornecedores (contratos). Administração de Patrimônio.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9150":{"codigo":"CAD9150","nome":"Matemática Financeira e Análise de Investimentos","ementa":"Capitalização simples e composta. Descontos simples e compostos. Equivalência de fluxos de caixa em regimes de capitalização simples e composta. Anuidades ou rendas. Sistemas de amortização. Inflação e correção monetária. Fluxos de caixa e análise de investimentos. Critérios econômicos de avaliação de projetos: taxa interna de retorno, valor presente líquido e índice de lucratividade.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9171":{"codigo":"CAD9171","nome":"Seminário Temático I na Linha de Formação Específica (LFE) I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9172":{"codigo":"CAD9172","nome":"Seminário Temático I na Linha de Formação Específica (LFE) II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9173":{"codigo":"CAD9173","nome":"Seminário Temático I na Linha de Formação Específica (LFE)IIIGESTÃO EM SAÚDE","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9186":{"codigo":"CAD9186","nome":"Trabalho de Conclusão I","ementa":"","carga_horaria":75,"fase_sugestao":5,"equivalencia":"CAD9181","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9104":{"codigo":"DIR9104","nome":"Direito Empresarial","ementa":"Envolve conceitos sobre Direito Empresarial e sua evolução. Pessoas Físicas e jurídicas. Atos e fatos jurídicos. Empresário. Empresa. Estabelecimento Empresarial. Obrigações profissionais do Empresário. Sociedades Empresariais, sua constituição, modificação, extinção e liquidação. Contratos em geral. Títulos de crédito. Noções de falência e Recuperação Judicial.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9105":{"codigo":"DIR9105","nome":"Direito e Legislação Tributária","ementa":"Conceitos de Direito Tributário, tais como conhecimento sobre ramos do Direito Público, com ênfase no ramo do Direito Tributário. Estudo das normas constitucionais relativas ao sistema tributário nacional e das normas gerais de Direito Tributário. Estudo e discussão da legislação tributária federal, estadual e municipal e tributos em espécie.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9153":{"codigo":"CAD9153","nome":"Orçamento Público","ementa":"Fundamentos e princípios orçamentários. Aspectos constitucionais do orçamento. Processo orçamentário como instrumento de planejamento: relação entre Plano Plurianual (PPA), Lei de Diretrizes Orçamentárias (LDO) e Lei Orçamentária Anual (LOA). O ciclo orçamentário. Elaboração do orçamento: receita e despesa. Execução orçamentária e financeira: etapas da receita e da despesa. Créditos adicionais. Gestão democrática de alocação de recursos: orçamento participativo.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9154":{"codigo":"CAD9154","nome":"Administração Estratégica","ementa":"Evolução do pensamento estratégico. Administração Estratégica e Planejamento Estratégico. Vantagens e desvantagens do Processo de Planejamento Estratégico. Etapas do processo de Planejamento Estratégico na Administração Pública: implantação, controle e avaliação do processo de Planejamento Estratégico.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9155":{"codigo":"CAD9155","nome":"Gestão de Operações e Logística II","ementa":"Introdução a operações e à natureza do serviço. Operações de serviço. Sistemas e processos de serviço. Projeto e organização do posto de trabalho. Arranjo físico e fluxo. Localização de instalações. Gestão de filas. Gestão da capacidade e da demanda. Relacionamento com clientes e fornecedores. Melhoria operacional: produtividade, qualidade, garantia e recuperação de falhas. Planejamento e gestão da rede de operações e serviço.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9156":{"codigo":"CAD9156","nome":"Elaboração e Gestão de Projetos","ementa":"Planejamento e projeto: conceituação, Estruturas organizacionais voltadas para projeto. Habilidades de gerente de projetos. Equipes de projeto. Ciclos e fases do projeto: fluxo do processo. Definição do escopo do projeto. Identificação de restrições. Planejamento de recursos e estimativas. Definição dos controles de planejamento do projeto. Criação do plano de projeto. Avaliação e controle do desempenho do projeto. Planejamento, programa e controle de projetos e produtos especiais, produzidos sob encomenda. Métodos e técnicas utilizados na avaliação econômica e social de projetos. Avaliação do risco e do retorno dos projetos. Análise de custos futuros gerados pelo projeto. Aceleração de projetos. Organização geral. Aplicação de técnicas de Gantt, CPM, PERT\/TEMPO e PERT\/CUSTO. Uso de software para gerenciamento de projetos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9174":{"codigo":"CAD9174","nome":"Seminário Temático II na Linha de Formação Específica (LFE) I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9175":{"codigo":"CAD9175","nome":"Seminário Temático II na Linha de Formação Específica (LFE) II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9176":{"codigo":"CAD9176","nome":"Seminário Temático II na Linha de Formação Específica (LFE) III- Gest em Saúde","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9187":{"codigo":"CAD9187","nome":"Trabalho de Conclusão II","ementa":"","carga_horaria":75,"fase_sugestao":6,"equivalencia":"CAD9182","prerequisito":"CAD9181 ou CAD9186","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9157":{"codigo":"DIR9157","nome":"Licitação, Contratos e Convênios","ementa":"Licitação: aspectos gerais, princípios constitucionais, dispensa e inexigibilidade, modalidades, pregão eletrônico e presencial, fases, revogação e invalidação, controle. Contratos: formalização, direitos e deveres, execução, alteração, inexecução, extinção, espécies, controle. Convênios: aspectos gerais, participantes, objeto, formalização, controle.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9158":{"codigo":"CAD9158","nome":"Negociação e Arbitragem","ementa":"Mediação e arbitragem: o marco regulatório brasileiro. Negociação: conceitos e princípios; o conflito; o negociador; o objeto; o lugar; os modelos e estilos; desenvolvimento da negociação; feedback. Arbitragem: retrospectiva histórica e o momento atual; conceito; a convenção e os tipos de arbitragem; o árbitro; a sentença arbitral.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9159":{"codigo":"CAD9159","nome":"Tecnologia e Inovação","ementa":"História da tecnologia. Conceitos fundamentais: ciência, tecnologia e inovação. Indicadores de Ciência, Tecnologia e Inovação. Principais condicionantes do processo de inovação tecnológica. Gestão da inovação tecnológica. Avaliação de projetos de P&D. Financiamento para a inovação no Brasil. Tecnologias convencionais e tecnologias sociais. Novas tecnologias e suas implicações sociais. As TICs em foco.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9160":{"codigo":"CAD9160","nome":"Gestão de Redes de Cooperação na Esfera Pública","ementa":"Conceito, gênese e tipos de redes, modelos de gestão e estruturas de redes públicas. Redes federativas e redes públicas de cooperação, redes comunitárias. Complementaridade e Supletividade nas redes híbridas.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9167":{"codigo":"CAD9167","nome":"Gestão de Regulação","ementa":"Direito e Economia da Regulação e da Concorrência; O Poder Regulatório do Estado e Concessão de Serviços Públicos; Políticas e Estrutura da Regulação no Brasil; Defesa do Consumidor; Defesa da Concorrência. O marco regulatório brasileiro: legislação, órgãos e entidades (nacionais, estaduais e municipais).","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9177":{"codigo":"CAD9177","nome":"Seminário Temático III na Linha de Formação Específica (LFE) I- Gestão Pública","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9178":{"codigo":"CAD9178","nome":"Seminário Temático III na Linha de Formação Específica (LFE) II - Gestão Pública Municipal","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9179":{"codigo":"CAD9179","nome":"Seminário Temático III na Linha de Formação Específica (LFE) III-Gestão em Saúde","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9188":{"codigo":"CAD9188","nome":"Trabalho de Conclusão III","ementa":"","carga_horaria":75,"fase_sugestao":7,"equivalencia":"CAD9183","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9145":{"codigo":"CCN9145","nome":"Auditoria e Controladoria","ementa":"Probidade administrativa. Princípios e sistema de controle na administração pública. Controle social e transparência no Brasil. Fiscalização orçamentária, financeira, contábil e patrimonial do Estado. Organização e funcionamento do controle externo e interno na administração pública. Fluxo da gestão governamental (PPA, LDO, LOA). Conceitos de Auditoria Governamental. Tipos de Auditoria Governamental. Controles da Administração Pública. Elaboração de Relatório de Auditoria.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9164":{"codigo":"CAD9164","nome":"Gestão Ambiental e Sustentabilidade","ementa":"A evolução da gestão ambiental; as políticas de comando e controle; conceitos e propostas para um desenvolvimento sustentável; a evolução da legislação ambiental; o novo papel dos Municípios, dos Estados e da União na gestão ambiental pública; o setor público como cliente e seu poder de compra; a Agenda Ambiental na Administração Pública (A3P); o desenvolvimento regional sustentável; as políticas do governo brasileiro frente aos acordos internacionais de proteção ambiental.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9166":{"codigo":"CAD9166","nome":"Gestão da Qualidade no Setor Público","ementa":"Considerações sobre o setor público. Qualidade: conceitos e princípios. Planejamento e controle da qualidade. Ferramentas. Melhoria em operações. Qualidade em serviços: projeto, desenho de processos, programação de serviços e controle de qualidade.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9168":{"codigo":"CAD9168","nome":"Políticas Públicas e Sociedade","ementa":"Introdução ao estudo das políticas públicas. Conceitos fundamentais: políticas públicas, público e privado, público e estatal, público e governamental. Estado, mercado e esfera pública. O Estado de Bem-estar Social, a formação da cidadania moderna e o desenvolvimento da democracia. Histórico do Estado de Bem-estar Social. Tipologias de Estados de Bem-estar Social. A formação da Agenda Pública. A questão da decisão e da não decisão. Modelos de decisão e o papel dos atores políticos: parlamentos, partidos políticos, grupos de interesse, estruturas institucionais e mídia. Implementação e avaliação das políticas públicas. Tendências das políticas públicas no início do Século XXI. Liberalismo, socialdemocracia e políticas públicas. O efeito da globalização para as políticas públicas. A participação da sociedade na decisão e acompanhamento da execução das políticas públicas: a gestão democrática. Relações Étnicos-Raciais e ensino de História e Cultura Afro-brasileira e Africana.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9189":{"codigo":"CAD9189","nome":"Trabalho de Conclusão IV","ementa":"","carga_horaria":75,"fase_sugestao":8,"equivalencia":"CAD9184","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9191":{"codigo":"CAD9191","nome":"Seminário Temático IV na Linha de Formação Específica (LFE)I- Gestão Pública","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9192":{"codigo":"CAD9192","nome":"Seminário Temático IV na Linha de Formação Específica (LFE) II - Gestão Pública Municipal","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9193":{"codigo":"CAD9193","nome":"Seminário Temático IV na Linha de Formação Especifica (LFE) III-Gestão em Saúde","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9165":{"codigo":"CNM9165","nome":"Relações Internacionais","ementa":"Analisar as relações internacionais no período contemporâneo e verificar como se encontra estruturado o sistema internacional. Temas como a globalização, a regionalização, a interdependência e aqueles que têm ocupado a agenda dos governos nos anos de 1990, tais como as organizações internacionais e não governamentais, o meio ambiente, os direitos humanos, os conflitos étnicos e religiosos, os nacionalismos e o terrorismo.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9185":{"codigo":"CAD9185","nome":"Atividades Complementares II","ementa":"","carga_horaria":120,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9110":{"codigo":"CAD9110","nome":"Informática Básica","ementa":"Estrutura de computadores. Softwares. Aplicativos: processadores de textos, planilha eletrônica e apresentação de slides. Sistemas Computacionais: características, noções de modelagem de dados.  Bancos de dados. Internet e páginas web. Correio Eletrônico: uso corporativo, atividades em grupo.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD9194":{"codigo":"CAD9194","nome":"Redação Oficial na Administração Pública","ementa":"caracteristicas do tezxto administratuivonemna linguagem oficial aplicadas na produçção de documentos e correspondencias oficiais e empresariais.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"LLV9113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"MTM9108":{"codigo":"MTM9108","nome":"Matemática Básica - Nivelamento","ementa":"Conjuntos e Relações. Potenciação, Radiação, Logaritmo e Exponencial. Produtos Notáveis. Razão, Proporção e Porcentagem. Frações. Equações de 1º e 2º graus. Inequações de 1º grau. Aplicações.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20111":{"id":"499","codigo":20111,"codigo_curso":713,"carga_horaria_ufsc":3000,"carga_horaria_mec":3000,"aulas_semana_min":15,"aulas_semana_esperado":20,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":9,"num_periodos_max":16,"descricao":"Referente a Segunda Edição PNAP\/UAB","ucs":{"CAD9108":{"codigo":"CAD9108","nome":"Teorias da Administração I","ementa":"Introdução à Administração: mercado de trabalho; conceito de administração; o Administrador e seu papel na sociedade atual; formação e legislação profissional. As organizações: conceitos e ambientes competitivos globalizados. Funções administrativas e organizacionais. Composição Organizacional e Processo Administrativo. Novas tendências.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9120":{"codigo":"CAD9120","nome":"Seminário Integrador","ementa":"","carga_horaria":30,"fase_sugestao":1,"equivalencia":"CAD9109","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9124":{"codigo":"CAD9124","nome":"Metodologia de Estudo e de Pesquisa em Administração","ementa":"Métodos de estudo: orientação para a leitura, análise e interpretação de texto. Ciência, metodologia e pesquisa em administração. Tipos de pesquisa. O processo de pesquisa. Instrumentos e técnicas de coleta e análise de dados. Estrutura e organização de trabalhos científicos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9105":{"codigo":"CNM9105","nome":"Introdução à Economia","ementa":"Conceitos e princípios de economia. Evolução do Pensamento Econômico. Noções de Microeconomia: mercado e preços; demanda e oferta; teoria do consumidor; teoria da firma; e estrutura de mercado e eficiência. Noções de Macroeconomia: determinação da renda e do produto nacional; mercado de bens e serviços; e lado monetário. O setor externo, câmbio e estrutura de balança de pagamento. Setor Público: funções econômicas; estrutura tributária e déficit público. Desenvolvimento Econômico, fontes de crescimento, financiamento e modelos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIL9102":{"codigo":"FIL9102","nome":"Filosofia e Ética","ementa":"Conceito de filosofia: filosofia como doutrina e como ato de pensar. Filosofia e outras formas de conhecimento humano. Características gerais dos grandes períodos da história da filosofia. Conceito de ética. Ética como problema teórico e como problema prático. Ética e responsabilidade. Teorias morais. Ética e 'ética profissional'. Ética e política.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9104":{"codigo":"PSI9104","nome":"Psicologia Organizacional","ementa":"Contribuições das teorias psicológicas para o campo do estudo das organizações. Impacto dos diversos modos de organização do trabalho na vida e saúde das pessoas. Temas da psicologia na interface com os estudos organizacionais: motivação, aprendizagem, percepção e grupos. Tensão e conflito. Processo de liderança.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9139":{"codigo":"CAD9139","nome":"Teorias da Administração II","ementa":"Escolas e Evolução do Pensamento Administrativo. Gestão por função e gestão por processos. Sistema administrativo e mudança organizacional.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"CAD9108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9161":{"codigo":"CAD9161","nome":"Seminário Temático I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9100":{"codigo":"CCN9100","nome":"Contabilidade Geral","ementa":"Elementos de Contabilidade: definições. Aplicação. Exigências legais e finalidades de Contabilidade. Organização das unidades econômicas. Fatos contábeis e econômicos. Método das Partidas Dobradas: registros e sistemas contábeis. Demonstrações contábeis. Apuração do resultado do exercício. Balanço patrimonial e demonstração de resultado do exercício. Aspectos fundamentais da teoria contábil. Análise das informações contábeis.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9106":{"codigo":"CNM9106","nome":"Macroeconomia","ementa":"Fundamentos da análise macroeconômica; Problemas macroeconômicos; Modelos macroeconômicos; Contabilidade Nacional; Determinantes da demanda e oferta agregada; Moeda, juros e renda; Economia Aberta; Política econômica; O papel do governo; Inflação.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9104":{"codigo":"MTM9104","nome":"Matemática para Administradores","ementa":"Teoria dos Conjuntos. Matrizes. Sistemas de equações lineares. Funções. Limites. Continuidade. Derivadas. Aplicação do conteúdo estudado em problemas administrativos.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9101":{"codigo":"SPO9101","nome":"Ciência Política","ementa":"Conceitos básicos em ciências políticas ao invés de objeto; Fundamentos teóricos das ciências políticas; Formas de governo e regimes políticos; Representação e sistemas partidários.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9140":{"codigo":"CAD9140","nome":"Teorias da Administração Pública","ementa":"O Estado, o governo e a sociedade. Evolução da administração pública brasileira: patrimonialismo, burocracia e gerencialismo. Contexto contemporâneo da atuação do Estado. Governabilidade, governança e descentralização do poder. Estrutura e função da administração pública. Eficiência, eficácia e efetividade na administração pública. Reformas administrativas e programas de desburocratização: DASP, Decreto-Lei nº 200\/67; Constituição de 1988 e Emenda Constitucional nº 19\/98. Considerações sobre o novo papel do Estado e da administração pública. A reforma de Estado e da administração pública: experiências inglesa, americana e brasileira. Representação e participação: gestão pública e privada. Accountability e Responsiveness: as relações entre demandas, políticas, ação governamental, controles e resultados.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9162":{"codigo":"CAD9162","nome":"Seminário Temático II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9143":{"codigo":"CCN9143","nome":"Contabilidade Pública","ementa":"Elementos de contabilidade geral. Contabilidade Pública: métodos e sistemas de escrituração. Receita e despesa pública. Contabilidade orçamentária, financeira e patrimonial. Demonstrações contábeis: balanços, variações patrimoniais, consolidação e prestação de contas. Lançamentos contábeis. Planificação contábil. Contabilização em empresas públicas. Campo de aplicação da contabilidade pública. Patrimônio público. Exercício financeiro. Aspectos fundamentais. Relatórios RREO e RGF.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"CAD9143","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9108":{"codigo":"CNM9108","nome":"Economia Brasileira","ementa":"Evolução histórica da economia brasileira no período republicano. A evolução recente da economia no Brasil: agricultura e indústria; comércio exterior; inflação; relações Inter setoriais e regionais. Temas emergentes na economia brasileira e a atualidade: o problema da distribuição de renda e indicadores socioeconômicos; desemprego e informalidade; globalização, inserção periférica e acordos internacionais","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9954":{"codigo":"DIR9954","nome":"Instituições de Direito Público e Privado","ementa":"Noções de Direito; Norma jurídica e outras normas sociais. Direito público e direito privado. Subdivisões. Fontes do direito. Conceito de Estado, sua origem e formação; Elementos de Estado: Estado de Direito, Estado Social de Direito e Estado Democrático de Direito; Poder e funções do Estado; Formas de Estado, formas de Governo e sistemas de Governo. Conceito de Constituição; classificação e poder constituinte; Supremacia da Constituição e controle de constitucionalidade; As Constituições brasileiras. A constituição vigente. Organização do Estado Brasileiro: Forma de Estado, forma de Governo e sistema de Governo; Poder legislativo: função, organização, garantias; Poder Judiciário: funções, organização, garantias. Poder Executivo: funções, organização, atribuições e responsabilidade. Conceito de Administração pública; Princípios; Organização administrativa. Administração Direta e indireta; Servidores públicos. Direitos e Garantias Individuais; Direitos fundamentais do Homem.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9103":{"codigo":"SPO9103","nome":"Sociologia Organizacional","ementa":"A Sociologia e seu objeto de estudo. Conceitos básicos: relação social, estrutura e paradigmas de relacionamento, socialização e formação da cultura. Interação social: o indivíduo e a sociedade. Papel social, grupos e organização social. Organização formal e organização informal. Atitudes, valores e comportamento nas organizações. Cultura organizacional: tipologia, características e planejamento de mudanças.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9144":{"codigo":"CAD9144","nome":"Teorias das Finanças Públicas","ementa":"Finanças públicas: teorias, conceitos, evolução. Finanças públicas no Brasil. Instituições financeiras brasileiras. Política fiscal, atividade econômica e finanças públicas: tributação e gasto público. Necessidade de financiamento do setor público, déficits e dívida pública. Renúncia de receita. Política fiscal e distribuição de renda. O problema previdenciário no Brasil. Reforma tributária e federalismo fiscal.","carga_horaria":0,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9146":{"codigo":"CAD9146","nome":"Sistemas de Informação e Comunicação no Setor Público","ementa":"Fundamentos de sistemas, processos e informações; Tecnologia e sistemas de informações; aplicações no setor público e privado; Gestão de tecnologia da informação no setor público; Planejamento Estratégico e Tecnologia da Informação; Governo Eletrônico; Governança Tecnológica; Padrões de Sistemas de Informação e Políticas Públicas.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9163":{"codigo":"CAD9163","nome":"Seminário Temático III - GESTÃO EM SAÚDE","ementa":"","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9214":{"codigo":"CAD9214","nome":"Organização, Processo e Tomada de Decisão","ementa":"Organização e reorganização. Organogramas. Aproveitamento racional do espaço físico. Processos: fluxogramas e otimização. Condicionantes e componentes da estrutura organizacional: autoridade, responsabilidade e comunicação; estratégia, tecnologia, ambiente, pessoas e objetivos. Departamentalização. Centralização e Descentralização. Métodos e instrumentos de modernização de estruturas, sistemas e processos das organizações. Estruturas alternativas; tendências atuais. A função decisão no contexto da Administração. Administração como um processo de tomada de decisões empresarial: análise estratégica, alocação e mobilização dos recursos, especificações e desempenho. Tipos de decisão. Métodos e processos de tomada de decisão. Instrumentos para a tomada de decisão.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9955":{"codigo":"DIR9955","nome":"Direito Administrativo","ementa":"Conceito. Campo de Aplicação. Objeto do Direito. Sujeito direito. Pessoas jurídicas e administrativas. Fontes do Direito Administrativo. Administração Pública. Autarquias. Sociedades de economia mista. Empresas públicas. Fundações. Função pública e bens públicos. Relação de Direito Administrativo. Regime Jurídico- Administrativo. Princípios Constitucionais do Direito Administrativo. Poderes Administrativos. Organização Administrativa. Órgãos Administrativos. Atos Administrativos. Noções Gerais sobre Procedimento Administrativo. Licitação. Contratos Administrativos. Domínio público. Intervenção na propriedade. Responsabilidade civil da administração pública. Crimes contra a administração pública.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE9103":{"codigo":"INE9103","nome":"Estatística","ementa":"Fases do método estatístico. Dados brutos e derivados. Medidas de tendência central, separatrizes, medidas de dispersão. Probabilidade. Distribuições discretas e contínuas. Amostras e populações. Testes de hipóteses.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9001":{"codigo":"CAD9001","nome":"Seminário Temático I na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"CAD9171 ou CAD9172 ou CAD9173","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9147":{"codigo":"CAD9147","nome":"Planejamento e Programação na Administração Pública","ementa":"Planejamento e políticas públicas. Teorias e modelos de planejamento governamental. Enfoque sistêmico e estratégico de planejamento. Métodos, técnicas\/características e etapas. Avaliação e acompanhamento como parte do processo de planejamento. Construção de indicadores de monitoramento e avaliação. Evolução do planejamento governamental no Brasil. Os Planos Nacionais de Desenvolvimento. Planejamento governamental no Brasil contemporâneo: concepção, estrutura e sistema do PPA.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9148":{"codigo":"CAD9148","nome":"Gestão de Pessoas no Setor Público","ementa":"Evolução da gestão de pessoas. Conceitos da gestão de pessoas. Processos de gestão de pessoas. Planejamento estratégico de pessoas. Gestão de equipes, gestão por competências e gestão do conhecimento. Gestão de pessoas no setor público: teoria e prática. Admissão e dispensa de servidores públicos. Cargos e salários. Programas de incentivos e benefícios. Prêmios e recompensas. Desenvolvimento de pessoas. Políticas de desenvolvimento de servidores. Carreiras: estruturação de cargos e funções no setor público. Avaliação de desempenho individual. Sistemas de informações gerenciais na gestão de pessoas. Higiene e segurança no trabalho. Qualidade de vida no trabalho. Gestão de pessoas no contexto da organização moderna. Tendências da área de gestão, de pessoas no serviço público.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9149":{"codigo":"CAD9149","nome":"Gestão de Operações e Logística I","ementa":"Evolução e conceitos de logística e de administração de materiais. Previsão da demanda interna de bens e serviços. Estudo do gerenciamento da administração de recursos materiais, como função básica de administração. Gestão de transportes. Gestão de estoques e materiais. Gestão de compras. Gestão de fornecedores (contratos). Administração de Patrimônio.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9150":{"codigo":"CAD9150","nome":"Matemática Financeira e Análise de Investimentos","ementa":"Capitalização simples e composta. Descontos simples e compostos. Equivalência de fluxos de caixa em regimes de capitalização simples e composta. Anuidades ou rendas. Sistemas de amortização. Inflação e correção monetária. Fluxos de caixa e análise de investimentos. Critérios econômicos de avaliação de projetos: taxa interna de retorno, valor presente líquido e índice de lucratividade.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9186":{"codigo":"CAD9186","nome":"Trabalho de Conclusão I","ementa":"","carga_horaria":75,"fase_sugestao":5,"equivalencia":"CAD9181","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9104":{"codigo":"DIR9104","nome":"Direito Empresarial","ementa":"Envolve conceitos sobre Direito Empresarial e sua evolução. Pessoas Físicas e jurídicas. Atos e fatos jurídicos. Empresário. Empresa. Estabelecimento Empresarial. Obrigações profissionais do Empresário. Sociedades Empresariais, sua constituição, modificação, extinção e liquidação. Contratos em geral. Títulos de crédito. Noções de falência e Recuperação Judicial.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9105":{"codigo":"DIR9105","nome":"Direito e Legislação Tributária","ementa":"Conceitos de Direito Tributário, tais como conhecimento sobre ramos do Direito Público, com ênfase no ramo do Direito Tributário. Estudo das normas constitucionais relativas ao sistema tributário nacional e das normas gerais de Direito Tributário. Estudo e discussão da legislação tributária federal, estadual e municipal e tributos em espécie.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9002":{"codigo":"CAD9002","nome":"Seminário Temático II na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"CAD9174 ou CAD9175 ou CAD9176","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9153":{"codigo":"CAD9153","nome":"Orçamento Público","ementa":"Fundamentos e princípios orçamentários. Aspectos constitucionais do orçamento. Processo orçamentário como instrumento de planejamento: relação entre Plano Plurianual (PPA), Lei de Diretrizes Orçamentárias (LDO) e Lei Orçamentária Anual (LOA). O ciclo orçamentário. Elaboração do orçamento: receita e despesa. Execução orçamentária e financeira: etapas da receita e da despesa. Créditos adicionais. Gestão democrática de alocação de recursos: orçamento participativo.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9154":{"codigo":"CAD9154","nome":"Administração Estratégica","ementa":"Evolução do pensamento estratégico. Administração Estratégica e Planejamento Estratégico. Vantagens e desvantagens do Processo de Planejamento Estratégico. Etapas do processo de Planejamento Estratégico na Administração Pública: implantação, controle e avaliação do processo de Planejamento Estratégico.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9155":{"codigo":"CAD9155","nome":"Gestão de Operações e Logística II","ementa":"Introdução a operações e à natureza do serviço. Operações de serviço. Sistemas e processos de serviço. Projeto e organização do posto de trabalho. Arranjo físico e fluxo. Localização de instalações. Gestão de filas. Gestão da capacidade e da demanda. Relacionamento com clientes e fornecedores. Melhoria operacional: produtividade, qualidade, garantia e recuperação de falhas. Planejamento e gestão da rede de operações e serviço.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9156":{"codigo":"CAD9156","nome":"Elaboração e Gestão de Projetos","ementa":"Planejamento e projeto: conceituação, Estruturas organizacionais voltadas para projeto. Habilidades de gerente de projetos. Equipes de projeto. Ciclos e fases do projeto: fluxo do processo. Definição do escopo do projeto. Identificação de restrições. Planejamento de recursos e estimativas. Definição dos controles de planejamento do projeto. Criação do plano de projeto. Avaliação e controle do desempenho do projeto. Planejamento, programa e controle de projetos e produtos especiais, produzidos sob encomenda. Métodos e técnicas utilizados na avaliação econômica e social de projetos. Avaliação do risco e do retorno dos projetos. Análise de custos futuros gerados pelo projeto. Aceleração de projetos. Organização geral. Aplicação de técnicas de Gantt, CPM, PERT\/TEMPO e PERT\/CUSTO. Uso de software para gerenciamento de projetos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9187":{"codigo":"CAD9187","nome":"Trabalho de Conclusão II","ementa":"","carga_horaria":75,"fase_sugestao":6,"equivalencia":"CAD9182","prerequisito":"CAD9181 ou CAD9186","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9157":{"codigo":"DIR9157","nome":"Licitação, Contratos e Convênios","ementa":"Licitação: aspectos gerais, princípios constitucionais, dispensa e inexigibilidade, modalidades, pregão eletrônico e presencial, fases, revogação e invalidação, controle. Contratos: formalização, direitos e deveres, execução, alteração, inexecução, extinção, espécies, controle. Convênios: aspectos gerais, participantes, objeto, formalização, controle.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9003":{"codigo":"CAD9003","nome":"Seminário Temático III na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"CAD9177 ou CAD9178 ou CAD9179","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9158":{"codigo":"CAD9158","nome":"Negociação e Arbitragem","ementa":"Mediação e arbitragem: o marco regulatório brasileiro. Negociação: conceitos e princípios; o conflito; o negociador; o objeto; o lugar; os modelos e estilos; desenvolvimento da negociação; feedback. Arbitragem: retrospectiva histórica e o momento atual; conceito; a convenção e os tipos de arbitragem; o árbitro; a sentença arbitral.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9159":{"codigo":"CAD9159","nome":"Tecnologia e Inovação","ementa":"História da tecnologia. Conceitos fundamentais: ciência, tecnologia e inovação. Indicadores de Ciência, Tecnologia e Inovação. Principais condicionantes do processo de inovação tecnológica. Gestão da inovação tecnológica. Avaliação de projetos de P&D. Financiamento para a inovação no Brasil. Tecnologias convencionais e tecnologias sociais. Novas tecnologias e suas implicações sociais. As TICs em foco.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9160":{"codigo":"CAD9160","nome":"Gestão de Redes de Cooperação na Esfera Pública","ementa":"Conceito, gênese e tipos de redes, modelos de gestão e estruturas de redes públicas. Redes federativas e redes públicas de cooperação, redes comunitárias. Complementaridade e Supletividade nas redes híbridas.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9167":{"codigo":"CAD9167","nome":"Gestão de Regulação","ementa":"Direito e Economia da Regulação e da Concorrência; O Poder Regulatório do Estado e Concessão de Serviços Públicos; Políticas e Estrutura da Regulação no Brasil; Defesa do Consumidor; Defesa da Concorrência. O marco regulatório brasileiro: legislação, órgãos e entidades (nacionais, estaduais e municipais).","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9188":{"codigo":"CAD9188","nome":"Trabalho de Conclusão III","ementa":"","carga_horaria":75,"fase_sugestao":7,"equivalencia":"CAD9183","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9145":{"codigo":"CCN9145","nome":"Auditoria e Controladoria","ementa":"Probidade administrativa. Princípios e sistema de controle na administração pública. Controle social e transparência no Brasil. Fiscalização orçamentária, financeira, contábil e patrimonial do Estado. Organização e funcionamento do controle externo e interno na administração pública. Fluxo da gestão governamental (PPA, LDO, LOA). Conceitos de Auditoria Governamental. Tipos de Auditoria Governamental. Controles da Administração Pública. Elaboração de Relatório de Auditoria.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9004":{"codigo":"CAD9004","nome":"Seminário Temático IV na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"CAD9191 ou CAD9192 ou CAD9193","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9164":{"codigo":"CAD9164","nome":"Gestão Ambiental e Sustentabilidade","ementa":"A evolução da gestão ambiental; as políticas de comando e controle; conceitos e propostas para um desenvolvimento sustentável; a evolução da legislação ambiental; o novo papel dos Municípios, dos Estados e da União na gestão ambiental pública; o setor público como cliente e seu poder de compra; a Agenda Ambiental na Administração Pública (A3P); o desenvolvimento regional sustentável; as políticas do governo brasileiro frente aos acordos internacionais de proteção ambiental.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9166":{"codigo":"CAD9166","nome":"Gestão da Qualidade no Setor Público","ementa":"Considerações sobre o setor público. Qualidade: conceitos e princípios. Planejamento e controle da qualidade. Ferramentas. Melhoria em operações. Qualidade em serviços: projeto, desenho de processos, programação de serviços e controle de qualidade.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9168":{"codigo":"CAD9168","nome":"Políticas Públicas e Sociedade","ementa":"Introdução ao estudo das políticas públicas. Conceitos fundamentais: políticas públicas, público e privado, público e estatal, público e governamental. Estado, mercado e esfera pública. O Estado de Bem-estar Social, a formação da cidadania moderna e o desenvolvimento da democracia. Histórico do Estado de Bem-estar Social. Tipologias de Estados de Bem-estar Social. A formação da Agenda Pública. A questão da decisão e da não decisão. Modelos de decisão e o papel dos atores políticos: parlamentos, partidos políticos, grupos de interesse, estruturas institucionais e mídia. Implementação e avaliação das políticas públicas. Tendências das políticas públicas no início do Século XXI. Liberalismo, socialdemocracia e políticas públicas. O efeito da globalização para as políticas públicas. A participação da sociedade na decisão e acompanhamento da execução das políticas públicas: a gestão democrática. Relações Étnicos-Raciais e ensino de História e Cultura Afro-brasileira e Africana.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9189":{"codigo":"CAD9189","nome":"Trabalho de Conclusão IV","ementa":"","carga_horaria":75,"fase_sugestao":8,"equivalencia":"CAD9184","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9165":{"codigo":"CNM9165","nome":"Relações Internacionais","ementa":"Analisar as relações internacionais no período contemporâneo e verificar como se encontra estruturado o sistema internacional. Temas como a globalização, a regionalização, a interdependência e aqueles que têm ocupado a agenda dos governos nos anos de 1990, tais como as organizações internacionais e não governamentais, o meio ambiente, os direitos humanos, os conflitos étnicos e religiosos, os nacionalismos e o terrorismo.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9185":{"codigo":"CAD9185","nome":"Atividades Complementares II","ementa":"","carga_horaria":120,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9110":{"codigo":"CAD9110","nome":"Informática Básica","ementa":"Estrutura de computadores. Softwares. Aplicativos: processadores de textos, planilha eletrônica e apresentação de slides. Sistemas Computacionais: características, noções de modelagem de dados.  Bancos de dados. Internet e páginas web. Correio Eletrônico: uso corporativo, atividades em grupo.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLV9113":{"codigo":"LLV9113","nome":"Redação Oficial","ementa":"Características do texto administrativo e a linguagem oficial aplicadas na produção de documentos e correspondências oficiais e empresariais.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"CAD9194","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"MTM9108":{"codigo":"MTM9108","nome":"Matemática Básica - Nivelamento","ementa":"Conjuntos e Relações. Potenciação, Radiação, Logaritmo e Exponencial. Produtos Notáveis. Razão, Proporção e Porcentagem. Frações. Equações de 1º e 2º graus. Inequações de 1º grau. Aplicações.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20132":{"id":"350","codigo":20132,"codigo_curso":713,"carga_horaria_ufsc":3000,"carga_horaria_mec":3000,"aulas_semana_min":15,"aulas_semana_esperado":20,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":9,"num_periodos_max":16,"descricao":"Referente a Terceira Edição PNAP\/UAB","ucs":{"CAD9108":{"codigo":"CAD9108","nome":"Teorias da Administração I","ementa":"Introdução à Administração: mercado de trabalho; conceito de administração; o Administrador e seu papel na sociedade atual; formação e legislação profissional. As organizações: conceitos e ambientes competitivos globalizados. Funções administrativas e organizacionais. Composição Organizacional e Processo Administrativo. Novas tendências.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9120":{"codigo":"CAD9120","nome":"Seminário Integrador","ementa":"","carga_horaria":30,"fase_sugestao":1,"equivalencia":"CAD9109","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9124":{"codigo":"CAD9124","nome":"Metodologia de Estudo e de Pesquisa em Administração","ementa":"Métodos de estudo: orientação para a leitura, análise e interpretação de texto. Ciência, metodologia e pesquisa em administração. Tipos de pesquisa. O processo de pesquisa. Instrumentos e técnicas de coleta e análise de dados. Estrutura e organização de trabalhos científicos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9105":{"codigo":"CNM9105","nome":"Introdução à Economia","ementa":"Conceitos e princípios de economia. Evolução do Pensamento Econômico. Noções de Microeconomia: mercado e preços; demanda e oferta; teoria do consumidor; teoria da firma; e estrutura de mercado e eficiência. Noções de Macroeconomia: determinação da renda e do produto nacional; mercado de bens e serviços; e lado monetário. O setor externo, câmbio e estrutura de balança de pagamento. Setor Público: funções econômicas; estrutura tributária e déficit público. Desenvolvimento Econômico, fontes de crescimento, financiamento e modelos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIL9102":{"codigo":"FIL9102","nome":"Filosofia e Ética","ementa":"Conceito de filosofia: filosofia como doutrina e como ato de pensar. Filosofia e outras formas de conhecimento humano. Características gerais dos grandes períodos da história da filosofia. Conceito de ética. Ética como problema teórico e como problema prático. Ética e responsabilidade. Teorias morais. Ética e 'ética profissional'. Ética e política.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9104":{"codigo":"PSI9104","nome":"Psicologia Organizacional","ementa":"Contribuições das teorias psicológicas para o campo do estudo das organizações. Impacto dos diversos modos de organização do trabalho na vida e saúde das pessoas. Temas da psicologia na interface com os estudos organizacionais: motivação, aprendizagem, percepção e grupos. Tensão e conflito. Processo de liderança.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9139":{"codigo":"CAD9139","nome":"Teorias da Administração II","ementa":"Escolas e Evolução do Pensamento Administrativo. Gestão por função e gestão por processos. Sistema administrativo e mudança organizacional.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9161":{"codigo":"CAD9161","nome":"Seminário Temático I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9100":{"codigo":"CCN9100","nome":"Contabilidade Geral","ementa":"Elementos de Contabilidade: definições. Aplicação. Exigências legais e finalidades de Contabilidade. Organização das unidades econômicas. Fatos contábeis e econômicos. Método das Partidas Dobradas: registros e sistemas contábeis. Demonstrações contábeis. Apuração do resultado do exercício. Balanço patrimonial e demonstração de resultado do exercício. Aspectos fundamentais da teoria contábil. Análise das informações contábeis.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9106":{"codigo":"CNM9106","nome":"Macroeconomia","ementa":"Fundamentos da análise macroeconômica; Problemas macroeconômicos; Modelos macroeconômicos; Contabilidade Nacional; Determinantes da demanda e oferta agregada; Moeda, juros e renda; Economia Aberta; Política econômica; O papel do governo; Inflação.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9104":{"codigo":"MTM9104","nome":"Matemática para Administradores","ementa":"Teoria dos Conjuntos. Matrizes. Sistemas de equações lineares. Funções. Limites. Continuidade. Derivadas. Aplicação do conteúdo estudado em problemas administrativos.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9101":{"codigo":"SPO9101","nome":"Ciência Política","ementa":"Conceitos básicos em ciências políticas ao invés de objeto; Fundamentos teóricos das ciências políticas; Formas de governo e regimes políticos; Representação e sistemas partidários.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9140":{"codigo":"CAD9140","nome":"Teorias da Administração Pública","ementa":"O Estado, o governo e a sociedade. Evolução da administração pública brasileira: patrimonialismo, burocracia e gerencialismo. Contexto contemporâneo da atuação do Estado. Governabilidade, governança e descentralização do poder. Estrutura e função da administração pública. Eficiência, eficácia e efetividade na administração pública. Reformas administrativas e programas de desburocratização: DASP, Decreto-Lei nº 200\/67; Constituição de 1988 e Emenda Constitucional nº 19\/98. Considerações sobre o novo papel do Estado e da administração pública. A reforma de Estado e da administração pública: experiências inglesa, americana e brasileira. Representação e participação: gestão pública e privada. Accountability e Responsiveness: as relações entre demandas, políticas, ação governamental, controles e resultados.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9162":{"codigo":"CAD9162","nome":"Seminário Temático II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9143":{"codigo":"CCN9143","nome":"Contabilidade Pública","ementa":"Elementos de contabilidade geral. Contabilidade Pública: métodos e sistemas de escrituração. Receita e despesa pública. Contabilidade orçamentária, financeira e patrimonial. Demonstrações contábeis: balanços, variações patrimoniais, consolidação e prestação de contas. Lançamentos contábeis. Planificação contábil. Contabilização em empresas públicas. Campo de aplicação da contabilidade pública. Patrimônio público. Exercício financeiro. Aspectos fundamentais. Relatórios RREO e RGF.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"CAD9143","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9108":{"codigo":"CNM9108","nome":"Economia Brasileira","ementa":"Evolução histórica da economia brasileira no período republicano. A evolução recente da economia no Brasil: agricultura e indústria; comércio exterior; inflação; relações Inter setoriais e regionais. Temas emergentes na economia brasileira e a atualidade: o problema da distribuição de renda e indicadores socioeconômicos; desemprego e informalidade; globalização, inserção periférica e acordos internacionais","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9954":{"codigo":"DIR9954","nome":"Instituições de Direito Público e Privado","ementa":"Noções de Direito; Norma jurídica e outras normas sociais. Direito público e direito privado. Subdivisões. Fontes do direito. Conceito de Estado, sua origem e formação; Elementos de Estado: Estado de Direito, Estado Social de Direito e Estado Democrático de Direito; Poder e funções do Estado; Formas de Estado, formas de Governo e sistemas de Governo. Conceito de Constituição; classificação e poder constituinte; Supremacia da Constituição e controle de constitucionalidade; As Constituições brasileiras. A constituição vigente. Organização do Estado Brasileiro: Forma de Estado, forma de Governo e sistema de Governo; Poder legislativo: função, organização, garantias; Poder Judiciário: funções, organização, garantias. Poder Executivo: funções, organização, atribuições e responsabilidade. Conceito de Administração pública; Princípios; Organização administrativa. Administração Direta e indireta; Servidores públicos. Direitos e Garantias Individuais; Direitos fundamentais do Homem.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9103":{"codigo":"SPO9103","nome":"Sociologia Organizacional","ementa":"A Sociologia e seu objeto de estudo. Conceitos básicos: relação social, estrutura e paradigmas de relacionamento, socialização e formação da cultura. Interação social: o indivíduo e a sociedade. Papel social, grupos e organização social. Organização formal e organização informal. Atitudes, valores e comportamento nas organizações. Cultura organizacional: tipologia, características e planejamento de mudanças.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9146":{"codigo":"CAD9146","nome":"Sistemas de Informação e Comunicação no Setor Público","ementa":"Fundamentos de sistemas, processos e informações; Tecnologia e sistemas de informações; aplicações no setor público e privado; Gestão de tecnologia da informação no setor público; Planejamento Estratégico e Tecnologia da Informação; Governo Eletrônico; Governança Tecnológica; Padrões de Sistemas de Informação e Políticas Públicas.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9163":{"codigo":"CAD9163","nome":"Seminário Temático III - GESTÃO EM SAÚDE","ementa":"","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9214":{"codigo":"CAD9214","nome":"Organização, Processo e Tomada de Decisão","ementa":"Organização e reorganização. Organogramas. Aproveitamento racional do espaço físico. Processos: fluxogramas e otimização. Condicionantes e componentes da estrutura organizacional: autoridade, responsabilidade e comunicação; estratégia, tecnologia, ambiente, pessoas e objetivos. Departamentalização. Centralização e Descentralização. Métodos e instrumentos de modernização de estruturas, sistemas e processos das organizações. Estruturas alternativas; tendências atuais. A função decisão no contexto da Administração. Administração como um processo de tomada de decisões empresarial: análise estratégica, alocação e mobilização dos recursos, especificações e desempenho. Tipos de decisão. Métodos e processos de tomada de decisão. Instrumentos para a tomada de decisão.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9144":{"codigo":"CNM9144","nome":"Teoria das Finanças Públicas","ementa":"","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9955":{"codigo":"DIR9955","nome":"Direito Administrativo","ementa":"Conceito. Campo de Aplicação. Objeto do Direito. Sujeito direito. Pessoas jurídicas e administrativas. Fontes do Direito Administrativo. Administração Pública. Autarquias. Sociedades de economia mista. Empresas públicas. Fundações. Função pública e bens públicos. Relação de Direito Administrativo. Regime Jurídico- Administrativo. Princípios Constitucionais do Direito Administrativo. Poderes Administrativos. Organização Administrativa. Órgãos Administrativos. Atos Administrativos. Noções Gerais sobre Procedimento Administrativo. Licitação. Contratos Administrativos. Domínio público. Intervenção na propriedade. Responsabilidade civil da administração pública. Crimes contra a administração pública.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE9103":{"codigo":"INE9103","nome":"Estatística","ementa":"Fases do método estatístico. Dados brutos e derivados. Medidas de tendência central, separatrizes, medidas de dispersão. Probabilidade. Distribuições discretas e contínuas. Amostras e populações. Testes de hipóteses.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9001":{"codigo":"CAD9001","nome":"Seminário Temático I na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"CAD9171 ou CAD9172 ou CAD9173","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9147":{"codigo":"CAD9147","nome":"Planejamento e Programação na Administração Pública","ementa":"Planejamento e políticas públicas. Teorias e modelos de planejamento governamental. Enfoque sistêmico e estratégico de planejamento. Métodos, técnicas\/características e etapas. Avaliação e acompanhamento como parte do processo de planejamento. Construção de indicadores de monitoramento e avaliação. Evolução do planejamento governamental no Brasil. Os Planos Nacionais de Desenvolvimento. Planejamento governamental no Brasil contemporâneo: concepção, estrutura e sistema do PPA.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9148":{"codigo":"CAD9148","nome":"Gestão de Pessoas no Setor Público","ementa":"Evolução da gestão de pessoas. Conceitos da gestão de pessoas. Processos de gestão de pessoas. Planejamento estratégico de pessoas. Gestão de equipes, gestão por competências e gestão do conhecimento. Gestão de pessoas no setor público: teoria e prática. Admissão e dispensa de servidores públicos. Cargos e salários. Programas de incentivos e benefícios. Prêmios e recompensas. Desenvolvimento de pessoas. Políticas de desenvolvimento de servidores. Carreiras: estruturação de cargos e funções no setor público. Avaliação de desempenho individual. Sistemas de informações gerenciais na gestão de pessoas. Higiene e segurança no trabalho. Qualidade de vida no trabalho. Gestão de pessoas no contexto da organização moderna. Tendências da área de gestão, de pessoas no serviço público.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9149":{"codigo":"CAD9149","nome":"Gestão de Operações e Logística I","ementa":"Evolução e conceitos de logística e de administração de materiais. Previsão da demanda interna de bens e serviços. Estudo do gerenciamento da administração de recursos materiais, como função básica de administração. Gestão de transportes. Gestão de estoques e materiais. Gestão de compras. Gestão de fornecedores (contratos). Administração de Patrimônio.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9150":{"codigo":"CAD9150","nome":"Matemática Financeira e Análise de Investimentos","ementa":"Capitalização simples e composta. Descontos simples e compostos. Equivalência de fluxos de caixa em regimes de capitalização simples e composta. Anuidades ou rendas. Sistemas de amortização. Inflação e correção monetária. Fluxos de caixa e análise de investimentos. Critérios econômicos de avaliação de projetos: taxa interna de retorno, valor presente líquido e índice de lucratividade.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9186":{"codigo":"CAD9186","nome":"Trabalho de Conclusão I","ementa":"","carga_horaria":75,"fase_sugestao":5,"equivalencia":"CAD9181","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9104":{"codigo":"DIR9104","nome":"Direito Empresarial","ementa":"Envolve conceitos sobre Direito Empresarial e sua evolução. Pessoas Físicas e jurídicas. Atos e fatos jurídicos. Empresário. Empresa. Estabelecimento Empresarial. Obrigações profissionais do Empresário. Sociedades Empresariais, sua constituição, modificação, extinção e liquidação. Contratos em geral. Títulos de crédito. Noções de falência e Recuperação Judicial.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9105":{"codigo":"DIR9105","nome":"Direito e Legislação Tributária","ementa":"Conceitos de Direito Tributário, tais como conhecimento sobre ramos do Direito Público, com ênfase no ramo do Direito Tributário. Estudo das normas constitucionais relativas ao sistema tributário nacional e das normas gerais de Direito Tributário. Estudo e discussão da legislação tributária federal, estadual e municipal e tributos em espécie.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9002":{"codigo":"CAD9002","nome":"Seminário Temático II na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"CAD9174 ou CAD9175 ou CAD9176","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9153":{"codigo":"CAD9153","nome":"Orçamento Público","ementa":"Fundamentos e princípios orçamentários. Aspectos constitucionais do orçamento. Processo orçamentário como instrumento de planejamento: relação entre Plano Plurianual (PPA), Lei de Diretrizes Orçamentárias (LDO) e Lei Orçamentária Anual (LOA). O ciclo orçamentário. Elaboração do orçamento: receita e despesa. Execução orçamentária e financeira: etapas da receita e da despesa. Créditos adicionais. Gestão democrática de alocação de recursos: orçamento participativo.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9154":{"codigo":"CAD9154","nome":"Administração Estratégica","ementa":"Evolução do pensamento estratégico. Administração Estratégica e Planejamento Estratégico. Vantagens e desvantagens do Processo de Planejamento Estratégico. Etapas do processo de Planejamento Estratégico na Administração Pública: implantação, controle e avaliação do processo de Planejamento Estratégico.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9155":{"codigo":"CAD9155","nome":"Gestão de Operações e Logística II","ementa":"Introdução a operações e à natureza do serviço. Operações de serviço. Sistemas e processos de serviço. Projeto e organização do posto de trabalho. Arranjo físico e fluxo. Localização de instalações. Gestão de filas. Gestão da capacidade e da demanda. Relacionamento com clientes e fornecedores. Melhoria operacional: produtividade, qualidade, garantia e recuperação de falhas. Planejamento e gestão da rede de operações e serviço.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9156":{"codigo":"CAD9156","nome":"Elaboração e Gestão de Projetos","ementa":"Planejamento e projeto: conceituação, Estruturas organizacionais voltadas para projeto. Habilidades de gerente de projetos. Equipes de projeto. Ciclos e fases do projeto: fluxo do processo. Definição do escopo do projeto. Identificação de restrições. Planejamento de recursos e estimativas. Definição dos controles de planejamento do projeto. Criação do plano de projeto. Avaliação e controle do desempenho do projeto. Planejamento, programa e controle de projetos e produtos especiais, produzidos sob encomenda. Métodos e técnicas utilizados na avaliação econômica e social de projetos. Avaliação do risco e do retorno dos projetos. Análise de custos futuros gerados pelo projeto. Aceleração de projetos. Organização geral. Aplicação de técnicas de Gantt, CPM, PERT\/TEMPO e PERT\/CUSTO. Uso de software para gerenciamento de projetos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9187":{"codigo":"CAD9187","nome":"Trabalho de Conclusão II","ementa":"","carga_horaria":75,"fase_sugestao":6,"equivalencia":"CAD9182","prerequisito":"CAD9181 ou CAD9186","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9157":{"codigo":"DIR9157","nome":"Licitação, Contratos e Convênios","ementa":"Licitação: aspectos gerais, princípios constitucionais, dispensa e inexigibilidade, modalidades, pregão eletrônico e presencial, fases, revogação e invalidação, controle. Contratos: formalização, direitos e deveres, execução, alteração, inexecução, extinção, espécies, controle. Convênios: aspectos gerais, participantes, objeto, formalização, controle.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9003":{"codigo":"CAD9003","nome":"Seminário Temático III na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"CAD9177 ou CAD9178 ou CAD9179","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9158":{"codigo":"CAD9158","nome":"Negociação e Arbitragem","ementa":"Mediação e arbitragem: o marco regulatório brasileiro. Negociação: conceitos e princípios; o conflito; o negociador; o objeto; o lugar; os modelos e estilos; desenvolvimento da negociação; feedback. Arbitragem: retrospectiva histórica e o momento atual; conceito; a convenção e os tipos de arbitragem; o árbitro; a sentença arbitral.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9159":{"codigo":"CAD9159","nome":"Tecnologia e Inovação","ementa":"História da tecnologia. Conceitos fundamentais: ciência, tecnologia e inovação. Indicadores de Ciência, Tecnologia e Inovação. Principais condicionantes do processo de inovação tecnológica. Gestão da inovação tecnológica. Avaliação de projetos de P&D. Financiamento para a inovação no Brasil. Tecnologias convencionais e tecnologias sociais. Novas tecnologias e suas implicações sociais. As TICs em foco.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9160":{"codigo":"CAD9160","nome":"Gestão de Redes de Cooperação na Esfera Pública","ementa":"Conceito, gênese e tipos de redes, modelos de gestão e estruturas de redes públicas. Redes federativas e redes públicas de cooperação, redes comunitárias. Complementaridade e Supletividade nas redes híbridas.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9167":{"codigo":"CAD9167","nome":"Gestão de Regulação","ementa":"Direito e Economia da Regulação e da Concorrência; O Poder Regulatório do Estado e Concessão de Serviços Públicos; Políticas e Estrutura da Regulação no Brasil; Defesa do Consumidor; Defesa da Concorrência. O marco regulatório brasileiro: legislação, órgãos e entidades (nacionais, estaduais e municipais).","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9188":{"codigo":"CAD9188","nome":"Trabalho de Conclusão III","ementa":"","carga_horaria":75,"fase_sugestao":7,"equivalencia":"CAD9183","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9145":{"codigo":"CCN9145","nome":"Auditoria e Controladoria","ementa":"Probidade administrativa. Princípios e sistema de controle na administração pública. Controle social e transparência no Brasil. Fiscalização orçamentária, financeira, contábil e patrimonial do Estado. Organização e funcionamento do controle externo e interno na administração pública. Fluxo da gestão governamental (PPA, LDO, LOA). Conceitos de Auditoria Governamental. Tipos de Auditoria Governamental. Controles da Administração Pública. Elaboração de Relatório de Auditoria.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9004":{"codigo":"CAD9004","nome":"Seminário Temático IV na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"CAD9191 ou CAD9192 ou CAD9193","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9164":{"codigo":"CAD9164","nome":"Gestão Ambiental e Sustentabilidade","ementa":"A evolução da gestão ambiental; as políticas de comando e controle; conceitos e propostas para um desenvolvimento sustentável; a evolução da legislação ambiental; o novo papel dos Municípios, dos Estados e da União na gestão ambiental pública; o setor público como cliente e seu poder de compra; a Agenda Ambiental na Administração Pública (A3P); o desenvolvimento regional sustentável; as políticas do governo brasileiro frente aos acordos internacionais de proteção ambiental.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9166":{"codigo":"CAD9166","nome":"Gestão da Qualidade no Setor Público","ementa":"Considerações sobre o setor público. Qualidade: conceitos e princípios. Planejamento e controle da qualidade. Ferramentas. Melhoria em operações. Qualidade em serviços: projeto, desenho de processos, programação de serviços e controle de qualidade.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9168":{"codigo":"CAD9168","nome":"Políticas Públicas e Sociedade","ementa":"Introdução ao estudo das políticas públicas. Conceitos fundamentais: políticas públicas, público e privado, público e estatal, público e governamental. Estado, mercado e esfera pública. O Estado de Bem-estar Social, a formação da cidadania moderna e o desenvolvimento da democracia. Histórico do Estado de Bem-estar Social. Tipologias de Estados de Bem-estar Social. A formação da Agenda Pública. A questão da decisão e da não decisão. Modelos de decisão e o papel dos atores políticos: parlamentos, partidos políticos, grupos de interesse, estruturas institucionais e mídia. Implementação e avaliação das políticas públicas. Tendências das políticas públicas no início do Século XXI. Liberalismo, socialdemocracia e políticas públicas. O efeito da globalização para as políticas públicas. A participação da sociedade na decisão e acompanhamento da execução das políticas públicas: a gestão democrática. Relações Étnicos-Raciais e ensino de História e Cultura Afro-brasileira e Africana.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9189":{"codigo":"CAD9189","nome":"Trabalho de Conclusão IV","ementa":"","carga_horaria":75,"fase_sugestao":8,"equivalencia":"CAD9184","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9165":{"codigo":"CNM9165","nome":"Relações Internacionais","ementa":"Analisar as relações internacionais no período contemporâneo e verificar como se encontra estruturado o sistema internacional. Temas como a globalização, a regionalização, a interdependência e aqueles que têm ocupado a agenda dos governos nos anos de 1990, tais como as organizações internacionais e não governamentais, o meio ambiente, os direitos humanos, os conflitos étnicos e religiosos, os nacionalismos e o terrorismo.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9185":{"codigo":"CAD9185","nome":"Atividades Complementares II","ementa":"","carga_horaria":120,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9110":{"codigo":"CAD9110","nome":"Informática Básica","ementa":"Estrutura de computadores. Softwares. Aplicativos: processadores de textos, planilha eletrônica e apresentação de slides. Sistemas Computacionais: características, noções de modelagem de dados.  Bancos de dados. Internet e páginas web. Correio Eletrônico: uso corporativo, atividades em grupo.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD9194":{"codigo":"CAD9194","nome":"Redação Oficial na Administração Pública","ementa":"caracteristicas do tezxto administratuivonemna linguagem oficial aplicadas na produçção de documentos e correspondencias oficiais e empresariais.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"LLV9113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"MTM9108":{"codigo":"MTM9108","nome":"Matemática Básica - Nivelamento","ementa":"Conjuntos e Relações. Potenciação, Radiação, Logaritmo e Exponencial. Produtos Notáveis. Razão, Proporção e Porcentagem. Frações. Equações de 1º e 2º graus. Inequações de 1º grau. Aplicações.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20171":{"id":"53","codigo":20171,"codigo_curso":713,"carga_horaria_ufsc":3000,"carga_horaria_mec":3000,"aulas_semana_min":15,"aulas_semana_esperado":20,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":9,"num_periodos_max":8,"descricao":"Referente a Quarta Edição PNAP\/UAB","ucs":{"CAD9100":{"codigo":"CAD9100","nome":"Informática para Administradores*","ementa":"","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD9108":{"codigo":"CAD9108","nome":"Teorias da Administração I","ementa":"Introdução à Administração: mercado de trabalho; conceito de administração; o Administrador e seu papel na sociedade atual; formação e legislação profissional. As organizações: conceitos e ambientes competitivos globalizados. Funções administrativas e organizacionais. Composição Organizacional e Processo Administrativo. Novas tendências.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9120":{"codigo":"CAD9120","nome":"Seminário Integrador","ementa":"","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9124":{"codigo":"CAD9124","nome":"Metodologia de Estudo e de Pesquisa em Administração","ementa":"Métodos de estudo: orientação para a leitura, análise e interpretação de texto. Ciência, metodologia e pesquisa em administração. Tipos de pesquisa. O processo de pesquisa. Instrumentos e técnicas de coleta e análise de dados. Estrutura e organização de trabalhos científicos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9105":{"codigo":"CNM9105","nome":"Introdução à Economia","ementa":"Conceitos e princípios de economia. Evolução do Pensamento Econômico. Noções de Microeconomia: mercado e preços; demanda e oferta; teoria do consumidor; teoria da firma; e estrutura de mercado e eficiência. Noções de Macroeconomia: determinação da renda e do produto nacional; mercado de bens e serviços; e lado monetário. O setor externo, câmbio e estrutura de balança de pagamento. Setor Público: funções econômicas; estrutura tributária e déficit público. Desenvolvimento Econômico, fontes de crescimento, financiamento e modelos.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIL9102":{"codigo":"FIL9102","nome":"Filosofia e Ética","ementa":"Conceito de filosofia: filosofia como doutrina e como ato de pensar. Filosofia e outras formas de conhecimento humano. Características gerais dos grandes períodos da história da filosofia. Conceito de ética. Ética como problema teórico e como problema prático. Ética e responsabilidade. Teorias morais. Ética e 'ética profissional'. Ética e política.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9108":{"codigo":"MTM9108","nome":"Matemática Básica - Nivelamento","ementa":"Conjuntos e Relações. Potenciação, Radiação, Logaritmo e Exponencial. Produtos Notáveis. Razão, Proporção e Porcentagem. Frações. Equações de 1º e 2º graus. Inequações de 1º grau. Aplicações.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI9104":{"codigo":"PSI9104","nome":"Psicologia Organizacional","ementa":"Contribuições das teorias psicológicas para o campo do estudo das organizações. Impacto dos diversos modos de organização do trabalho na vida e saúde das pessoas. Temas da psicologia na interface com os estudos organizacionais: motivação, aprendizagem, percepção e grupos. Tensão e conflito. Processo de liderança.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9139":{"codigo":"CAD9139","nome":"Teorias da Administração II","ementa":"Escolas e Evolução do Pensamento Administrativo. Gestão por função e gestão por processos. Sistema administrativo e mudança organizacional.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9161":{"codigo":"CAD9161","nome":"Seminário Temático I - GESTÃO PÚBLICA","ementa":"","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9100":{"codigo":"CCN9100","nome":"Contabilidade Geral","ementa":"Elementos de Contabilidade: definições. Aplicação. Exigências legais e finalidades de Contabilidade. Organização das unidades econômicas. Fatos contábeis e econômicos. Método das Partidas Dobradas: registros e sistemas contábeis. Demonstrações contábeis. Apuração do resultado do exercício. Balanço patrimonial e demonstração de resultado do exercício. Aspectos fundamentais da teoria contábil. Análise das informações contábeis.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9106":{"codigo":"CNM9106","nome":"Macroeconomia","ementa":"Fundamentos da análise macroeconômica; Problemas macroeconômicos; Modelos macroeconômicos; Contabilidade Nacional; Determinantes da demanda e oferta agregada; Moeda, juros e renda; Economia Aberta; Política econômica; O papel do governo; Inflação.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9104":{"codigo":"MTM9104","nome":"Matemática para Administradores","ementa":"Teoria dos Conjuntos. Matrizes. Sistemas de equações lineares. Funções. Limites. Continuidade. Derivadas. Aplicação do conteúdo estudado em problemas administrativos.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9101":{"codigo":"SPO9101","nome":"Ciência Política","ementa":"Conceitos básicos em ciências políticas ao invés de objeto; Fundamentos teóricos das ciências políticas; Formas de governo e regimes políticos; Representação e sistemas partidários.","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9140":{"codigo":"CAD9140","nome":"Teorias da Administração Pública","ementa":"O Estado, o governo e a sociedade. Evolução da administração pública brasileira: patrimonialismo, burocracia e gerencialismo. Contexto contemporâneo da atuação do Estado. Governabilidade, governança e descentralização do poder. Estrutura e função da administração pública. Eficiência, eficácia e efetividade na administração pública. Reformas administrativas e programas de desburocratização: DASP, Decreto-Lei nº 200\/67; Constituição de 1988 e Emenda Constitucional nº 19\/98. Considerações sobre o novo papel do Estado e da administração pública. A reforma de Estado e da administração pública: experiências inglesa, americana e brasileira. Representação e participação: gestão pública e privada. Accountability e Responsiveness: as relações entre demandas, políticas, ação governamental, controles e resultados.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9162":{"codigo":"CAD9162","nome":"Seminário Temático II - GESTÃO PÚBLICA MUNICIPAL","ementa":"","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9143":{"codigo":"CCN9143","nome":"Contabilidade Pública","ementa":"Elementos de contabilidade geral. Contabilidade Pública: métodos e sistemas de escrituração. Receita e despesa pública. Contabilidade orçamentária, financeira e patrimonial. Demonstrações contábeis: balanços, variações patrimoniais, consolidação e prestação de contas. Lançamentos contábeis. Planificação contábil. Contabilização em empresas públicas. Campo de aplicação da contabilidade pública. Patrimônio público. Exercício financeiro. Aspectos fundamentais. Relatórios RREO e RGF.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9108":{"codigo":"CNM9108","nome":"Economia Brasileira","ementa":"Evolução histórica da economia brasileira no período republicano. A evolução recente da economia no Brasil: agricultura e indústria; comércio exterior; inflação; relações Inter setoriais e regionais. Temas emergentes na economia brasileira e a atualidade: o problema da distribuição de renda e indicadores socioeconômicos; desemprego e informalidade; globalização, inserção periférica e acordos internacionais","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9954":{"codigo":"DIR9954","nome":"Instituições de Direito Público e Privado","ementa":"Noções de Direito; Norma jurídica e outras normas sociais. Direito público e direito privado. Subdivisões. Fontes do direito. Conceito de Estado, sua origem e formação; Elementos de Estado: Estado de Direito, Estado Social de Direito e Estado Democrático de Direito; Poder e funções do Estado; Formas de Estado, formas de Governo e sistemas de Governo. Conceito de Constituição; classificação e poder constituinte; Supremacia da Constituição e controle de constitucionalidade; As Constituições brasileiras. A constituição vigente. Organização do Estado Brasileiro: Forma de Estado, forma de Governo e sistema de Governo; Poder legislativo: função, organização, garantias; Poder Judiciário: funções, organização, garantias. Poder Executivo: funções, organização, atribuições e responsabilidade. Conceito de Administração pública; Princípios; Organização administrativa. Administração Direta e indireta; Servidores públicos. Direitos e Garantias Individuais; Direitos fundamentais do Homem.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"SPO9103":{"codigo":"SPO9103","nome":"Sociologia Organizacional","ementa":"A Sociologia e seu objeto de estudo. Conceitos básicos: relação social, estrutura e paradigmas de relacionamento, socialização e formação da cultura. Interação social: o indivíduo e a sociedade. Papel social, grupos e organização social. Organização formal e organização informal. Atitudes, valores e comportamento nas organizações. Cultura organizacional: tipologia, características e planejamento de mudanças.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9146":{"codigo":"CAD9146","nome":"Sistemas de Informação e Comunicação no Setor Público","ementa":"Fundamentos de sistemas, processos e informações; Tecnologia e sistemas de informações; aplicações no setor público e privado; Gestão de tecnologia da informação no setor público; Planejamento Estratégico e Tecnologia da Informação; Governo Eletrônico; Governança Tecnológica; Padrões de Sistemas de Informação e Políticas Públicas.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9163":{"codigo":"CAD9163","nome":"Seminário Temático III - GESTÃO EM SAÚDE","ementa":"","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9214":{"codigo":"CAD9214","nome":"Organização, Processo e Tomada de Decisão","ementa":"Organização e reorganização. Organogramas. Aproveitamento racional do espaço físico. Processos: fluxogramas e otimização. Condicionantes e componentes da estrutura organizacional: autoridade, responsabilidade e comunicação; estratégia, tecnologia, ambiente, pessoas e objetivos. Departamentalização. Centralização e Descentralização. Métodos e instrumentos de modernização de estruturas, sistemas e processos das organizações. Estruturas alternativas; tendências atuais. A função decisão no contexto da Administração. Administração como um processo de tomada de decisões empresarial: análise estratégica, alocação e mobilização dos recursos, especificações e desempenho. Tipos de decisão. Métodos e processos de tomada de decisão. Instrumentos para a tomada de decisão.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM9144":{"codigo":"CNM9144","nome":"Teoria das Finanças Públicas","ementa":"","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9955":{"codigo":"DIR9955","nome":"Direito Administrativo","ementa":"Conceito. Campo de Aplicação. Objeto do Direito. Sujeito direito. Pessoas jurídicas e administrativas. Fontes do Direito Administrativo. Administração Pública. Autarquias. Sociedades de economia mista. Empresas públicas. Fundações. Função pública e bens públicos. Relação de Direito Administrativo. Regime Jurídico- Administrativo. Princípios Constitucionais do Direito Administrativo. Poderes Administrativos. Organização Administrativa. Órgãos Administrativos. Atos Administrativos. Noções Gerais sobre Procedimento Administrativo. Licitação. Contratos Administrativos. Domínio público. Intervenção na propriedade. Responsabilidade civil da administração pública. Crimes contra a administração pública.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE9127":{"codigo":"INE9127","nome":"Estatística Aplicada à Administração","ementa":"","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9001":{"codigo":"CAD9001","nome":"Seminário Temático I na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9147":{"codigo":"CAD9147","nome":"Planejamento e Programação na Administração Pública","ementa":"Planejamento e políticas públicas. Teorias e modelos de planejamento governamental. Enfoque sistêmico e estratégico de planejamento. Métodos, técnicas\/características e etapas. Avaliação e acompanhamento como parte do processo de planejamento. Construção de indicadores de monitoramento e avaliação. Evolução do planejamento governamental no Brasil. Os Planos Nacionais de Desenvolvimento. Planejamento governamental no Brasil contemporâneo: concepção, estrutura e sistema do PPA.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9148":{"codigo":"CAD9148","nome":"Gestão de Pessoas no Setor Público","ementa":"Evolução da gestão de pessoas. Conceitos da gestão de pessoas. Processos de gestão de pessoas. Planejamento estratégico de pessoas. Gestão de equipes, gestão por competências e gestão do conhecimento. Gestão de pessoas no setor público: teoria e prática. Admissão e dispensa de servidores públicos. Cargos e salários. Programas de incentivos e benefícios. Prêmios e recompensas. Desenvolvimento de pessoas. Políticas de desenvolvimento de servidores. Carreiras: estruturação de cargos e funções no setor público. Avaliação de desempenho individual. Sistemas de informações gerenciais na gestão de pessoas. Higiene e segurança no trabalho. Qualidade de vida no trabalho. Gestão de pessoas no contexto da organização moderna. Tendências da área de gestão, de pessoas no serviço público.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9149":{"codigo":"CAD9149","nome":"Gestão de Operações e Logística I","ementa":"Evolução e conceitos de logística e de administração de materiais. Previsão da demanda interna de bens e serviços. Estudo do gerenciamento da administração de recursos materiais, como função básica de administração. Gestão de transportes. Gestão de estoques e materiais. Gestão de compras. Gestão de fornecedores (contratos). Administração de Patrimônio.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9150":{"codigo":"CAD9150","nome":"Matemática Financeira e Análise de Investimentos","ementa":"Capitalização simples e composta. Descontos simples e compostos. Equivalência de fluxos de caixa em regimes de capitalização simples e composta. Anuidades ou rendas. Sistemas de amortização. Inflação e correção monetária. Fluxos de caixa e análise de investimentos. Critérios econômicos de avaliação de projetos: taxa interna de retorno, valor presente líquido e índice de lucratividade.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9186":{"codigo":"CAD9186","nome":"Trabalho de Conclusão I","ementa":"","carga_horaria":75,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9104":{"codigo":"DIR9104","nome":"Direito Empresarial","ementa":"Envolve conceitos sobre Direito Empresarial e sua evolução. Pessoas Físicas e jurídicas. Atos e fatos jurídicos. Empresário. Empresa. Estabelecimento Empresarial. Obrigações profissionais do Empresário. Sociedades Empresariais, sua constituição, modificação, extinção e liquidação. Contratos em geral. Títulos de crédito. Noções de falência e Recuperação Judicial.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9105":{"codigo":"DIR9105","nome":"Direito e Legislação Tributária","ementa":"Conceitos de Direito Tributário, tais como conhecimento sobre ramos do Direito Público, com ênfase no ramo do Direito Tributário. Estudo das normas constitucionais relativas ao sistema tributário nacional e das normas gerais de Direito Tributário. Estudo e discussão da legislação tributária federal, estadual e municipal e tributos em espécie.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9002":{"codigo":"CAD9002","nome":"Seminário Temático II na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9153":{"codigo":"CAD9153","nome":"Orçamento Público","ementa":"Fundamentos e princípios orçamentários. Aspectos constitucionais do orçamento. Processo orçamentário como instrumento de planejamento: relação entre Plano Plurianual (PPA), Lei de Diretrizes Orçamentárias (LDO) e Lei Orçamentária Anual (LOA). O ciclo orçamentário. Elaboração do orçamento: receita e despesa. Execução orçamentária e financeira: etapas da receita e da despesa. Créditos adicionais. Gestão democrática de alocação de recursos: orçamento participativo.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9154":{"codigo":"CAD9154","nome":"Administração Estratégica","ementa":"Evolução do pensamento estratégico. Administração Estratégica e Planejamento Estratégico. Vantagens e desvantagens do Processo de Planejamento Estratégico. Etapas do processo de Planejamento Estratégico na Administração Pública: implantação, controle e avaliação do processo de Planejamento Estratégico.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9155":{"codigo":"CAD9155","nome":"Gestão de Operações e Logística II","ementa":"Introdução a operações e à natureza do serviço. Operações de serviço. Sistemas e processos de serviço. Projeto e organização do posto de trabalho. Arranjo físico e fluxo. Localização de instalações. Gestão de filas. Gestão da capacidade e da demanda. Relacionamento com clientes e fornecedores. Melhoria operacional: produtividade, qualidade, garantia e recuperação de falhas. Planejamento e gestão da rede de operações e serviço.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9156":{"codigo":"CAD9156","nome":"Elaboração e Gestão de Projetos","ementa":"Planejamento e projeto: conceituação, Estruturas organizacionais voltadas para projeto. Habilidades de gerente de projetos. Equipes de projeto. Ciclos e fases do projeto: fluxo do processo. Definição do escopo do projeto. Identificação de restrições. Planejamento de recursos e estimativas. Definição dos controles de planejamento do projeto. Criação do plano de projeto. Avaliação e controle do desempenho do projeto. Planejamento, programa e controle de projetos e produtos especiais, produzidos sob encomenda. Métodos e técnicas utilizados na avaliação econômica e social de projetos. Avaliação do risco e do retorno dos projetos. Análise de custos futuros gerados pelo projeto. Aceleração de projetos. Organização geral. Aplicação de técnicas de Gantt, CPM, PERT\/TEMPO e PERT\/CUSTO. Uso de software para gerenciamento de projetos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9187":{"codigo":"CAD9187","nome":"Trabalho de Conclusão II","ementa":"","carga_horaria":75,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DIR9157":{"codigo":"DIR9157","nome":"Licitação, Contratos e Convênios","ementa":"Licitação: aspectos gerais, princípios constitucionais, dispensa e inexigibilidade, modalidades, pregão eletrônico e presencial, fases, revogação e invalidação, controle. Contratos: formalização, direitos e deveres, execução, alteração, inexecução, extinção, espécies, controle. Convênios: aspectos gerais, participantes, objeto, formalização, controle.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9003":{"codigo":"CAD9003","nome":"Seminário Temático III na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9158":{"codigo":"CAD9158","nome":"Negociação e Arbitragem","ementa":"Mediação e arbitragem: o marco regulatório brasileiro. Negociação: conceitos e princípios; o conflito; o negociador; o objeto; o lugar; os modelos e estilos; desenvolvimento da negociação; feedback. Arbitragem: retrospectiva histórica e o momento atual; conceito; a convenção e os tipos de arbitragem; o árbitro; a sentença arbitral.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9159":{"codigo":"CAD9159","nome":"Tecnologia e Inovação","ementa":"História da tecnologia. Conceitos fundamentais: ciência, tecnologia e inovação. Indicadores de Ciência, Tecnologia e Inovação. Principais condicionantes do processo de inovação tecnológica. Gestão da inovação tecnológica. Avaliação de projetos de P&D. Financiamento para a inovação no Brasil. Tecnologias convencionais e tecnologias sociais. Novas tecnologias e suas implicações sociais. As TICs em foco.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9160":{"codigo":"CAD9160","nome":"Gestão de Redes de Cooperação na Esfera Pública","ementa":"Conceito, gênese e tipos de redes, modelos de gestão e estruturas de redes públicas. Redes federativas e redes públicas de cooperação, redes comunitárias. Complementaridade e Supletividade nas redes híbridas.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9167":{"codigo":"CAD9167","nome":"Gestão de Regulação","ementa":"Direito e Economia da Regulação e da Concorrência; O Poder Regulatório do Estado e Concessão de Serviços Públicos; Políticas e Estrutura da Regulação no Brasil; Defesa do Consumidor; Defesa da Concorrência. O marco regulatório brasileiro: legislação, órgãos e entidades (nacionais, estaduais e municipais).","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9188":{"codigo":"CAD9188","nome":"Trabalho de Conclusão III","ementa":"","carga_horaria":75,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CCN9145":{"codigo":"CCN9145","nome":"Auditoria e Controladoria","ementa":"Probidade administrativa. Princípios e sistema de controle na administração pública. Controle social e transparência no Brasil. Fiscalização orçamentária, financeira, contábil e patrimonial do Estado. Organização e funcionamento do controle externo e interno na administração pública. Fluxo da gestão governamental (PPA, LDO, LOA). Conceitos de Auditoria Governamental. Tipos de Auditoria Governamental. Controles da Administração Pública. Elaboração de Relatório de Auditoria.","carga_horaria":60,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9004":{"codigo":"CAD9004","nome":"Seminário Temático IV na Linha de Formação Específica (LFE)","ementa":"","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9164":{"codigo":"CAD9164","nome":"Gestão Ambiental e Sustentabilidade","ementa":"A evolução da gestão ambiental; as políticas de comando e controle; conceitos e propostas para um desenvolvimento sustentável; a evolução da legislação ambiental; o novo papel dos Municípios, dos Estados e da União na gestão ambiental pública; o setor público como cliente e seu poder de compra; a Agenda Ambiental na Administração Pública (A3P); o desenvolvimento regional sustentável; as políticas do governo brasileiro frente aos acordos internacionais de proteção ambiental.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9165":{"codigo":"CAD9165","nome":"Relações Internacionais","ementa":"","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9166":{"codigo":"CAD9166","nome":"Gestão da Qualidade no Setor Público","ementa":"Considerações sobre o setor público. Qualidade: conceitos e princípios. Planejamento e controle da qualidade. Ferramentas. Melhoria em operações. Qualidade em serviços: projeto, desenho de processos, programação de serviços e controle de qualidade.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9168":{"codigo":"CAD9168","nome":"Políticas Públicas e Sociedade","ementa":"Introdução ao estudo das políticas públicas. Conceitos fundamentais: políticas públicas, público e privado, público e estatal, público e governamental. Estado, mercado e esfera pública. O Estado de Bem-estar Social, a formação da cidadania moderna e o desenvolvimento da democracia. Histórico do Estado de Bem-estar Social. Tipologias de Estados de Bem-estar Social. A formação da Agenda Pública. A questão da decisão e da não decisão. Modelos de decisão e o papel dos atores políticos: parlamentos, partidos políticos, grupos de interesse, estruturas institucionais e mídia. Implementação e avaliação das políticas públicas. Tendências das políticas públicas no início do Século XXI. Liberalismo, socialdemocracia e políticas públicas. O efeito da globalização para as políticas públicas. A participação da sociedade na decisão e acompanhamento da execução das políticas públicas: a gestão democrática. Relações Étnicos-Raciais e ensino de História e Cultura Afro-brasileira e Africana.","carga_horaria":60,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9189":{"codigo":"CAD9189","nome":"Trabalho de Conclusão IV","ementa":"","carga_horaria":75,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD9194":{"codigo":"CAD9194","nome":"Redação Oficial na Administração Pública","ementa":"caracteristicas do tezxto administratuivonemna linguagem oficial aplicadas na produçção de documentos e correspondencias oficiais e empresariais.","carga_horaria":60,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"CAD9185":{"codigo":"CAD9185","nome":"Atividades Complementares II","ementa":"","carga_horaria":120,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}}}}