{"codigo":503,"nome":"CIÊNCIA E TECNOLOGIA DE ALIMENTOS","sigla_centro":"CCA","sigla_departamento":"CAL","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20091":20091,"20241":20241},"situacao":0,"situacao_descricao":"regular","num_vagas_total":315,"num_vagas_primeiro_semestre":35,"num_vagas_segundo_semestre":35,"presencial":true,"curriculos":{"20091":{"id":"465","codigo":20091,"codigo_curso":503,"carga_horaria_ufsc":3996,"carga_horaria_mec":2400,"aulas_semana_min":14,"aulas_semana_esperado":10,"aulas_semana_max":40,"num_periodos_min":7,"num_periodos_esperado":9,"num_periodos_max":16,"descricao":"Referente ao curriculo 20091","ucs":{"BEG5112":{"codigo":"BEG5112","nome":"Biologia Celular Aplicada à Ciência e Tecnologia de Alimentos","ementa":"Níveis de organização da estrutura biológica. Organização geral das células procarióticas. Organização estrutural e funcional das células eucarióticas. Aspectos morfológicos, bioquímicos e funcionais das células. Integração morfo-funcional dos componentes celulares. Ciclo celular-Divisão celular.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"BEG5107","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5100":{"codigo":"CAL5100","nome":"Introdução a Ciências e Tecnologia de Alimentos","ementa":"Matérias-primas alimentares. História da industrialização de alimentos. Alimentos africanos e indígenas. Influência da colonização sobre os diferentes alimentos. Tipos de alimentos industrializados. Indústrias alimentícias. Principais processos empregados nas transformações de matérias-primas alimentares. Unidades e operações matemáticas de uso em Ciência e Tecnologia de Alimentos. Direitos humanos na cadeia agroalimentar.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"CAL5200","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3111":{"codigo":"MTM3111","nome":"Geometria  Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Algebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM5104 ou MTM5512","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3180":{"codigo":"MTM3180","nome":"Pré-Cálculo","ementa":"Aritmética básica; cálculo com expressões algébricas; geometria elementar; equações; funções.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3100 ou MTM7136","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5150":{"codigo":"QMC5150","nome":"Química Geral e Inorgânica","ementa":"Estrutura atômica e Tabela Periódica. Ligações Químicas. Reações Químicas e Estequiometria. Teoria Ácido-Base. Soluções. Elementos do Grupo Principal. Elementos de transição.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"QMC5152","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC7118":{"codigo":"FSC7118","nome":"Física para Ciências Agrárias","ementa":"Medidas Físicas. Vetores.Noções de Mecância.Mecânica dos Fluídos.Fenômenos térmicos. Tópicos de Eletricidade","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5061 ou FSC5064 ou FSC5071 ou FSC7303","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5226":{"codigo":"MOR5226","nome":"Morfologia Humana","ementa":"Anatomia: Introdução ao estudo da anatomia. Aparelho Locomotor. Sistema Nervoso. Sistema Circulatório (cardiovascular e linfático). Sistema Digestório. Sistema Urinário. Sistema Respiratório. Sistema Reprodutor (masculino e feminino). Sistema Endócrino.   \nHistologia: Noções de microscopia de luz e técnicas histológicas. Tecido Epitelial. Tecido Conjuntivo (e variações: ósseo, cartilaginoso e sangue). Tecido Muscular. Tecido Nervoso. Histologia dos Sistemas: cardiovascular, linfático, digestório, urinário, reprodutor e endócrino.","carga_horaria":108,"fase_sugestao":2,"equivalencia":"MOR5227 e MOR5228","prerequisito":"BEG5107 ou BEG5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3181":{"codigo":"MTM3181","nome":"Cálculo para Ciências Agrárias","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3101 ou MTM7136","prerequisito":"MTM3100 ou MTM3180","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5125":{"codigo":"QMC5125","nome":"Química Geral Experimental A","ementa":"Matéria. Conceitos gerais. Teoria atômica. Estrutura atômica. ConfiguraçãoEletrônica. Orbital Atômico. Ligações químicas: iônicas, covalentes, metálicas. Leis dos gases. Conceito de Mol. Funções químicas. Misturas. Soluções. Concentração de soluções. Equações químicas. Reações redox. Introdução ao Equilíbrio químico; ácidos ebases; ph. Calor de reação. Introdução á Termoquímica.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5304":{"codigo":"QMC5304","nome":"Química Analítica Teórica","ementa":"Introdução à Química Analítica. Equilíbrio ácido- base.Princípio da análise volumétrica. Titulações ácido-base. Equilíbrio de precipitação. Análise gravimétrica. Titulações de precipitações. Equilíbrio de formação de complexos. Titulações com EDTA. Equilíbrio de oxidação-redução. Titulações de oxidação-redução. Tratamento de dados analíticos. Atividade e coecifiente de atividade.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"QMC5302","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5407":{"codigo":"BEG5407","nome":"Genética Básica","ementa":"A base cromossômica da hereditariedade. Padrões de herança. Polimorfismos Genéticos. Herança Multifatorial. Noções de Nutrigenômica. Toxicogenética, mutagênese e carcinogênese. Epigenética. Aspectos da evolução humana.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"BEG5107 ou BEG5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA7005":{"codigo":"BQA7005","nome":"Bioquímica 02 - Básica","ementa":"Química e importância biológica de aminoácidos, proteínas, carboidratos e lipídios. Enzimas: cinética e inibição. Coenzimas. Energética bioquímica e visão geral do metabolismo. Metabolismo de carboidratos, lipídios, aminoácidos e proteínas. Ciclo do nitrogênio, fixação e assimilação. Fotossíntese e ciclo do carbono. Inter-relações e regulação metabólicas. Bases moleculares da expressão gênica.","carga_horaria":108,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIT5920":{"codigo":"FIT5920","nome":"Morfo - Fisiologia Vegetal","ementa":"Tecidos vegetais: meristema, parênquimas, esclerênquima, epiderme, floema e xilema. Estruturas: flor, fruto, semente, embrião, raiz, caule e folha. Regulações hídricas nas células e tecidos. Absorção de água. Fotossíntese e fotorrespiração. Transpiração. Crescimento vegetal: germinação, juvenilidade, floração, frutificação, maturidade e senescência. Dormência. Fatores de regulação endógena (fitormônios) e exógena (fotoperiodismo, temperatura, análogos de fitormônios) do crescimento e desenvolvimento vegetal..","carga_horaria":54,"fase_sugestao":3,"equivalencia":"FIT5930","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5222":{"codigo":"QMC5222","nome":"Química Orgânica Teórica A","ementa":"Fundamentos: estrutura, ligações, isomeria de compostos orgânicos, estereoquímica. Classificação de reagentes e reações. Métodos de obtenção, propriedades químicas e físicas de alcanos, alcenos, alcadienos, alcinos e cicloalcanos. Efeitos eletrônicos. Ressonância e aromaticidade. Benzeno e compostos aromáticos relacionados.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5307":{"codigo":"QMC5307","nome":"Química Analítica Experimental","ementa":"Equilíbrio de ácidos e bases fracos. Equilíbrio de complexação, precipitação e óxido-redução. Separação e reações analíticas de cátions e ânions. Análise gravimétrica. Titulação de neutralização, precipitação, complexação e óxido-redução. Análise de água. Análise de resíduos de mineração. Análise de minérios. Análise de ligas metálicas.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"QMC5310","prerequisito":"QMC5304","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZOT7108":{"codigo":"ZOT7108","nome":"Morfo - Fisiologia Animal","ementa":"Morfo- Fisiologia Animal: formas e funções das estruturas macro e microscópicas que compõem os órgãos e sistemas dos animais envolvidos na produção de alimentos. Anatomia e fisiologia dos sistemas e seus órgãos bem como da estrutura morfofuncional de tecidos e células que os compõem, com enfoque nas estruturas que são responsáveis pelos alimentos de origem animal: desenvolvimento e crescimento, homeostase e equilíbrio hidroeletrolítico (funções cardiovasculares, respiratória e excretória), funções de controle: sistema nervoso, sistema endócrino e neuroendócrino, importância do sistema digestório e a nutrição na produção animal, glândula mamária, sistema musculoesquelético de aves, bovinos e suínos, formação do ovo, vísceras consumidas como alimento.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5406":{"codigo":"CAL5406","nome":"Microbiologia de Alimentos I","ementa":"Microrganismos de interesse na ciência e tecnologia de alimentos. Microrganismos deteriorantes e patogênicos. Fatores que influem no crescimento e sobrevivência dos microrganismos em alimentos e processos produtivos. Controle de microrganismos em alimentos, ambientes, manipuladores e equipamentos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5155":{"codigo":"CFS5155","nome":"Fisiologia Humana para Ciência e Tecnologia de Alimentos","ementa":"Homeostase. Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas neuromuscular e neurovegetativo, sensorial, endócrino e digestório.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"BQA7005 e MOR5226","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NTR5100":{"codigo":"NTR5100","nome":"Princípios de Nutrição","ementa":"Conceitos básicos em Nutrição. Valor nutricional dos alimentos (proteínas, carboidratos, lipídeos, vitaminas, minerais e água). Guias alimentares. Necessidades e recomendações nutricionais. Biodisponibilidade de nutrientes. Principais doenças de origem nutricional no Brasil: causas e efeitos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"BQA7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5223":{"codigo":"QMC5223","nome":"Química Orgânica Teórica B","ementa":"Haletos de alquila. Substituição nucleofílica SN1 e SN2, aspectos cinéticos e estereoquímicos. Efeito de solvente em reações orgânicas. Reagentes organometálicos e aplicações em síntese. Álcoois, obtenção, reações e mecanismos. Éteres. Aldeídos e Cetonas. Adição nucleofílica à carbonila. Ácidos carboxílicos e seus derivados: sais, ésteres, haletos de acila, anidridos, reatividade e mecanismos. Aminas e Sais de Diazônio e suas aplicações em síntese.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"QMC5222","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5351":{"codigo":"QMC5351","nome":"Química Analítica Instrumental","ementa":"Condutimetria.Potenciometria. Espectroscopia de absorção mlecular no ultravioleta e visível. Espectrometria de absorção atômica. Espectrometria de emissão óptica por plasma indutivamente acoplado (ICP OES) e espectrometria de masssa com plasma indutivamente acoplado (ICP-MS). Fotometria de chama. Cromatografia gasosa. Cromatografia líquida de alta eficiência. Métodos térmicos de análise.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"QMC5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5451":{"codigo":"QMC5451","nome":"Físico-Química Aplicada a Ciência dos Alimentos","ementa":"Fundamentos de termodinâmica e termoquímica. Equilíbrio químico. Cinética Química. Catálise e cinética enzimática. Fundamentos de química de superfície aplicada a ciência dos alimentos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"MTM3181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5407":{"codigo":"CAL5407","nome":"Microbiologia de Alimentos II","ementa":"Biossegurança em laboratórios de microbiologia. Material e equipamentos. Lay-out de laboratórios de microbiologia. Métodos de referência e alternativos para ensaios microbiológicos em alimentos, água e processos produtivos. Amostragem. Pesquisa de microrganismos indicadores, deteriorantes e patogênicos. Ensaios microbiológicos de ambiente, superfícies, manipuladores e equipamentos. Legislação microbiológica de alimentos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"CAL5406","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5502":{"codigo":"CAL5502","nome":"Operações Unitárias Aplicadas aos Processos Agroindustriais","ementa":"Introdução aos fenômenos de transporte. Estática e dinâmica de fluídos. Transferência de calor e massa. Agitação e mistura de fluídos. Pasteurização, esterilização. Tipos de evaporadores e suas aplicações. Moagem. Extração. Separação de sólidos, líquidos e gases: tamização, destilação, centrifugação e filtração. Ciclo frigorífico, carga térmica, resfriamento e congelamento. Secagem de alimentos e tipos de secadores. Outras técnicas de condução e conservação.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"QMC5451","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5503":{"codigo":"CAL5503","nome":"Microscopia de Alimentos","ementa":"Princípios físicos e equipamentos para microscopia: ótica, eletrônica de varredura (MEV), eletrônica de transmissão (MET), de fluorescência. Preparação de amostras. Aplicação dos diferentes métodos na área de alimentos. Microestrutura vegetal. Pesquisa de substâncias estranhas e métodos de isolamento. Efeito do processamento na microestrutura dos alimentos.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5220":{"codigo":"QMC5220","nome":"Química Orgânica e Biológica A","ementa":"Estudo das principais classes de compostos de interesse biológico, mostrando sua ação nos sistemas vivos, visando proporcionar uma compreensão básica da dinâmica do metabolismo.","carga_horaria":90,"fase_sugestao":5,"equivalencia":"QMC5217 e QMC5218","prerequisito":"QMC5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5230":{"codigo":"QMC5230","nome":"Química Orgânica Experimental I","ementa":"Síntese e técnicas de purificação de substâncias orgânicas líquidas: Destilação simples e fracionada. Destilação por arraste de vapor. Síntese e técnicas de purificação de substâncias orgânicas sólidas: Recristalização e uso de carvão ativo. Técnicas de refluxo e utilização de Tubo Dean-Stark. Determinação de pureza de compostos orgânicos através de constantes físicas. Purificação de sólidos por sublimação. Técnicas e extração: líquido-líquido e Soxhlet Cromatografia: Camada delgada e coluna.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"QMC5232","prerequisito":"QMC5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1406":{"codigo":"ZZT1406","nome":"Disciplina Optativa Eletiva","ementa":"","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"CAL5401":{"codigo":"CAL5401","nome":"Bioquímica de Alimentos I","ementa":"Proteínas nos alimentos. Corantes. Água. Carboidratos nos alimentos. Vitaminas hidrossolúveis. Alimentos de origem animal e vegetal.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"QMC5220","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5504":{"codigo":"CAL5504","nome":"Biologia Molecular e Biotecnologia","ementa":"Estrutura dos ácidos nucléicos. Replicação do DNA. Transcrição e Síntese de proteínas. Seqüenciamento, análise comparativa dos genomas e análise de expressão. Tecnologia do DNA Recombinante. Métodos de isolamento, purificação e clonagem de genes.  Detecção de contaminantes e microrganismos. Expressão e purificação de proteínas recombinantes. Produção de Microrganismos e plantas GM. Métodos de detecção e quantificação de OGM. Exemplos de alimentos transgênicos. Legislação sobre OGM.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"BQA7005 e CAL5406","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5505":{"codigo":"CAL5505","nome":"Propriedade Física dos Alimentos","ementa":"Fluidos newtonianos e não-newtonianos. Equações constitucionais. Reometria de alimentos líquidos. Reologia de alimentos sólidos e semi-sólidos. Relação das propriedades físicas com a constituição molecular dos alimentos. Atividade de água. Isoterma de sorção e desorção de água. Propriedades mecânicas dos alimentos","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"QMC5451","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5506":{"codigo":"CAL5506","nome":"Análise Química dos Alimentos","ementa":"Composição básica dos produtos alimentícios. Mel, cereais e derivados. Óleos e gorduras, vegetais, manteiga, margarina. Carne e derivados. Pescados e derivados. Ovos e derivados. Leite e derivados. Bebidas alcoólicas (cerveja e vinho). Bebidas fermento destiladas (aguardentes, licores, aperitivos). Bebidas estimulantes (chá, café, cacau, chocolate, guaraná, mate). Condimentos e especiarias. Produtos de frutas e hortaliças. Sucos. Sal. Vinagre. Aditivos químicos. Água. Legislação.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"","prerequisito":"QMC5230 e QMC5351","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NTR5123":{"codigo":"NTR5123","nome":"Nutrição Experimental","ementa":"Métodos de investigação em Nutrição Experimental. Atividades de pesquisa no laboratório, aplicação de métodos químicos e biológicos para determinação do valor nutricional dos alimentos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"NTR5100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1408":{"codigo":"ZZT1408","nome":"Disciplina Optativa Eletiva","ementa":"","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"CAL5106":{"codigo":"CAL5106","nome":"Gestão da Qualidade na Indústria de Alimentos","ementa":"Qualidade hoje. Normas e padrões de qualidade. Gestão da qualidade. Características que afetam a qualidade. Moderno sistema de qualidade (Deming, Just in time). Implantação e segmento de sistemas de qualidade (qualidade\/produtividade). Avaliação da qualidade.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5124":{"codigo":"CAL5124","nome":"Tecnologia de Cereais","ementa":"Estruturas dos grãos e influência no processamento e produto final. Aspectos agronômicos: influência genética e ambiental. Composição química: Amido, proteína , fibra alimentar e ingredientes funcionais. Armazenamento, beneficiamento e moagem. Malte e Preparação de cerveja e destilados. Controle de qualidade. Legislação.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5402":{"codigo":"CAL5402","nome":"Bioquímica de Alimentos II","ementa":"Lipídios, oxidação, antioxidantes. Emulsões alimentares. Óleos e frituras, alterações. Vitaminas lipossolúveis. Enzimas em alimentos. Fermentação. Aditivos alimentares.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"QMC5220","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5408":{"codigo":"CAL5408","nome":"Análise Sensorial de Alimentos","ementa":"Noções básicas sobre percepção sensorial. Perfil de características sensoriais de um alimento: sabor, odor, cor, textura. Análise comparativa dos atributos sensoriais de um alimento. Aceitabilidade preferencial, equipamentos, seleção e treinamento de degustadores. Organização do painel de testes. Testes mais  comuns, técnicas especiais. Apresentação dos resultados, análise estatística dos testes.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5410":{"codigo":"CAL5410","nome":"Análise de Substâncias Tóxicas e Outros Contaminantes Alimentares","ementa":"Substâncias tóxicas naturais: Micotoxinas: aflatoxinas, ocratoxinas, zearalenona, esterigmatocistina, toxinas do ergot, citrinina, tricotecenos. Ficotoxinas. Outras toxinas. Substância tóxicas sintéticas: Agrotóxicos, metais pesados, aditivos como contaminantes alimentares. Contaminantes em produtos de origem animal: antibióticos, hormônios e outros. Metodologia de análise.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5506","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5507":{"codigo":"CAL5507","nome":"Processos Fermentativos e Bioprocessos","ementa":"Histórico, conceitos e considerações sobre substâncias obtidas por fermentação. Aspectos de microbiologia dos processos fermentativos (necessidades nutricionais dos microrganismos). Formulação de meios de crescimento. Aspectos bioquímicos dos microrganismos. Cinética de crescimento microbiano. Fermentadores e métodos de fermentação. Processos envolvendo anaerobiose e respiração. Desinfecção e esterilização dos fermentadores e meios de cultivo. Substratos renováveis e não-renováveis. Proteínas uni e pluricelulares. Leveduras de panificação. Cultivos iniciadores para fermentação lática de produtos agroindustriais. Instalações industriais.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5109":{"codigo":"CAL5109","nome":"Tecnologia de Carnes e Derivados","ementa":"Carnes, conceito e estrutura. Abatedouros. Processos industriais: salga; defumação; cozimento; processos mistos e conservas. Salsichas. Fiambres. Curados. Embalagens de produtos cárnicos. Estocagem e armazenamento. Processamento de sub-produtos.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5110":{"codigo":"CAL5110","nome":"Tecnologia de Leite e Derivados","ementa":"Considerações sobre leite. Necessidades básicas, detalhes de uma indústria de laticínios. Matéria-prima para indústria de laticínios. Flora microbiana do leite. Processamento do leite `in natura`. Transporte e distribuição. Fabricação de queijos, doces, produtos lácteos fermentados, manteiga, cremes, produtos lácteos concentrados e desidratados.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5111":{"codigo":"CAL5111","nome":"Tecnologia de Frutas e Hortaliças","ementa":"Transporte. Recepção de matéria-prima, limpeza e seleção (pré-processamento). Processos produtivos de derivados de frutas e hortaliças - sucos concentrados, frutas, geléias, doces em pasta, conservas, desidratados. Processamento de doces e conservas. Cálculo do binômio tempo-temperatura na pasteurização e esterilização. Embalagens. Equipamentos, instalações industriais. Higiene e sanitização. Aproveitamento de sub-produtos. Legislação.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5112":{"codigo":"CAL5112","nome":"Tecnologia de Pescado e Derivados","ementa":"Processos de preservação de pescados. Sistemas de sanificação e controle de qualidade em indústrias de pescados. Inspeção e legislação sanitária. Transporte, distribuição e comercialização de pescados.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5125":{"codigo":"CAL5125","nome":"Tecnologia de Óleos e Gorduras","ementa":"Matérias-primas oleaginosas. Composição de óleos e gorduras: ácidos graxos, triglicerídios, compostos minoritários. Processamentos de óleos e gorduras: Preparação de matérias-primas. Extração, degomagem, neutralização, clarificação, desodorização. Modificação de óleos e gorduras: hidrogenação, interesterificação e fracionamento. Gorduras especiais. Oxidação de óleos e gorduras. Análises de óleos e gorduras.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5508":{"codigo":"CAL5508","nome":"Planejamento e Projeto Agroindustrial","ementa":"Aplicação dos princípios tecnológicos gerais da ciência de alimentos, adquiridos nas diversas disciplinas do curso, para o desenvolvimento de um produto\/processo alimentício alternativo, englobando o delineamento de suas características, a pesquisa de ingredientes e da tecnologia de produção e o estudo da aceitação do novo produto pelo consumidor.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5530":{"codigo":"CAL5530","nome":"Trabalho de Conclusão de Curso","ementa":"O trabalho de conclusão de curso, de caráter interdisciplinar, deverá ser elaborado a partir de um projeto orientado por professor do curso ou da Universidade  Federal de Santa Catarina (UFSC), estruturado de acordo com normas técnicas da ABNT e apresentado perante uma banca.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5401 e CAL5402 e CAL5407 e CAL5408 e CAL5502 e CAL5504 e CAL5505 e CAL5506","prerequisito_criterio_id":0,"prerequisito_carga_horaria":288,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1407":{"codigo":"ZZT1407","nome":"Disciplina Optativa Eletiva","ementa":"","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"CAL5130":{"codigo":"CAL5130","nome":"Estágio Supervisionado","ementa":"Atividades exercidas em empresas ou em laboratórios de Departamentos do Curso, promovendo um amadurecimento profissional pela vivência, experimentação e solução de problemas ou desenvolvimento de produtos.","carga_horaria":720,"fase_sugestao":9,"equivalencia":"","prerequisito":"CAL5109 e CAL5110 e CAL5112 e CAL5125 e CAL5508 e CAL5530","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AQI7001":{"codigo":"AQI7001","nome":"Maricultura","ementa":"Histórico e importância. Principais espécies cultivadas e países produtores. Sistemas de produção. Etapas e técnicas de cultivo. Cultivo de espécies nativas. Cultivo de espécies exóticas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AQI7002":{"codigo":"AQI7002","nome":"Piscicultura de Águas Continentais","ementa":"História da psicultura continental. Policultivo. Consorciação. Métodos aplicados na reprodução artificial de peixes. Técnicas de larvicultura e alevinagem das espécies comerciais. Técnicas de melhoramento genético aplicadas a psicultura. Principais espécies cultivas, métodos e sistemas utilizados. Cultivo em tanques-rede. Predadores, parasitas e doenças de peixes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD5240":{"codigo":"CAD5240","nome":"Aspectos Comportamentais do Empreendedor","ementa":"Conceito de empreendedorismo. A formação da Personalidade. O Processo comportamental. Fatores de sucesso, o perfil do empreendedor. Desenvolvimento de habilidades empreendedoras.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5129":{"codigo":"CAL5129","nome":"Planej. de Est. Curric. Superv. e TCC Aplic. à C. e Tec. de Alimentos","ementa":"Elaboração de projeto de pesquisa, extensão e estágio. Elaboração de metas e objetivos. Revisão de produção científica. Técnicas de elaboração de monografias e apresentação pública.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5509":{"codigo":"CAL5509","nome":"Higiene e Sanitização de Alimentos","ementa":"Importância e objetivos do controle de sanificação. Práticas de higiene e sanificação na indústria de alimentos. Testes de eficácia de sanificantes. Agentes e métodos de limpeza aplicados a alimentos. Legislação.  PPHO, BPF e APPCC.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5406","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5510":{"codigo":"CAL5510","nome":"Tecnologia de Amidos","ementa":"matérias-primas amiláceas, métodos de extração, estrutura e caracterização dos grânulos de amido. Amidos modificados. Aplicações de amidos nativos e modificados na agroindústria.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5511":{"codigo":"CAL5511","nome":"Garantia e Sistemas de Qualidade para Laboratórios e Indústrias de Alimentos","ementa":"Normas e padrões da qualidade. Gestão da qualidade, implantação e acompanhamento de sistemas de qualidade, avaliação da qualidade. Programas ISO.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5406","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5512":{"codigo":"CAL5512","nome":"Toxicologia de Alimentos","ementa":"Histórico. Conceitos de toxicologia, agente tóxico, toxicidade e intoxicação. Exposição e vias de introdução. Toxicidade: absorção, distribuição, armazenamento, biotransformação e eliminação. Toxicodinâmica: principais mecanismos de interação agente-paciente. Alimentos naturalmente tóxicos. Alimentos contaminados acidental e intencionalmente. Micotoxinas. Aditivos químicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5513":{"codigo":"CAL5513","nome":"Tecnologia de Panificação","ementa":"Processos de panificação e fabricação de pães, bolachas, biscoitos e massas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5514":{"codigo":"CAL5514","nome":"Tecnologia de Bebidas","ementa":"Fermentados alcoólicos: vinhos, aguardentes, cerveja. Bebidas fermento-destiladas. Bebidas fermento-destilo-retificadas. Bebidas compostas. Fermentação acética. Bebidas carbonatadas não-alcoólicas. Instalações industriais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5515":{"codigo":"CAL5515","nome":"Tratamento de Resíduos Agroindustriais","ementa":"O problema da poluição ambiental. Processos físicos e químicos para o tratamento de água para fins industriais e de abastecimento. Fluxograma de Estação de tratamento de água (ETA). Classificação das agroindústrias conforme o resíduo gerado, segundo a legislação vigente. Identificação e caracterização dos principais efluentes e resíduos gerados nas atividades agroindustriais. Conhecimentos e conceituação das propriedades físicas, químicas e biológicas dos efluentes agroindustriais. Tecnologias adequadas ao tratamento de águas residuárias. Tecnologias adequadas para o minimização, tratamento e disposição dos resíduos sólidos. Análise e discussão de alternativas para reciclagem de águas e resíduos sólidos agroindustriais. Certificação ambiental. Impacto Ambiental.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5516":{"codigo":"CAL5516","nome":"Embalagem de Alimentos","ementa":"Fatores que afetam a qualidade dos alimentos. Funções básicas das embalagens. Classificação das embalagens. Principais tipos de materiais de embalagens. Processo de fabricação. Interação alimento- embalagem: corrosão de componentes. Tecnologia de envasilhamento. Vida de prateleira. Embalagens para os diferentes tipos de alimento. Novas tecnologias de embalagem. Legislação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5517":{"codigo":"CAL5517","nome":"Alimentos Funcionais","ementa":"Conceito de alimento funcional e nutracêutico. Legislação brasileira e mundial. Proteína de soja e isoflavonas. Fibras alimentares. Ácidos graxos poli-insaturados de cadeia longa (EPA e DHA). Alho e óleo de alho. Uva e suco de uvas (catequina, epicatequina, revertrol e proantocianidinas). Limoneno, licopeno, alicina. Produtos lácteos pré-bióticos e pró-bióticos. Isocianatos e indoles (brócolis, couve-flor, couve-de-bruxelas, repolho, agrião, nabo e rabanete). Clorofila. Vitaminas e efeito antioxidante.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5518":{"codigo":"CAL5518","nome":"Desenvolvimento e Registro de Produtos","ementa":"Matéria-prima e formulação, operações unitárias envolvidas, resíduos, embalagem, estimativa de rendimento e custo. Desenvolvimento de produto, composição química, rotulagem e registro.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5519":{"codigo":"CAL5519","nome":"Qualidade de Águas","ementa":"Distribuição das águas. Parâmetros indicadores de qualidade das águas. Classificação dos corpos d´água segundo as suas características físico-químicas. Legislação ambiental relacionada à qualidade de águas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5520":{"codigo":"CAL5520","nome":"Tecnologias Limpas na Agroindústria","ementa":"Conceitos e procedimentos que permitam o emprego da Tecnologia Limpa como ferramenta para a minimização de resíduos, geração de novos produtos e valorização de resíduos agroindustriais. Análise de ciclo de vida do produto. Integração multidisciplinar no sentido da geração de matérias-primas e de processos ecologicamente corretos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5521":{"codigo":"CAL5521","nome":"Armazenagem de Grãos","ementa":"Estrutura brasileira de armazenagem de grãos. Fatores que influenciam a qualidade dos grãos armazenados. Fundamentos e manejo da aeração e termometria. Propriedades do ar úmido. Equilíbrio higroscópio. Psicrometria. Secagem de grãos. Secadores. Manutenção de máquinas e equipamentos. Racionalização do uso de energia em unidades armazenadoras. Pragas de grãos armazenados e formas de controle. Deterioração fúngica. Armazenamento Convencional e a Granel Prevenção de acidentes em unidades armazenadoras.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5531":{"codigo":"CAL5531","nome":"Atividades Complementares I","ementa":"Atividades extraclasses, realizadas a partir da primeira fase e validadas na oitava fase, como estágios não obrigatórios, trabalhos de iniciação científica, participação em eventos, publicações em periódicos, monitorias, gestão de empresa júnior, entre outras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5541":{"codigo":"CAL5541","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5542":{"codigo":"CAL5542","nome":"Programa de Intercâmbio II","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5541","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5543":{"codigo":"CAL5543","nome":"Programa de Intercâmbio III","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5551":{"codigo":"CAL5551","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos I","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do  curso.","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5552":{"codigo":"CAL5552","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos II","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do curso.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5553":{"codigo":"CAL5553","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos III","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do  curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5554":{"codigo":"CAL5554","nome":"História dos Alimentos e da Alimentação","ementa":"O mundo pré-histórico, os hominídeos e seus hábitos alimentares. O surgimento do Homo sapiens e sua alimentação. Os caçadores-coletores e sua dieta. O domínio do fogo. Uso precoce dos grãos. O nascimento da agricultura. A história da cerveja, do pão e do vinho. A domesticação dos animais. A história da carne, dos produtos lácteos. A história dos produtos do mar. A história de raízes e vegetais. A expansão do mundo e o papel das especiarias, a história do açúcar, do chá e do café. A revolução da batata. O mundo moderno e a alimentação como manifestação cultural e filosófica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EXR6000":{"codigo":"EXR6000","nome":"Ciência, Tecnologia e Saberes na Agricultura","ementa":"Compreensão das interfaces entre ciência, tecnologia e saberes. Mudança tecnológica. Transição sócio técnica. Sistema \nagroalimentar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EXR7402":{"codigo":"EXR7402","nome":"Legislação Agrária, Gestão e Planejamento Ambiental","ementa":"Desenvolvimento integrado. Legislação agrária. Base legal e legislação para a gestão ambiental. Auditoria ambiental. Controle de qualidade ambiental. Planejamento e o enfoque ambiental.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5921":{"codigo":"FIT5921","nome":"Botânica Aplicada a Ciência e Tecnologia de Alimentos","ementa":"Introdução à botânica. Conceitos e métodos taxonômicos. Nomenclatura botânica. Principais táxons de plantas de interesse para alimentos. Vegetação e flora regional. Usos, extrativismo e manejo de espécies da flora regional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5922":{"codigo":"FIT5922","nome":"Plantas Condimentares e Medicinais","ementa":"Histórico, importância econômica, social e aspectos de mercado. Origem das espécies, botânica e quimiotaxinomia, cultivares, produção in vivo e in vitro de biomassa, efeito de fatores climáticos e de manejo em pré e pós-colheita sobre a composição química do produto final, colheita, processamento, embalagem e comercialização das principais espécies condimentares e medicinais. Elaboração de projetos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5923":{"codigo":"FIT5923","nome":"Nutrigenômica e Metabolômica","ementa":"Histórico, importância social e econômica de hábitos alimentares, nitrigenética e epigenômica nutricional. Dieta e patafisiologia (câncer, doenças cardiovasculares e diabetes). Metabólitos secundários de interesse à saúde humana em alimentos. Métodos de estudo em nutrigenômica e metabolômica de alimentos. Desenvolvimento de produtos e estudo de mercado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5924":{"codigo":"FIT5924","nome":"Tecnologia de Produção de Frutas","ementa":"Importância econômica e social, origem, botânica, cultivares, climas, propagação, tratos culturais, colheita, fisiologia pós-colheita, conservação, comercialização e industrialização das principais fruteiras de clima temperado, sub-tropical e tropical produzidas no Brasil, com ênfase à bananicultura, citricultura, abacaxicultura, cultura do maracujá, frutas de caroço (pessegueiro, ameixeira), videira, quivizeiro, macieira e pereira. 54horas\/aula","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5925":{"codigo":"FIT5925","nome":"Patologia Pós-Colheita","ementa":"Conceito e importância da patologia pós-colheita. Perdas durante armazenamento, transporte, comercialização e uso final. Impacto sócio econômico de perdas pós-colheita causadas por microrganismos. Perda na qualidade nutricional dos produtos colonizados por fungos e bactérias. Mecanismos de infecção e colonização. Fisiologia de doenças pós-colheita. Doenças pós-colheita de frutos tropicais e temperados. Doenças de tubérculos e raízes. Deterioração fúngica de grãos e seus derivados. Estratégias de controle.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5926":{"codigo":"FIT5926","nome":"Matérias Primas Agropecuárias","ementa":"Nomenclatura dos produtos agropecuários. Fontes de produção e mercados de consumo. Características agronômicas das culturas. Princípios de fisiologia. Principais pragas e moléstias dos produtos. Economia e planejamento da produção agropecuária. Morfologia e classificação comercial. Embalagem e transporte de matérias primas. 54horas\/aula.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ZOT7804":{"codigo":"ZOT7804","nome":"Apicultura","ementa":"Biologia e evolução das abelhas. Interação abelhas e o ambiente. Formação e manejo de apiários para produção e extração de produtos apícolas. A polinização de culturas de interesse zootécnico. Instalações, equipamentos, e indumentárias usadas na apicultura. Cuidados, higiene e profilaxia apícola","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ZOT7808":{"codigo":"ZOT7808","nome":"Avicultura","ementa":"Avicultura de corte no Brasil e no Mundo. Produção de matrizes e pintos de um dia. Manejo alimentar, sanitário e de instalações para produção de frangos de corte. Avicultura de postura no Brasil e no Mundo. Produção de matrizes para postura. Produção de ovos comerciais. Incubatório. Produção de aves: Origem, evolução, manejo reprodutivo, alimentar, sanitário e de instalações. Avicultura e seus impactos ambientais. Produção de aves de corte e\/ou de postura ambientalmente sustentáveis. Raças, alimentação, sanidade, instalações, equipamentos e manejo voltados a produção avícola sustentável. Inserção do pequeno avicultor no agronegócio.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ZOT7809":{"codigo":"ZOT7809","nome":"Suinocultura","ementa":"Os impactos da suinocultura nos ecossistemas do Estado de Santa Catarina. Sistemas de produção de suínos ambientalmente sustentáveis. Raças, alimentação, sanidade, instalações, equipamentos e manejo voltados à suinocultura ecologicamente corretos. Inserção do pequeno suinocultor no agronegócio.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ZOT7811":{"codigo":"ZOT7811","nome":"Bovinocultura","ementa":"Importância Situação e perspectiva da Bovinocultura de corte Raças européias, zebuínas e nacionais Manejo reprodutivo, alimentar e de instalações para gado de corte (cria, recria e terminação) Bovinocultura de corte a base de pasto Raças adaptadas, crescimento, desenvolvimento e produção de carne com certificação de origem Prática de manejo e alternativas alimentares para a produção etológica e ecologicamente sustentável Instalações e equipamentos adequados a este sistema de produção Planejamento da criação","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20241":{"id":"656","codigo":20241,"codigo_curso":503,"carga_horaria_ufsc":3852,"carga_horaria_mec":3210,"aulas_semana_min":14,"aulas_semana_esperado":30,"aulas_semana_max":40,"num_periodos_min":7,"num_periodos_esperado":8,"num_periodos_max":16,"descricao":"Currículo referente a 20241","ucs":{"BEG5112":{"codigo":"BEG5112","nome":"Biologia Celular Aplicada à Ciência e Tecnologia de Alimentos","ementa":"Níveis de organização da estrutura biológica. Organização geral das células procarióticas. Organização estrutural e funcional das células eucarióticas. Aspectos morfológicos, bioquímicos e funcionais das células. Integração morfo-funcional dos componentes celulares. Ciclo celular-Divisão celular.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"BEG5107","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5200":{"codigo":"CAL5200","nome":"Introdução à Ciência e Tecnologia de Alimentos","ementa":"Apresentação do Curso de Ciência e Tecnologia de Alimentos. Perfil profissional do Cientista de Alimentos. CTA e sociedade. Direitos humanos na cadeia agroalimentar. Matérias-primas alimentares e principais processos empregados nas transformações de matérias-primas alimentares.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"CAL5100","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FIT5930":{"codigo":"FIT5930","nome":"Morfo - Fisiologia Vegetal","ementa":"Tecidos vegetais: meristemas, parênquimas, esclerênquima, epiderme, floema e xilema. Estruturas: flor, fruto, semente, embrião, raiz, caule e folha. Regulações hídricas nas células e tecidos. Absorção de água. Fotossíntese e fotorrespiração. Transpiração. Crescimento vegetal: germinação, juvenilidade, floração, frutificação, maturidade e senescência. Dormência. Fatores de regulação endógena (fito reguladores) e exógena (fotoperiodismo, temperatura, análogos de fitoreguladores) do crescimento e desenvolvimento vegetal. Sistemas Agrícolas: intensivo e extensivo e suas características.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"FIT5920","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3180":{"codigo":"MTM3180","nome":"Pré-Cálculo","ementa":"Aritmética básica; cálculo com expressões algébricas; geometria elementar; equações; funções.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3100 ou MTM7136","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5150":{"codigo":"QMC5150","nome":"Química Geral e Inorgânica","ementa":"Estrutura atômica e Tabela Periódica. Ligações Químicas. Reações Químicas e Estequiometria. Teoria Ácido-Base. Soluções. Elementos do Grupo Principal. Elementos de transição.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"QMC5152","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5554":{"codigo":"CAL5554","nome":"História dos Alimentos e da Alimentação","ementa":"O mundo pré-histórico, os hominídeos e seus hábitos alimentares. O surgimento do Homo sapiens e sua alimentação. Os caçadores-coletores e sua dieta. O domínio do fogo. Uso precoce dos grãos. O nascimento da agricultura. A história da cerveja, do pão e do vinho. A domesticação dos animais. A história da carne, dos produtos lácteos. A história dos produtos do mar. A história de raízes e vegetais. A expansão do mundo e o papel das especiarias, a história do açúcar, do chá e do café. A revolução da batata. O mundo moderno e a alimentação como manifestação cultural e filosófica.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC7118":{"codigo":"FSC7118","nome":"Física para Ciências Agrárias","ementa":"Medidas Físicas. Vetores.Noções de Mecância.Mecânica dos Fluídos.Fenômenos térmicos. Tópicos de Eletricidade","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5061 ou FSC5064 ou FSC5071 ou FSC7303","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5226":{"codigo":"MOR5226","nome":"Morfologia Humana","ementa":"Anatomia: Introdução ao estudo da anatomia. Aparelho Locomotor. Sistema Nervoso. Sistema Circulatório (cardiovascular e linfático). Sistema Digestório. Sistema Urinário. Sistema Respiratório. Sistema Reprodutor (masculino e feminino). Sistema Endócrino.   \nHistologia: Noções de microscopia de luz e técnicas histológicas. Tecido Epitelial. Tecido Conjuntivo (e variações: ósseo, cartilaginoso e sangue). Tecido Muscular. Tecido Nervoso. Histologia dos Sistemas: cardiovascular, linfático, digestório, urinário, reprodutor e endócrino.","carga_horaria":108,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5227":{"codigo":"MOR5227","nome":"Anatomia","ementa":"Introdução ao estudo da anatomia. Aparelho Locomotor. Sistema Nervoso. Sistema Circulatório\n(cardiovascular e linfático). Sistema Digestório. Sistema Urinário. Sistema Respiratório. Sistema\nReprodutor (masculino e feminino). Sistema Endócrino.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"MOR5226","prerequisito":"BEG5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5228":{"codigo":"MOR5228","nome":"Histologia","ementa":"Noções de microscopia de luz e técnicas histológicas. Tecido Epitelial. Tecido Conjuntivo (e variações:\nósseo, cartilaginoso e sangue). Tecido Muscular. Tecido Nervoso. Histologia dos Sistemas:\ncardiovascular, linfático, digestório, urinário, reprodutor e endócrino.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"MOR5226","prerequisito":"BEG5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3181":{"codigo":"MTM3181","nome":"Cálculo para Ciências Agrárias","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3101 ou MTM7136","prerequisito":"MTM3180","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5125":{"codigo":"QMC5125","nome":"Química Geral Experimental A","ementa":"Matéria. Conceitos gerais. Teoria atômica. Estrutura atômica. ConfiguraçãoEletrônica. Orbital Atômico. Ligações químicas: iônicas, covalentes, metálicas. Leis dos gases. Conceito de Mol. Funções químicas. Misturas. Soluções. Concentração de soluções. Equações químicas. Reações redox. Introdução ao Equilíbrio químico; ácidos ebases; ph. Calor de reação. Introdução á Termoquímica.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5222":{"codigo":"QMC5222","nome":"Química Orgânica Teórica A","ementa":"Fundamentos: estrutura, ligações, isomeria de compostos orgânicos, estereoquímica. Classificação de reagentes e reações. Métodos de obtenção, propriedades químicas e físicas de alcanos, alcenos, alcadienos, alcinos e cicloalcanos. Efeitos eletrônicos. Ressonância e aromaticidade. Benzeno e compostos aromáticos relacionados.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA7005":{"codigo":"BQA7005","nome":"Bioquímica 02 - Básica","ementa":"Química e importância biológica de aminoácidos, proteínas, carboidratos e lipídios. Enzimas: cinética e inibição. Coenzimas. Energética bioquímica e visão geral do metabolismo. Metabolismo de carboidratos, lipídios, aminoácidos e proteínas. Ciclo do nitrogênio, fixação e assimilação. Fotossíntese e ciclo do carbono. Inter-relações e regulação metabólicas. Bases moleculares da expressão gênica.","carga_horaria":108,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5503":{"codigo":"CAL5503","nome":"Microscopia de Alimentos","ementa":"Princípios físicos e equipamentos para microscopia: ótica, eletrônica de varredura (MEV), eletrônica de transmissão (MET), de fluorescência. Preparação de amostras. Aplicação dos diferentes métodos na área de alimentos. Microestrutura vegetal. Pesquisa de substâncias estranhas e métodos de isolamento. Efeito do processamento na microestrutura dos alimentos.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"MOR5228","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5223":{"codigo":"QMC5223","nome":"Química Orgânica Teórica B","ementa":"Haletos de alquila. Substituição nucleofílica SN1 e SN2, aspectos cinéticos e estereoquímicos. Efeito de solvente em reações orgânicas. Reagentes organometálicos e aplicações em síntese. Álcoois, obtenção, reações e mecanismos. Éteres. Aldeídos e Cetonas. Adição nucleofílica à carbonila. Ácidos carboxílicos e seus derivados: sais, ésteres, haletos de acila, anidridos, reatividade e mecanismos. Aminas e Sais de Diazônio e suas aplicações em síntese.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"QMC5222","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5304":{"codigo":"QMC5304","nome":"Química Analítica Teórica","ementa":"Introdução à Química Analítica. Equilíbrio ácido- base.Princípio da análise volumétrica. Titulações ácido-base. Equilíbrio de precipitação. Análise gravimétrica. Titulações de precipitações. Equilíbrio de formação de complexos. Titulações com EDTA. Equilíbrio de oxidação-redução. Titulações de oxidação-redução. Tratamento de dados analíticos. Atividade e coecifiente de atividade.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"QMC5302","prerequisito":"QMC5150","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZOT7118":{"codigo":"ZOT7118","nome":"Produção Animal para Ciência e Tecnologia de Alimentos","ementa":"Anatomia, fisiologia, estrutura morfofuncional dos sistemas, órgãos, tecidos e células responsáveis pela origem de alimentos: sistema digestório, sistema músculo esquelético, glândula mamária, controle neuroendócrino, formação do ovo, fisiologia do estresse. Criação de aves, suínos, bovinos e pequenos ruminantes com abordagem das características de forma e função de cada espécie. Nutrição animal e aproveitamento dos nutrientes da dieta para formação de leite, carne e ovos. Vísceras consumidas como alimento. Conceitos de bem-estar animal, introdução aos sistemas de produção animal e suas influências na qualidade do alimento (leite, carne e ovos). Apicultura e produção de mel.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"ZOT7108","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5003":{"codigo":"CAL5003","nome":"Microbiologia para Ciência e Tecnologia de Alimentos","ementa":"Importância da microbiologia de alimentos. Fatores que controlam o desenvolvimento de microrganismos nos alimentos. Microrganismos indicadores, patogênicos e deteriorantes de interesse na indústria de alimentos. Controle do desenvolvimento microbiano em alimentos. Gerenciamento de risco microbiológico. Ensaios microbiológicos de alimentos, superfícies e manipuladores. Legislação microbiológica de alimentos.","carga_horaria":108,"fase_sugestao":4,"equivalencia":"","prerequisito":"BEG5112 e BQA7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CFS5155":{"codigo":"CFS5155","nome":"Fisiologia Humana para Ciência e Tecnologia de Alimentos","ementa":"Homeostase. Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas neuromuscular e neurovegetativo, sensorial, endócrino e digestório.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"BQA7005 e MOR5227 e MOR5228","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5230":{"codigo":"QMC5230","nome":"Química Orgânica Experimental I","ementa":"Síntese e técnicas de purificação de substâncias orgânicas líquidas: Destilação simples e fracionada. Destilação por arraste de vapor. Síntese e técnicas de purificação de substâncias orgânicas sólidas: Recristalização e uso de carvão ativo. Técnicas de refluxo e utilização de Tubo Dean-Stark. Determinação de pureza de compostos orgânicos através de constantes físicas. Purificação de sólidos por sublimação. Técnicas e extração: líquido-líquido e Soxhlet Cromatografia: Camada delgada e coluna.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"QMC5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5238":{"codigo":"QMC5238","nome":"Química Orgânica Biológica","ementa":"Estrutura, propriedades físicas e químicas das principais classes de biomoléculas: Carboidratos, Lipídeos, Ácidos Nuclêicos, Aminoácidos, Peptídeos, Proteínas e Enzimas. Reatividade: Biossíntese e aplicações em síntese orgânica. Reações enzimáticas e ciclos metabólicos de Carboidratos, Lipídeos e Proteínas.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"QMC5220","prerequisito":"QMC5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5307":{"codigo":"QMC5307","nome":"Química Analítica Experimental","ementa":"Equilíbrio de ácidos e bases fracos. Equilíbrio de complexação, precipitação e óxido-redução. Separação e reações analíticas de cátions e ânions. Análise gravimétrica. Titulação de neutralização, precipitação, complexação e óxido-redução. Análise de água. Análise de resíduos de mineração. Análise de minérios. Análise de ligas metálicas.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"QMC5304","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5451":{"codigo":"QMC5451","nome":"Físico-Química Aplicada a Ciência dos Alimentos","ementa":"Fundamentos de termodinâmica e termoquímica. Equilíbrio químico. Cinética Química. Catálise e cinética enzimática. Fundamentos de química de superfície aplicada a ciência dos alimentos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"MTM3181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5461":{"codigo":"QMC5461","nome":"Físico-Química Aplicada a Ciência dos Alimentos","ementa":"Fundamentos de termodinâmica e termoquímica. Equilíbrio químico. Equilíbrio de Fases de Substâncias Puras.\nCinética Química. Catálise e cinética enzimática. Fundamentos de química de superfície aplicada a ciência dos\nalimentos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"QMC5451","prerequisito":"MTM3181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5004":{"codigo":"CAL5004","nome":"Higiene e Sanitização na Indústria de Alimentos","ementa":"Conceitos básicos de Higiene Alimentar. Requisitos higiênicos nas indústrias de alimentos. Agentes, \nprocessos e avaliação de limpeza e sanitização. Qualidade da água. Procedimentos Padrões de \nHigienização Operacional (PPHO). Procedimentos Operacionais Padronizados (POPs). Boas Práticas de \nFabricação (BPF) e Análise de Perigos e Pontos Críticos de Controle (APPCC).","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"CAL5003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5401":{"codigo":"CAL5401","nome":"Bioquímica de Alimentos I","ementa":"Proteínas nos alimentos. Corantes. Água. Carboidratos nos alimentos. Vitaminas hidrossolúveis. Alimentos de origem animal e vegetal.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5421":{"codigo":"CAL5421","nome":"Bioquímica de Alimentos I","ementa":"Água. Carboidratos nos alimentos. Proteínas nos alimentos. Pigmentos Naturais. Vitaminas hidrossolúveis. Composição química e transformações bioquímicas de alimentos de origem animal e vegetal.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"CAL5401","prerequisito":"QMC5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5504":{"codigo":"CAL5504","nome":"Biologia Molecular e Biotecnologia","ementa":"Estrutura dos ácidos nucléicos. Replicação do DNA. Transcrição e Síntese de proteínas. Seqüenciamento, análise comparativa dos genomas e análise de expressão. Tecnologia do DNA Recombinante. Métodos de isolamento, purificação e clonagem de genes.  Detecção de contaminantes e microrganismos. Expressão e purificação de proteínas recombinantes. Produção de Microrganismos e plantas GM. Métodos de detecção e quantificação de OGM. Exemplos de alimentos transgênicos. Legislação sobre OGM.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"BQA7005 e CAL5003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5505":{"codigo":"CAL5505","nome":"Propriedade Física dos Alimentos","ementa":"Fluidos newtonianos e não-newtonianos. Equações constitucionais. Reometria de alimentos líquidos. Reologia de alimentos sólidos e semi-sólidos. Relação das propriedades físicas com a constituição molecular dos alimentos. Atividade de água. Isoterma de sorção e desorção de água. Propriedades mecânicas dos alimentos","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5507":{"codigo":"CAL5507","nome":"Processos Fermentativos e Bioprocessos","ementa":"Histórico, conceitos e considerações sobre substâncias obtidas por fermentação. Aspectos de microbiologia dos processos fermentativos (necessidades nutricionais dos microrganismos). Formulação de meios de crescimento. Aspectos bioquímicos dos microrganismos. Cinética de crescimento microbiano. Fermentadores e métodos de fermentação. Processos envolvendo anaerobiose e respiração. Desinfecção e esterilização dos fermentadores e meios de cultivo. Substratos renováveis e não-renováveis. Proteínas uni e pluricelulares. Leveduras de panificação. Cultivos iniciadores para fermentação lática de produtos agroindustriais. Instalações industriais.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5527":{"codigo":"CAL5527","nome":"Processos Fermentativos e Bioprocessos","ementa":"Microrganismos e meios de fermentação. Metabolismo microbiano. Cinética enzimática e de\ncrescimento microbiano. Biorreatores e variáveis do sistema. Métodos de condução dos\nprocessos fermentativos. Fermentação em sistemas líquidos e em estado sólido. Fermentação\nlática. Fermentação alcoólica. Fermentação acética. Bioprodutos de interesse industrial:\nseleção de micro-organismos, produção e extração\/purificação.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CAL5507","prerequisito":"BQA7005 e CAL5003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5565":{"codigo":"CAL5565","nome":"Propriedades Físicas dos Alimentos","ementa":"Tamanho, forma e volume. Propriedades reológicas dos alimentos. Propriedades de superfície. Sistemas\ncoloidais. Atividade de água e Isotermas de sorção. Propriedades eletromagnéticas. Propriedades\ntérmicas dos alimentos.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CAL5505","prerequisito":"QMC5461","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5351":{"codigo":"QMC5351","nome":"Química Analítica Instrumental","ementa":"Condutimetria.Potenciometria. Espectroscopia de absorção mlecular no ultravioleta e visível. Espectrometria de absorção atômica. Espectrometria de emissão óptica por plasma indutivamente acoplado (ICP OES) e espectrometria de masssa com plasma indutivamente acoplado (ICP-MS). Fotometria de chama. Cromatografia gasosa. Cromatografia líquida de alta eficiência. Métodos térmicos de análise.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"QMC5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5502":{"codigo":"CAL5502","nome":"Operações Unitárias Aplicadas aos Processos Agroindustriais","ementa":"Introdução aos fenômenos de transporte. Estática e dinâmica de fluídos. Transferência de calor e massa. Agitação e mistura de fluídos. Pasteurização, esterilização. Tipos de evaporadores e suas aplicações. Moagem. Extração. Separação de sólidos, líquidos e gases: tamização, destilação, centrifugação e filtração. Ciclo frigorífico, carga térmica, resfriamento e congelamento. Secagem de alimentos e tipos de secadores. Outras técnicas de condução e conservação.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"CAL5505","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5526":{"codigo":"CAL5526","nome":"Embalagem de Alimentos","ementa":"Conceitos gerais e funções das embalagens. Materiais e tipos de embalagens. Processos de fabricação de\nembalagens. Parâmetros e avaliação de qualidade de embalagens. Embalagens ativas, inteligentes e com\natmosfera modificada. Inovação e desenvolvimento de embalagens: materiais, tecnologias e produtos.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"CAL5516","prerequisito":"CAL5565","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5562":{"codigo":"CAL5562","nome":"Operações Unitárias Aplicadas aos Processos Agroindustriais","ementa":"Introdução aos fenômenos de transporte. Balanços de massa e energia. Trocadores de calor. Agitação e\nmistura. Evaporação. Extração. Moagem. Processos de separação. Ciclo frigorífico. Resfriamento e\ncongelamento. Psicrometria e Secagem.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"CAL5502","prerequisito":"CAL5565","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5580":{"codigo":"CAL5580","nome":"Análise Química dos Alimentos","ementa":"Legislação e Fiscalização de Alimentos. Rotulagem Nutricional de Alimentos Embalados. Amostragem e \nPreparação de amostras. Composição centesimal de alimentos. Métodos clássicos e \ninstrumentais empregados no controle de qualidade de alimentos e bebidas.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"","prerequisito":"QMC5230 e QMC5351","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"INE5131":{"codigo":"INE5131","nome":"Métodos Estatísticos para Engenharias e Ciências Agrárias","ementa":"Teoria da probabilidade. Variáveis aleatórias e distribuição de probabilidade. Principais distribuições de probabilidade.\nEstimação de parâmetros. Testes de hipóteses. Análise de Variância. Análise de correlação e regressão linear.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"MTM3181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NTR5634":{"codigo":"NTR5634","nome":"Nutrição Aplicada à Ciência e Tecnologia de Alimentos","ementa":"Conceitos básicos em Nutrição. Nutrientes: funções no organismo humano, biodisponibilidade, fontes\nalimentares, necessidades e recomendações nutricionais. Hábitos alimentares e principais doenças de\norigem nutricional na população brasileira. Guias alimentares populacionais. Princípios éticos em\npesquisas com animais e seres humanos. Métodos de investigação na pesquisa em Nutrição\nExperimental.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"NTR5100 e NTR5123","prerequisito":"BQA7005 e CFS5155","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5124":{"codigo":"CAL5124","nome":"Tecnologia de Cereais","ementa":"Estruturas dos grãos e influência no processamento e produto final. Aspectos agronômicos: influência genética e ambiental. Composição química: Amido, proteína , fibra alimentar e ingredientes funcionais. Armazenamento, beneficiamento e moagem. Malte e Preparação de cerveja e destilados. Controle de qualidade. Legislação.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5401 e CAL5502","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5402":{"codigo":"CAL5402","nome":"Bioquímica de Alimentos II","ementa":"Lipídios, oxidação, antioxidantes. Emulsões alimentares. Óleos e frituras, alterações. Vitaminas lipossolúveis. Enzimas em alimentos. Fermentação. Aditivos alimentares.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"QMC5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5408":{"codigo":"CAL5408","nome":"Análise Sensorial de Alimentos","ementa":"Noções básicas sobre percepção sensorial. Perfil de características sensoriais de um alimento: sabor, odor, cor, textura. Análise comparativa dos atributos sensoriais de um alimento. Aceitabilidade preferencial, equipamentos, seleção e treinamento de degustadores. Organização do painel de testes. Testes mais  comuns, técnicas especiais. Apresentação dos resultados, análise estatística dos testes.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"INE5131","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5422":{"codigo":"CAL5422","nome":"Bioquímica de Alimentos II","ementa":"Lipídios. Oxidação. Termo oxidação: alterações de óleos e gorduras durante as frituras. Antioxidantes.\nVitaminas lipossolúveis. Emulsões alimentares. Enzimas em alimentos. Aditivos alimentares.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"CAL5402","prerequisito":"QMC5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5523":{"codigo":"CAL5523","nome":"Trabalho de Conclusão de Curso I","ementa":"Conceitos do método científico e de pesquisa. Revisão de produção científica. Redação e Normatização de trabalhos científicos e técnicas de apresentação pública. Definição de tema (com foco na ciência de tecnologia de alimentos), local de execução e orientador do trabalho de conclusão de curso. Elaboração e entrega do projeto de TCC contento: revisão bibliográfica, material e métodos, cronograma de execução e viabilidade","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5562 e CAL5580","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5586":{"codigo":"CAL5586","nome":"Tecnologia de Leite e Derivados","ementa":"Considerações sobre o leite como matéria-prima para a indústria de laticínios. Legislação. Transporte e distribuição. Composição, aspectos físico-químicos e microbiológicos do leite. Processamento de leite fluido. Leite concentrado, leite em pó e leite condensado. Processamento de produtos lácteos: doce de leite, leites fermentados, bebidas lácteas, queijos, manteiga e sorvete. Soro de leite. Tendências e inovações em laticínios.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5421 e CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5587":{"codigo":"CAL5587","nome":"Tecnologia de Cereais","ementa":"Estruturas dos grãos e influência no processamento e produto final. Aspectos agronômicos: influência genética e ambiental. Composição química: Amido, proteína, fibra alimentar e ingredientes funcionais. Armazenamento, beneficiamento e moagem. Malte. Amidos modificados. Processos de panificação, fabricação de bolachas, e cereais matinais. Controle de qualidade. Legislação.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"Inválida: CAL5401 e CAL5421CAL5502 e CAL5562 e ","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CAL5589":{"codigo":"CAL5589","nome":"Toxicologia de Alimentos","ementa":"Conceitos básicos de toxicologia alimentar. Exposição e vias de introdução. Toxicidade dos contaminantes para humanos e animais. Legislação. Substâncias tóxicas naturais: ficotoxinas, fitotoxinas, micotoxinas. Resíduos e contaminantes químicos em alimentos de origem vegetal e animal: agrotóxicos, metais pesados, aditivos químicos, resíduos de medicamentos e promotores de crescimento em produtos de origem animal. Substâncias tóxicas produzidas no processamento de alimentos. Métodos analíticos.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"CAL5580","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5524":{"codigo":"CAL5524","nome":"Trabalho de Conclusão de Curso II","ementa":"O trabalho de conclusão de curso, referente a uma revisão bibliográfica ou trabalho \noriginal de pesquisa, deverá ser orientado por um professor da UFSC, com foco na \nciência de tecnologia de alimentos, de modo a contribuir para o desenvolvimento \ncientífico e crítico-reflexivo do discente. A disciplina TCC2 deverá abordar: a) \nelaboração do trabalho prático\/redação da monografia; b) redação do trabalho de \nconclusão decurso; c) apresentação final do trabalho de conclusão de curso perante \numa banca.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5523","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5581":{"codigo":"CAL5581","nome":"Gestão da Qualidade na Indústria de Alimentos","ementa":"Contextualização da gestão da qualidade e histórico. Estruturação de projeto da qualidade. Qualidade e produtividade. Enfoques, abordagens, teorias e princípios da qualidade. Determinantes da qualidade. Pensamento estratégico e visão sistêmica do negócio. Processos e administração por processos. Sistemas integrados de gestão empresarial. Implementação de sistemas de gestão da qualidade. Indicadores de desempenho e ferramentas da qualidade. Controle Estatístico de Processo. Normas e padrões de qualidade.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5582":{"codigo":"CAL5582","nome":"Tecnologia de Carnes e Derivados","ementa":"Carnes, conceito, estrutura e bioquímica. Abatedouros. Estocagem e armazenamento. Aditivos. Processos industriais: salga; defumação; cozimento, pasteurização, esterilização, irradiação. Hambúrguer. Empanados. Curados: Salsichas; Linguiças; Fiambres; Presuntos. Curados crus: Salame; Presunto cru; Copa. Embalagens de produtos cárneos. Processamento de subprodutos.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5421 e CAL5562 e ZOT7118","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5583":{"codigo":"CAL5583","nome":"Tecnologia de Frutas e Hortaliças","ementa":"Composição de frutas e hortaliças. Transporte, recepção de matéria prima, limpeza e seleção. Qualidade pós-colheita de frutas e hortaliças. Sistemas de embalagens e armazenamento. Minimamente processados. Processos tecnológicos em frutas e hortaliças: conservação pelo calor (acidificadas e não acidificadas), conservação por controle osmótico, conservação pelo controle de umidade, conservação por fermentação. Aproveitamento de subprodutos. Legislação.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5422 e CAL5562 e FIT5930","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5584":{"codigo":"CAL5584","nome":"Tecnologia de Pescados e Derivados","ementa":"Processos de preservação de pescados. Sistemas de sanificação e controle de qualidade em indústrias de pescados. Inspeção e legislação sanitária. Transporte, distribuição e comercialização de pescados.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5421 e CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5585":{"codigo":"CAL5585","nome":"Planejamento e Projeto Agroindustrial","ementa":"Tendências no consumo de alimentos e estratégias de desenvolvimento de novos produtos. Estruturação dos elementos básicos para uma unidade de processamento de alimentos. Desenvolvimento de Projetos Agroindustriais.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5588":{"codigo":"CAL5588","nome":"Tecnologia de Óleos e Gorduras","ementa":"Matérias-primas oleaginosas: produção mundial, composição e principais características. Processamentos de óleos e gorduras. Preparação de matérias-primas. Extração. Refino: degomagem, neutralização, clarificação, desodorização. Modificação de óleos e gorduras: hidrogenação, interesterificação e fracionamento. Controle de qualidade de óleos e gorduras nas diferentes etapas do processamento. Gorduras modificadas (shortenings e margarinas).","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CAL5422 e CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5525":{"codigo":"CAL5525","nome":"Estágio Curricular Obrigatório","ementa":"Estágio curricular obrigatório, supervisionado, realizado em Instituições Públicas ou Privadas de Ensino, Pesquisa e\/ou prestação de serviços, em atividades voltadas às áreas de atuação do Cientista de Alimentos (total de 360 horas-aula na concedente). Atividade individual, desenvolvida de acordo com o plano de trabalho previamente estabelecido, e orientada por um docente do Departamento de Ciência e Tecnologia de Alimentos, sob a supervisão de um profissional da área atuante na concedente. Realização de reuniões com o Coordenador \nde Estágios (total de 18 horas-aula). Elaboração do Trabalho de Conclusão de Estágio (TCE), contemplando as atividades desenvolvidas, observando-se a metodologia e redação científica, conforme regulamento do curso (total de 18 horas-aula para a elaboração do TCE).","carga_horaria":396,"fase_sugestao":9,"equivalencia":"","prerequisito":"CAL5524 e CAL5531 e CAL5570 e CAL5571 e CAL5572 e CAL5581 e CAL5582 e CAL5583 e CAL5584 e CAL5585 e CAL5588","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Disciplina"},"CAD5240":{"codigo":"CAD5240","nome":"Aspectos Comportamentais do Empreendedor","ementa":"Conceito de empreendedorismo. A formação da Personalidade. O Processo comportamental. Fatores de sucesso, o perfil do empreendedor. Desenvolvimento de habilidades empreendedoras.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5513":{"codigo":"CAL5513","nome":"Tecnologia de Panificação","ementa":"Processos de panificação e fabricação de pães, bolachas, biscoitos e massas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5421","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5514":{"codigo":"CAL5514","nome":"Tecnologia de Bebidas","ementa":"Fermentados alcoólicos: vinhos, aguardentes, cerveja. Bebidas fermento-destiladas. Bebidas fermento-destilo-retificadas. Bebidas compostas. Fermentação acética. Bebidas carbonatadas não-alcoólicas. Instalações industriais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5527","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5517":{"codigo":"CAL5517","nome":"Alimentos Funcionais","ementa":"Conceito de alimento funcional e nutracêutico. Legislação brasileira e mundial. Proteína de soja e isoflavonas. Fibras alimentares. Ácidos graxos poli-insaturados de cadeia longa (EPA e DHA). Alho e óleo de alho. Uva e suco de uvas (catequina, epicatequina, revertrol e proantocianidinas). Limoneno, licopeno, alicina. Produtos lácteos pré-bióticos e pró-bióticos. Isocianatos e indoles (brócolis, couve-flor, couve-de-bruxelas, repolho, agrião, nabo e rabanete). Clorofila. Vitaminas e efeito antioxidante.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5520":{"codigo":"CAL5520","nome":"Tecnologias Limpas na Agroindústria","ementa":"Conceitos e procedimentos que permitam o emprego da Tecnologia Limpa como ferramenta para a minimização de resíduos, geração de novos produtos e valorização de resíduos agroindustriais. Análise de ciclo de vida do produto. Integração multidisciplinar no sentido da geração de matérias-primas e de processos ecologicamente corretos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5562","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5541":{"codigo":"CAL5541","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5542":{"codigo":"CAL5542","nome":"Programa de Intercâmbio II","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5541","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5543":{"codigo":"CAL5543","nome":"Programa de Intercâmbio III","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"CAL5542","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5551":{"codigo":"CAL5551","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos I","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do  curso.","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5552":{"codigo":"CAL5552","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos II","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do curso.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5553":{"codigo":"CAL5553","nome":"Tópicos Especiais em Ciências e Tecnologia de Alimentos III","ementa":"Tópicos não constantes das demais disciplinas, mas que constituem temas atuais e relevantes para a pesquisa na área de ciência e tecnologia de alimentos. A ementa, o programa e a bibliografia serão formulados pelo professor responsável por cada turma,  os quais deverão ser deferidos pela coordenadoria do  curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ENR8004":{"codigo":"ENR8004","nome":"Cultivo Protegido e Hidroponia","ementa":"Conceitos e Introdução. Materiais, equipamentos e estruturas. Manejo dos materiais, equipamentos e estruturas. Manejo do ambiente de cultivo. Cultivo e manejo em ambiente protegido. Cultivo hidropônico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EXR6000":{"codigo":"EXR6000","nome":"Ciência, Tecnologia e Saberes na Agricultura","ementa":"Compreensão das interfaces entre ciência, tecnologia e saberes. Mudança tecnológica. Transição sócio técnica. Sistema \nagroalimentar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EXR7402":{"codigo":"EXR7402","nome":"Legislação Agrária, Gestão e Planejamento Ambiental","ementa":"Desenvolvimento integrado. Legislação agrária. Base legal e legislação para a gestão ambiental. Auditoria ambiental. Controle de qualidade ambiental. Planejamento e o enfoque ambiental.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5021":{"codigo":"FIT5021","nome":"Viticultura e Enologia","ementa":"Botânica e ecologia da videira. Melhoramento genético e variedades. Propagação, viveiros e produção de mudas. Preparo solo, implantação, manejo e conservação do solo em vinhedos. Fisiologia e manejo da videira. Manejo e controle de doenças e pragas da videira. Maturação e colheita da uva. Microbiologia Enológica. Química enológica. Vinificações. Prática enológica. Maturação, envelhecimento e engarrafamento de vinhos. Análise Sensorial. Controle qualidade e rastreabilidade. Valorização dos produtos e marketing vitivinicola.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5922":{"codigo":"FIT5922","nome":"Plantas Condimentares e Medicinais","ementa":"Histórico, importância econômica, social e aspectos de mercado. Origem das espécies, botânica e quimiotaxinomia, cultivares, produção in vivo e in vitro de biomassa, efeito de fatores climáticos e de manejo em pré e pós-colheita sobre a composição química do produto final, colheita, processamento, embalagem e comercialização das principais espécies condimentares e medicinais. Elaboração de projetos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"QMC5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FIT5923":{"codigo":"FIT5923","nome":"Nutrigenômica e Metabolômica","ementa":"Histórico, importância social e econômica de hábitos alimentares, nitrigenética e epigenômica nutricional. Dieta e patafisiologia (câncer, doenças cardiovasculares e diabetes). Metabólitos secundários de interesse à saúde humana em alimentos. Métodos de estudo em nutrigenômica e metabolômica de alimentos. Desenvolvimento de produtos e estudo de mercado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"QMC5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LSB7904","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAL5531":{"codigo":"CAL5531","nome":"Atividades Complementares I","ementa":"Atividades extraclasses, realizadas a partir da primeira fase e validadas na oitava fase, como estágios não obrigatórios, trabalhos de iniciação científica, participação em eventos, publicações em periódicos, monitorias, gestão de empresa júnior, entre outras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAL5570":{"codigo":"CAL5570","nome":"Ações de Extensão I - Projetos","ementa":"","carga_horaria":126,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5571":{"codigo":"CAL5571","nome":"Acões de Extensão II - Eventos","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CAL5572":{"codigo":"CAL5572","nome":"Ações de Extensão III - Cursos","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"}}}}}