{"codigo":708,"nome":"EaD_UAB CIÊNCIAS BIOLÓGICAS","sigla_centro":"CCB","sigla_departamento":"BIO","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20072":20072,"20092":20092,"20132":20132,"20171":20171},"situacao":0,"situacao_descricao":"regular","num_vagas_total":300,"num_vagas_primeiro_semestre":0,"num_vagas_segundo_semestre":150,"presencial":false,"curriculos":{"20072":{"id":"355","codigo":20072,"codigo_curso":708,"carga_horaria_ufsc":3137,"carga_horaria_mec":3137,"aulas_semana_min":18,"aulas_semana_esperado":25,"aulas_semana_max":30,"num_periodos_min":9,"num_periodos_esperado":9,"num_periodos_max":14,"descricao":"Referente a Primeira Edição (EXTINTO)","ucs":{"CFS9101":{"codigo":"CFS9101","nome":"Efeitos Biológicos das Radiações - PCC 15 horas","ementa":"Radiações eletromagnéticas: luz visível, UV, raios X e raios gama. Fotoradiobiologia: feitos biológicos, higiene e aplicações das radiações em biologia. Acidentes nucleares e suas implicações. Conseqüências da exposição à radiação ultravioleta","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9101":{"codigo":"ECZ9101","nome":"Introdução à Ecologia - Teórica","ementa":"Histórico e áreas de estudo em Ecologia. Ecologia e o novo paradigma. Níveis de organização, fatores do ambiente físico e biótico, Fluxo de energia e ciclos biogeoquímicos. Interações interespecíficas. Principais biomas e ecossistemas e padrões de diversidade. Introdução à elaboração de hipóteses e investigação em Ecologia. Reflexões sobre educação e meio ambiente no ensino básico.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9102":{"codigo":"ECZ9102","nome":"Introdução à Ecologia - Prática - PCC 20 horas","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Observar e descrever os fatores básicos do ambiente físico e  biótico e descrever as principais características que regem os padrões de organização das comunidades biológicas em ecossistemas naturais e  artificiais, a ciclagem de nutrientes e o fluxo de energia através das comunidades nos ecossistemas. Analisar os efeitos das atividades humanas  sobre os ecossistemas, com ênfase nas alterações dos ciclos biogeoquímicos e nas comunidades biológicas.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9101":{"codigo":"MEN9101","nome":"Introdução à Educação a Distância","ementa":"Tecnologias de Informação e Comunicação na Educação. Mídia-educação. Comunicação e Educação na formação de professores. A modalidade de Educação a Distância: histórico, características, definições e regulamentações. A mediação pedagógica na modalidade a distância. Organização de situações de aprendizagem.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9110":{"codigo":"MEN9110","nome":"Tópicos Especiais de Educação em Biologia - PCC 20 horas\/aula","ementa":"As relações entre cultura, linguagem e biologia no trabalho pedagógico. Os estudos culturais da ciência e a educação em biologia. A dimensão pedagógica das mídias (televisão, cinema, vídeo, revista, jornal e internet) e a educação em biologia. As questões étnico-raciais e sua relação com o ensino da biologia. A pesquisa sobre cultura, discurso e educação em biologia.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"QMC9101":{"codigo":"QMC9101","nome":"Química para Ciências Biológicas","ementa":"Ligações químicas. Propriedades físicas e químicas dos sais, óxidos, ácidos e bases. Cálculos estequimétricos. Noções de reações de óxido-redução. As forças de interações intermoleculares. Hibridização de C, N, O. Noções de estereoquímica. O átomo de carbono e as funções orgânicas, grupos funcionais das moléculas orgânicas e suas principais propriedades físicas e químicas.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9101":{"codigo":"BEG9101","nome":"Biologia Celular - Teórica - PCC 20 horas","ementa":"Diversidade celular. Organização da célula procariota e eucariota. Evolução celular. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Métodos de estudo em biologia celular.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9102":{"codigo":"BEG9102","nome":"Biologia Celular - Prática","ementa":"O conteúdo prático compreende diferentes métodos de estudo da célula. Noções básicas de microscopia de luz e eletrônica. Organização geral das células procarióticas e eucarióticas. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA9101":{"codigo":"BQA9101","nome":"Bioquímica - Teórica - PCC 20 horas","ementa":"Estrutura e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos e ácidos nucléicos. Enzimas: mecanismos, cinética, inibição e regulação. Vitaminas e Coenzimas. Bioenergética e visão geral do metabolismo. Metabolismo de carboidratos, lipídeos, aminoácidos, bases nitrogenadas e proteínas. Bases moleculares da expressão gênica. Integração metabólica e regulação hormonal. Fotossíntese. Fixação biológica do nitrogênio.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BQA9102":{"codigo":"BQA9102","nome":"Bioquímica - Prática","ementa":"Princípios de segurança e cuidados gerais no laboratório de Bioquímica. Homogeneização de material biológico. Extração e precipitação de DNA genômico. Efeito da concentração de substrato na atividade enzimática. Efeito da temperatura na atividade enzimática. Dosagem de proteínas totais.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9102":{"codigo":"CFS9102","nome":"Biofísica Aplicada às Ciências Biológicas","ementa":"Estrutura das membranas biológicas. Função das proteínas de membrana: canais iônicos, difusão facilitada, transporte ativo. Atividade elétrica em membranas  biológicas: equilíbrio iônico, potencial de membrana, potencial de ação e sinapse. Hemodinâmica.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EED9504":{"codigo":"EED9504","nome":"Organização Escolar","ementa":"A escola: cultura escolar e cultura da escola. Níveis em modalidades de ensino da Educação Básica. Os tempos e espaços da organização escolar. Os sujeitos da escola. O currículo: conceitos e teorias. Projeto Político Pedagógico. Avaliação escolar.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9101":{"codigo":"MOR9101","nome":"Histologia Aplicada às Ciências Biológicas - Teórica - PCC 20 horas","ementa":"Métodos e técnicas de estudo em histologia. Tecidos: Epitelial, Conjuntivo, Cartilaginoso, Ósseo, Sangue, Nervoso e Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfoides e Histologia das Glândulas Endócrinas.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9102":{"codigo":"MOR9102","nome":"Histologia Aplicada às Ciências Biológicas - Prática","ementa":"Introdução às técnicas histológicas, Tecido Epitelial, Tecido Conjuntivo, Tecido Cartilaginoso, Tecido Ósseo, Sangue, Tecido Nervoso e Tecido Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Reprodutor Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfóides e Histologia das Glândulas Endócrinas","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9105":{"codigo":"MTM9105","nome":"Matemática Elementar para Biocientistas","ementa":"Conjuntos Numéricos, Desigualdades, Funções Elementares, Elementos de combinatória e Espaços finitos de probabilidades, Modelos Discretos","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9103":{"codigo":"BEG9103","nome":"Genética Molecular - Teórica","ementa":"Material genético; replicação do DNA e síntese de RNA; código genético; síntese de proteínas; mutação e reparo do DNA; recombinação e transposição.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9104":{"codigo":"BEG9104","nome":"Genética Molecular - Prática","ementa":"Extração DNA genômico. Amplificação DNA (PCR). Eletroforese em gel de agarose e interpretação de resultados. Acesso ao genebank. Aplicações da análise do DNA.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9103":{"codigo":"CFS9103","nome":"Fisiologia Humana - Teórica","ementa":"Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9104":{"codigo":"CFS9104","nome":"Fisiologia Humana - Prática","ementa":"Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9101":{"codigo":"FMC9101","nome":"Farmacologia Teórica","ementa":"Conceituação de: drogas, fármaco, medicamento e remédio, efeitos terapêuticos, colateral e tóxico; bases farmacocinéticas, farmacodinâmica e neurotransmissão; classificação dos fármacos segundo o uso terapêutico; abuso de medicamentos; neurobiologia da dependência química, medicamentos que causam dependência; prevenção e possibilidades terapêuticas para o abuso de drogas.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9102":{"codigo":"FMC9102","nome":"Farmacologia Prática","ementa":"Sedimentar e aprofundar o conhecimento da disciplina teórica através do uso de programas de computador para simulações práticas, tutoriais e exercícios de casos reais baseados em evidências cientificas em animais e seres humanos. Simulações práticas de farmacocinética, farmacodinâmica e comportamento animal. Programas tutoriais práticos de metabolismo, mecanismos de ação de drogas e receptores farmacológicos, neurotransmissão, comportamento animal, farmacologia da inflamação e dependência de drogas. Casos de abuso de medicamentos, alcoolismo, tabagismo, maconha e outras drogas.","carga_horaria":15,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9103":{"codigo":"MOR9103","nome":"Anatomia Teórica","ementa":"Introdução ao Estudo da Anatomia Humana. Aparelho Locomotor(Osteologia,Junturas, Miologia). Sistema Cardiovascular. Sistema Respiratório. Sistema Digestório. Sistema Urinário. Sistema Genital Masculino e Feminino.Sistema Nervoso.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9104":{"codigo":"MOR9104","nome":"Anatomia Prática","ementa":"Estudo prático dos ossos, das articulações, dos músculos, do sistema nervoso central e periférico, do sistema circulatório, do sistema respiratório, do sistema urinário, do sistema genital masculino e sistema genital feminino.","carga_horaria":20,"fase_sugestao":3,"equivalencia":"MOR7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9404":{"codigo":"PSI9404","nome":"Psicologia Educacional - Desenvolvimento e Aprendizagem","ementa":"Introdução à Psicologia como ciência: histórico, objetos e métodos. Interações sociais no contexto educacional e o lugar do professor. Introdução ao estudo de desenvolvimento e de aprendizagem :  infância, adolescência, idade adulta.  Contribuições da Psicologia na prática escolar cotidiana e na compreensão do fracasso escolar. Atividade de prática de ensino: uso de questionário, entrevista ou observação direta para investigação dos fenômenos psicológicos estudados e elaboração de relatório.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9105":{"codigo":"BEG9105","nome":"Embriologia Teórica","ementa":"Métodos de estudo em Embriologia Animal e Biologia do Desenvolvimento. Nomenclatura Embriológica básica.  Formação dos gametas femininos e masculinos. Etapas do processo de fecundação. Clivagem e gastrulação em ovos oligolécitos, mesolécitos e megalécitos. Mecanismos celulares e moleculares inerentes ao desenvolvimento embrionário. Diferenciação dos folhetos embrionários e organização da forma básica do corpo. Importância do saco vitelino, âmnio, cório, alantóide e placenta no desenvolvimento de vertebrados. Estratégias de Ensino em Embriologia Animal e Biologia do Desenvolvimento.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9106":{"codigo":"BEG9106","nome":"Embriologia Prática","ementa":"Levantamento dos métodos de estudo em Embriologia, usualmente utilizados no ensino fundamental e médio. Elaboração de um glossário constituído pela nomenclatura embriológica fundamental da área. Estudo comparativo dos processos de espermatogênese e ovogênese. Classificação dos ovos de acordo com a distribuição dos constituintes celulares. Caracterização in vitro das etapas da fecundação em modelo de invertebrado. Organização de pranchas e modelos de processos de clivagem e gastrulação em grupos de invertebrados e vertebrados. Distribuição do ectoderma, meso e endoderma na formação de tecidos, órgãos e sistemas. Análise comparativa da estrutura, função e destino do saco vitelino, âmnio, cório, alantóide e placenta nos vertebrados.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9112":{"codigo":"BEG9112","nome":"Citogenética - Teórica","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9113":{"codigo":"BEG9113","nome":"Citogenética - Prática","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9101":{"codigo":"BOT9101","nome":"Sistemática Vegetal I - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a  atividades práticas. Observar e descrever as principais características  morfológicas, celulares e reprodutivas dos grupos discutidos nas aulas teóricas. Discutir as eventuais relações entre características morfológicas com particularidades ecofisiológicas de cada um dos grupos abordados. Apresentação de técnicas de identificação básicas para estudos taxonômicos, morfoanatômicos e ecofisiológicos","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9102":{"codigo":"BOT9102","nome":"Sistemática Vegetal I - Teórica","ementa":"Introdução à Botânica.  Sistemática. Caracteres macro e micromorfológicos: níveis de  organização, sistemas reprodutivos e ciclos de vida. Correlações morfo-fisiológicas e morfo-ecológicas. Sistemática nos níveis dos  táxons superiores. Prática como Componente Curricular em algas e fungos","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9103":{"codigo":"ECZ9103","nome":"Zoologia de Invertebrados I - Teórica","ementa":"Introdução à Zoologia. Classificação dos seres vivos. Origem dos eucariontes e dos animais. Anatomia, distribuição, comportamento e sistemática de Protista e Metazoa: \"Mesozoários\" (Filos Placozoa, Rhombozoa e Orthonecta); Parazoa (Filo Porifera); Eumetazoa (Filos Cnidaria, Platyhelminthes, Nemertea, Rotifera, Gastrotricha, Kinorhyncha, Nemata, Nematomorpha, Priapula, Acanthocephala, Entoprocta, Gnathostomulida e Loricifera) e Filo Hemichordata.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9104":{"codigo":"ECZ9104","nome":"Zoologia de Invertebrados I - Prática","ementa":"Exercício de classificação.Observação de Protista. Observação morfo-anatômica de Porífera, Cnidaria, Platyhelminthes, Nemertea e blastocelomados.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9408":{"codigo":"MEN9408","nome":"Didática - PCC 20 horas\/aula","ementa":"Configuração histórica da área da Didática. Atividades de ensino como prática político-social e formativa do professor. Ensino-aprendizagem e questões político-pedagógicas e sociais da educação escolar. Concepção de conhecimento, de aprendizagem e as teorias pedagógicas. Organização do processo ensino-aprendizagem e o projeto pedagógico na escola. Modalidades de planejamento para a mediação pedagógica e sua relação com especificidade no campo de conhecimento do ensino de Biologia, Física e Química.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9103":{"codigo":"BOT9103","nome":"Sistemática Vegetal II - Prática","ementa":"Identificação botânica de plantas vasculares, a nível de família, através de análise morfológica de exemplares, utilizando-se chaves dicotômicas. Prática de coleta e herborização de exsicatas.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9104":{"codigo":"BOT9104","nome":"Sistemática Vegetal II - Teórica","ementa":"Introdução à Sistemática Biológica. Noções de Sistemática Filogenética (Cladística). Noções básicas de Morfologia Vegetal. Conquista do ambiente terrestre. Plantas terrestres (embriófitas). Briófitas (musgos, hepáticas e antóceros). Plantas vasculares (traqueófitas): evolução, caracterização morfológica e diversidade. Morfologia, taxonomia e diversidade de licófitas, monilófitas, gimnospermas e angiospermas. Principais famílias das angiospermas. Ferramentas e métodos da Taxonomia Vegetal. Herbário. Introdução à Nomenclatura Botânica.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9105":{"codigo":"BOT9105","nome":"Anatomia Vegetal Teórica","ementa":"Histologia das plantas vasculares (Pteridófitas, gimnospermas e angiospermas): meristemas, parênquimas, tecidos de sustentação, tecidos de revestimento, tecidos de condução e estruturas secretoras. Estruturação dos órgãos vegetais: raiz, caule, folha, flor, fruto e semente. Estrutura dos rudimentos seminais e do gametófito feminino; tipologia do saco embrionário. Microsporângio, microsporogênese e gametófito masculino. Embriogênese","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9106":{"codigo":"BOT9106","nome":"Anatomia Vegetal Prática","ementa":"Microtécnica vegetal; estudo dos conteúdos teóricos através da preparação de lâminas temporárias e semi-permanentes de tecido vegetal de raiz, caule, folha; estudo e observação de outras estruturas (madeira; flor; fruto e semente) em lâminas permanentes.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9107":{"codigo":"BOT9107","nome":"Fisiologia Vegetal Teórica","ementa":"Metabolismo de plantas superiores: Integração metabólica na célula vegetal. Absorção e transporte de água. Absorção iônica e nutrição vegetal. Metabolismo do nitrogênio. Fotossíntese e fotorespiração. Crescimento e desenvolvimento: reguladores de crescimento. Fisiologia de semente. Fotomorfogênese. Floração e frutificação.","carga_horaria":40,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9108":{"codigo":"BOT9108","nome":"Fisiologia Vegetal Prática","ementa":"Absorção e transporte de água - Prática: pressão de embebição, plasmólise, gutação, visualização indireta da transpiração. Absorção iônica e nutrição vegetal - Prática: cultivo de plantas de milho e solução com diferente disponibilidade de nitrogênio. Fotossíntese e fotorrespiração - Prática: extração de pigmentos fotossintéticos e efeito de fatores ambientais na fotossíntese. Fotomorfogênese - Prática: efeito da luz no formato de plântulas. Crescimento e desenvolvimento - Floração e frutificação - Prática: efeito de hormônios vegetais no crescimento e desenvolvimento de plantas Fisiologia da semente- Prática: germinação e quebra de dormência de sementes de algumas  espécies de plantas.","carga_horaria":20,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9105":{"codigo":"ECZ9105","nome":"Zoologia de Invertebrados II - Teórica","ementa":"Morfologia, anatomia, distribuição, evolução, sistemática e ecologia de invertebrados: Esquizocelomados: Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda. Enterocelomados: Filos Echinodermata,  Chaetognatha e Hemichordata.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9106":{"codigo":"ECZ9106","nome":"Zoologia de Invertebrados II - Prática","ementa":"Serão analisados exemplares fixados e vivos para estudos da morfologia externa, anatomia e sistemática dos Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda; e Filos Echinodermata, Chaetognatha e Hemichordata. Aspectos da distribuição, evolução, e ecologia serão discutidos e descritos ao longo das abordagens práticas","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9409":{"codigo":"MEN9409","nome":"Educação, Meio Ambiente e Sustentabilidade - PCC 10 horas\/aula","ementa":"A história das noções de meio ambiente e de natureza. Sustentabilidade ambiental, consumo e cidadania. Processos produtivos e sustentabilidade. A emergência da Educação Ambiental no Brasil. Vertentes contemporâneas em Educação Ambiental. Projetos de Educação Ambiental: planejamento, execução e avaliação.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9101":{"codigo":"MIP9101","nome":"Microbiologia Teórica","ementa":"Morfologia, citologia, fisiologia e genética de microrganismos. Ecologia microbiana. Microbiologia do solo, da água, do ar e dos alimentos. Microrganismos patogênicos. Controle de microrganismos. Microrganismos em Biotecnologia.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9102":{"codigo":"MIP9102","nome":"Microbiologia Prática","ementa":"Métodos de trabalho, esterilização, desinfecção e cultivo de microrganismos. Preparações microscópicas, morfologia de fungos e identificação de bactérias. Avaliação dos microganismos presentes no ar, água e produtos biotecnológicos. Antibiograma.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9107":{"codigo":"BEG9107","nome":"Genética Clássica - Teórica","ementa":"As leis básicas da Genética. Herança e ambiente. Interações genéticas. Determinação gênica do sexo e herança ligada ao sexo. Ligação, recombinação e mapeamento genético. Noções de herança quantitativa e citoplasmática. Os genes nas populações. Freqüências gênicas e genotípicas. Equilíbrio de Hardy-Weinberg.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9108":{"codigo":"BEG9108","nome":"Genética Clássica - Prática","ementa":"Cruzamentos experimentais, usando organismos modelo, para estudos de heranças por: dominância completa, dominância parcial, interação gênica e ligada ao sexo.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9107":{"codigo":"ECZ9107","nome":"Zoologia de Cordados - Teórica","ementa":"Análise das características gerais, relações filogenéticas, ecologia e sistemática dos Chordata. Serão desenvolvidos estudos dirigidos e de morfo-anatomia com observação de material fixado (via úmida e seca) e em locais com espécimens vivos, seguindo a organização abaixo. Diversidade de Cordados: Os Urochordata: Classes Larvacea, Ascidiacea e Thaliacea. Os Hemichordata e os Cephalochordata. Os Agnatha recentes. Os Chondrichthyes. Teleostomi, Acanthodii e os Osteichthyes. Os Tetrapoda  Anamniotas: Amphibia.  Amniotas: Os Répteis: quelônios, crocodilianos, lagartos e serpentes. As Aves. Archeornihes, Neornithes.Os Mamíferos. Prototheria, Metatheria e Eutheria.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9108":{"codigo":"ECZ9108","nome":"Zoologia de Cordados - Prática","ementa":"Sistemática, ecologia e comportamento; morfo-anatomia comparada. Os urocordados: Classes Larvacea, Ascidiacea e Thaleacea. Os Cephalocordados. Vertebrata. Agnatha Chondrichthyes. Teleostomi, Acanthodii e Osteichthyes. Tetrapoda anamniotas: Amphibia. Vertebrados amniotas - Tetrapoda amniotas. Testudomorpha, Archosauromorpha, Lepidosauromorpha e Synapsida. Répteis atuais: quelônios, crocodilianos, lagartos e serpentes. Aves. Mamíferos (Prototheria e Theria). Hominídeos. Manejo e conservação da vida silvestre no Brasil. Como Prática, serão analisados animais de coleção e dissecção quando possível; visitação a coleções e Zoológicos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9103":{"codigo":"FMC9103","nome":"Trabalho de Conclusão de Curso - Projeto","ementa":"Ciência, pesquisa e conhecimento. Método científico. Como analisar um trabalho científico. A elaboração do projeto de pesquisa. Definição do tema e elaboração de um projeto para o trabalho de conclusão de curso, dentro das normas do Colegiado, sob orientação técnica de um professor.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9410":{"codigo":"MEN9410","nome":"Metodologia de Ensino de Ciências e Biologia - PCC 30 horas\/aula","ementa":"As diferentes perspectivas sobre a produção do conhecimento científico. A história do ensino de ciências e biologia no Brasil. As propostas curriculares e os materiais didáticos para o ensino de ciências e biologia. As pesquisas sobre o ensino de ciências e biologia no Brasil. As dimensões epistemológico-culturais do ensino de ciências e biologia. A aplicabilidade dos conhecimentos em educação à metodologia dos processos de ensino-aprendizagem. Atividades de prática de ensino: planejamento, avaliação e ensaios pedagógicos.","carga_horaria":75,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9103":{"codigo":"MIP9103","nome":"Imunologia Teórica","ementa":"Bases fundamentais do sistema imune. Mecanismos envolvidos nas reações imunológicas in vivo e in vitro. Patologias de mamíferos associadas ao sistema imune.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9104":{"codigo":"MIP9104","nome":"Imunologia Prática","ementa":"Normas de Biossegurança para trabalho em Laboratórios, Órgãos linfóides, Sistema Fagocítico Mononuclear, Contagem de células, Citometria de fluxo, Ensaios de aglutinação em lâminas, Determinação dos grupos sangüíneos do sistema ABO e Rh, Coombs direto e indireto, Fator reumatóide, Teste de gravidez, Atividade hemolítica do soro humano,  Ensaios de Precipitação, Imunofluorescência, ELISA e Western Blotting.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9109":{"codigo":"BEG9109","nome":"Genética Evolutiva - Teórica","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação (gênica e cromossômica), Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas. A teoria da evolução e seu desenvolvimento. Especiação e mecanismos de especiação.Novas abordagens da teoria evolutiva dentro da micro e macroevolução.","carga_horaria":40,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9110":{"codigo":"BEG9110","nome":"Genética Evolutiva - Prática","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação, Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas.","carga_horaria":25,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9111":{"codigo":"BEG9111","nome":"Embriologia Humana","ementa":"Métodos de estudo em embriologia humana. Formação dos gametas femininos e masculinos. Características fundamentais da fecundação humana. Métodos contraceptivos hormonais, de barreira e comportamentais. Períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Diferenciação do ecto, meso e endoderma na organização do corpo do embrião e do feto. Aquisição do aspecto humano: formação da face e membros. Fatores intrínsecos e extrínsecos relacionados às malformações congênitas. Principais categorias de malformações congênitas. Estudo das membranas fetais e da placenta em gestações simples e gemelares. Estratégias de ensino em reprodução e embriologia humana. Temas atuais em reprodução e embriologia humana.","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9105":{"codigo":"CFS9105","nome":"Fisiologia Animal Comparada","ementa":"Fundamentos de regulação homeostática, nutrição, digestão, metabolismo, osmorregulação e excreção, ventilação e circulação, músculo e movimento, regulação neuroendócrina, reprodução, coordenação e interação dos organismos animais.","carga_horaria":75,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9109":{"codigo":"ECZ9109","nome":"Ecologia de Populações e Comunidades - Teórica","ementa":"Conceito de indivíduo, população, comunidade e ecossistema. Distribuição espacial de populações e processos demográficos. Fatores e processos determinantes de densidade. Modelos de crescimento populacional e regulação populacional. Componentes estruturais e funcionais de comunidades. Riqueza de espécies e diversidade. Conceito de nicho. Influência da competição, predação e mutualismo na estrutura de comunidades. Sucessão ecológica.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9110":{"codigo":"ECZ9110","nome":"Ecologia de Populações e Comunidades - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Análises dos efeitos da antropização em populações e comunidades, conservação da biodiversidade. Parâmetros demográficos e crescimento populacional. Uso de ferramentas computacionais de síntese e análise de dados ecológicos. Medidas de diversidade, fatores que influenciam na diversidade, teoria de biogeografia de ilhas. Nicho e diversidade funcional. Cascatas tróficas. Sucessão ecológica e ecologia de paisagem.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9411":{"codigo":"MEN9411","nome":"Estágio Supervisionado I","ementa":"A formação de professores e a prática de ensino. Estágio supervisionado em escolas de ensino fundamental e\/ou médio ou outros espaços possíveis (museus, parques de proteção ambiental, hospitais, penitenciárias, associações comunitárias) para o desenvolvimento de um trabalho pedagógico com tópicos ligados a área das ciências biológicas (planejamento, execução e avaliação contínua).","carga_horaria":200,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9412":{"codigo":"MEN9412","nome":"Estágio Supervisionado II","ementa":"A formação de professores e a prática de ensino de biologia. Estágio supervisionado em escolas de ensino fundamental e\/ou médio: planejamento, execução e avaliação. Observações, regência e produção de textos. Produção de conhecimento de forma crítica da atividade docente no ensino fundamental e\/ou médio.","carga_horaria":200,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9105":{"codigo":"MIP9105","nome":"Parasitologia Teórica","ementa":"Biologia de parasitos. Sistemática em parasitologia. Estudo teórico dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou  causadores de doenças ao homem.","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9106":{"codigo":"MIP9106","nome":"Parasitologia Prática","ementa":"Estudo prático dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou causadores de doenças ao homem. Coleta, preparação, análise e preservação de material biológico.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9107":{"codigo":"MIP9107","nome":"Tópicos em Biossegurança","ementa":"Biossegurança. Biossegurança praticada e não praticada. Legislação em biossegurança. Fontes de informação em biossegurança. Organismos geneticamente modificados (OGM). Níveis de biossegurança. Ética.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9111":{"codigo":"ECZ9111","nome":"Trabalho de Conclusão de Curso - Monografia","ementa":"Como organizar e redigir uma dissertação científica. Normas científicas e técnicas de redação de monografias. Como redigir um artigo científico. Como apresentar um trabalho científico.","carga_horaria":60,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"LLE9133","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9110":{"codigo":"MIP9110","nome":"Atividades Complementares","ementa":"","carga_horaria":200,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20092":{"id":"481","codigo":20092,"codigo_curso":708,"carga_horaria_ufsc":3137,"carga_horaria_mec":3125,"aulas_semana_min":18,"aulas_semana_esperado":25,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":9,"num_periodos_max":14,"descricao":"Referente a (2ª) Segunda Edição (EXTINTO","ucs":{"BEG9101":{"codigo":"BEG9101","nome":"Biologia Celular - Teórica - PCC 20 horas","ementa":"Diversidade celular. Organização da célula procariota e eucariota. Evolução celular. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Métodos de estudo em biologia celular.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9102":{"codigo":"BEG9102","nome":"Biologia Celular - Prática","ementa":"O conteúdo prático compreende diferentes métodos de estudo da célula. Noções básicas de microscopia de luz e eletrônica. Organização geral das células procarióticas e eucarióticas. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares.","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9101":{"codigo":"CFS9101","nome":"Efeitos Biológicos das Radiações - PCC 15 horas","ementa":"Radiações eletromagnéticas: luz visível, UV, raios X e raios gama. Fotoradiobiologia: feitos biológicos, higiene e aplicações das radiações em biologia. Acidentes nucleares e suas implicações. Conseqüências da exposição à radiação ultravioleta","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9101":{"codigo":"ECZ9101","nome":"Introdução à Ecologia - Teórica","ementa":"Histórico e áreas de estudo em Ecologia. Ecologia e o novo paradigma. Níveis de organização, fatores do ambiente físico e biótico, Fluxo de energia e ciclos biogeoquímicos. Interações interespecíficas. Principais biomas e ecossistemas e padrões de diversidade. Introdução à elaboração de hipóteses e investigação em Ecologia. Reflexões sobre educação e meio ambiente no ensino básico.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9102":{"codigo":"ECZ9102","nome":"Introdução à Ecologia - Prática - PCC 20 horas","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Observar e descrever os fatores básicos do ambiente físico e  biótico e descrever as principais características que regem os padrões de organização das comunidades biológicas em ecossistemas naturais e  artificiais, a ciclagem de nutrientes e o fluxo de energia através das comunidades nos ecossistemas. Analisar os efeitos das atividades humanas  sobre os ecossistemas, com ênfase nas alterações dos ciclos biogeoquímicos e nas comunidades biológicas.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9101":{"codigo":"MEN9101","nome":"Introdução à Educação a Distância","ementa":"Tecnologias de Informação e Comunicação na Educação. Mídia-educação. Comunicação e Educação na formação de professores. A modalidade de Educação a Distância: histórico, características, definições e regulamentações. A mediação pedagógica na modalidade a distância. Organização de situações de aprendizagem.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC9101":{"codigo":"QMC9101","nome":"Química para Ciências Biológicas","ementa":"Ligações químicas. Propriedades físicas e químicas dos sais, óxidos, ácidos e bases. Cálculos estequimétricos. Noções de reações de óxido-redução. As forças de interações intermoleculares. Hibridização de C, N, O. Noções de estereoquímica. O átomo de carbono e as funções orgânicas, grupos funcionais das moléculas orgânicas e suas principais propriedades físicas e químicas.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA9101":{"codigo":"BQA9101","nome":"Bioquímica - Teórica - PCC 20 horas","ementa":"Estrutura e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos e ácidos nucléicos. Enzimas: mecanismos, cinética, inibição e regulação. Vitaminas e Coenzimas. Bioenergética e visão geral do metabolismo. Metabolismo de carboidratos, lipídeos, aminoácidos, bases nitrogenadas e proteínas. Bases moleculares da expressão gênica. Integração metabólica e regulação hormonal. Fotossíntese. Fixação biológica do nitrogênio.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BQA9102":{"codigo":"BQA9102","nome":"Bioquímica - Prática","ementa":"Princípios de segurança e cuidados gerais no laboratório de Bioquímica. Homogeneização de material biológico. Extração e precipitação de DNA genômico. Efeito da concentração de substrato na atividade enzimática. Efeito da temperatura na atividade enzimática. Dosagem de proteínas totais.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9102":{"codigo":"CFS9102","nome":"Biofísica Aplicada às Ciências Biológicas","ementa":"Estrutura das membranas biológicas. Função das proteínas de membrana: canais iônicos, difusão facilitada, transporte ativo. Atividade elétrica em membranas  biológicas: equilíbrio iônico, potencial de membrana, potencial de ação e sinapse. Hemodinâmica.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EED9504":{"codigo":"EED9504","nome":"Organização Escolar","ementa":"A escola: cultura escolar e cultura da escola. Níveis em modalidades de ensino da Educação Básica. Os tempos e espaços da organização escolar. Os sujeitos da escola. O currículo: conceitos e teorias. Projeto Político Pedagógico. Avaliação escolar.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9110":{"codigo":"MEN9110","nome":"Tópicos Especiais de Educação em Biologia - PCC 20 horas\/aula","ementa":"As relações entre cultura, linguagem e biologia no trabalho pedagógico. Os estudos culturais da ciência e a educação em biologia. A dimensão pedagógica das mídias (televisão, cinema, vídeo, revista, jornal e internet) e a educação em biologia. As questões étnico-raciais e sua relação com o ensino da biologia. A pesquisa sobre cultura, discurso e educação em biologia.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9101":{"codigo":"MOR9101","nome":"Histologia Aplicada às Ciências Biológicas - Teórica - PCC 20 horas","ementa":"Métodos e técnicas de estudo em histologia. Tecidos: Epitelial, Conjuntivo, Cartilaginoso, Ósseo, Sangue, Nervoso e Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfoides e Histologia das Glândulas Endócrinas.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9102":{"codigo":"MOR9102","nome":"Histologia Aplicada às Ciências Biológicas - Prática","ementa":"Introdução às técnicas histológicas, Tecido Epitelial, Tecido Conjuntivo, Tecido Cartilaginoso, Tecido Ósseo, Sangue, Tecido Nervoso e Tecido Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Reprodutor Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfóides e Histologia das Glândulas Endócrinas","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9105":{"codigo":"MTM9105","nome":"Matemática Elementar para Biocientistas","ementa":"Conjuntos Numéricos, Desigualdades, Funções Elementares, Elementos de combinatória e Espaços finitos de probabilidades, Modelos Discretos","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9103":{"codigo":"BEG9103","nome":"Genética Molecular - Teórica","ementa":"Material genético; replicação do DNA e síntese de RNA; código genético; síntese de proteínas; mutação e reparo do DNA; recombinação e transposição.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9104":{"codigo":"BEG9104","nome":"Genética Molecular - Prática","ementa":"Extração DNA genômico. Amplificação DNA (PCR). Eletroforese em gel de agarose e interpretação de resultados. Acesso ao genebank. Aplicações da análise do DNA.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9103":{"codigo":"CFS9103","nome":"Fisiologia Humana - Teórica","ementa":"Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9104":{"codigo":"CFS9104","nome":"Fisiologia Humana - Prática","ementa":"Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9101":{"codigo":"FMC9101","nome":"Farmacologia Teórica","ementa":"Conceituação de: drogas, fármaco, medicamento e remédio, efeitos terapêuticos, colateral e tóxico; bases farmacocinéticas, farmacodinâmica e neurotransmissão; classificação dos fármacos segundo o uso terapêutico; abuso de medicamentos; neurobiologia da dependência química, medicamentos que causam dependência; prevenção e possibilidades terapêuticas para o abuso de drogas.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9102":{"codigo":"FMC9102","nome":"Farmacologia Prática","ementa":"Sedimentar e aprofundar o conhecimento da disciplina teórica através do uso de programas de computador para simulações práticas, tutoriais e exercícios de casos reais baseados em evidências cientificas em animais e seres humanos. Simulações práticas de farmacocinética, farmacodinâmica e comportamento animal. Programas tutoriais práticos de metabolismo, mecanismos de ação de drogas e receptores farmacológicos, neurotransmissão, comportamento animal, farmacologia da inflamação e dependência de drogas. Casos de abuso de medicamentos, alcoolismo, tabagismo, maconha e outras drogas.","carga_horaria":15,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9103":{"codigo":"MOR9103","nome":"Anatomia Teórica","ementa":"Introdução ao Estudo da Anatomia Humana. Aparelho Locomotor(Osteologia,Junturas, Miologia). Sistema Cardiovascular. Sistema Respiratório. Sistema Digestório. Sistema Urinário. Sistema Genital Masculino e Feminino.Sistema Nervoso.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"MOR7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9104":{"codigo":"MOR9104","nome":"Anatomia Prática","ementa":"Estudo prático dos ossos, das articulações, dos músculos, do sistema nervoso central e periférico, do sistema circulatório, do sistema respiratório, do sistema urinário, do sistema genital masculino e sistema genital feminino.","carga_horaria":20,"fase_sugestao":3,"equivalencia":"MOR7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9404":{"codigo":"PSI9404","nome":"Psicologia Educacional - Desenvolvimento e Aprendizagem","ementa":"Introdução à Psicologia como ciência: histórico, objetos e métodos. Interações sociais no contexto educacional e o lugar do professor. Introdução ao estudo de desenvolvimento e de aprendizagem :  infância, adolescência, idade adulta.  Contribuições da Psicologia na prática escolar cotidiana e na compreensão do fracasso escolar. Atividade de prática de ensino: uso de questionário, entrevista ou observação direta para investigação dos fenômenos psicológicos estudados e elaboração de relatório.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9105":{"codigo":"BEG9105","nome":"Embriologia Teórica","ementa":"Métodos de estudo em Embriologia Animal e Biologia do Desenvolvimento. Nomenclatura Embriológica básica.  Formação dos gametas femininos e masculinos. Etapas do processo de fecundação. Clivagem e gastrulação em ovos oligolécitos, mesolécitos e megalécitos. Mecanismos celulares e moleculares inerentes ao desenvolvimento embrionário. Diferenciação dos folhetos embrionários e organização da forma básica do corpo. Importância do saco vitelino, âmnio, cório, alantóide e placenta no desenvolvimento de vertebrados. Estratégias de Ensino em Embriologia Animal e Biologia do Desenvolvimento.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9106":{"codigo":"BEG9106","nome":"Embriologia Prática","ementa":"Levantamento dos métodos de estudo em Embriologia, usualmente utilizados no ensino fundamental e médio. Elaboração de um glossário constituído pela nomenclatura embriológica fundamental da área. Estudo comparativo dos processos de espermatogênese e ovogênese. Classificação dos ovos de acordo com a distribuição dos constituintes celulares. Caracterização in vitro das etapas da fecundação em modelo de invertebrado. Organização de pranchas e modelos de processos de clivagem e gastrulação em grupos de invertebrados e vertebrados. Distribuição do ectoderma, meso e endoderma na formação de tecidos, órgãos e sistemas. Análise comparativa da estrutura, função e destino do saco vitelino, âmnio, cório, alantóide e placenta nos vertebrados.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9112":{"codigo":"BEG9112","nome":"Citogenética - Teórica","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9113":{"codigo":"BEG9113","nome":"Citogenética - Prática","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9101":{"codigo":"BOT9101","nome":"Sistemática Vegetal I - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a  atividades práticas. Observar e descrever as principais características  morfológicas, celulares e reprodutivas dos grupos discutidos nas aulas teóricas. Discutir as eventuais relações entre características morfológicas com particularidades ecofisiológicas de cada um dos grupos abordados. Apresentação de técnicas de identificação básicas para estudos taxonômicos, morfoanatômicos e ecofisiológicos","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9102":{"codigo":"BOT9102","nome":"Sistemática Vegetal I - Teórica","ementa":"Introdução à Botânica.  Sistemática. Caracteres macro e micromorfológicos: níveis de  organização, sistemas reprodutivos e ciclos de vida. Correlações morfo-fisiológicas e morfo-ecológicas. Sistemática nos níveis dos  táxons superiores. Prática como Componente Curricular em algas e fungos","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9103":{"codigo":"ECZ9103","nome":"Zoologia de Invertebrados I - Teórica","ementa":"Introdução à Zoologia. Classificação dos seres vivos. Origem dos eucariontes e dos animais. Anatomia, distribuição, comportamento e sistemática de Protista e Metazoa: \"Mesozoários\" (Filos Placozoa, Rhombozoa e Orthonecta); Parazoa (Filo Porifera); Eumetazoa (Filos Cnidaria, Platyhelminthes, Nemertea, Rotifera, Gastrotricha, Kinorhyncha, Nemata, Nematomorpha, Priapula, Acanthocephala, Entoprocta, Gnathostomulida e Loricifera) e Filo Hemichordata.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9104":{"codigo":"ECZ9104","nome":"Zoologia de Invertebrados I - Prática","ementa":"Exercício de classificação.Observação de Protista. Observação morfo-anatômica de Porífera, Cnidaria, Platyhelminthes, Nemertea e blastocelomados.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9408":{"codigo":"MEN9408","nome":"Didática - PCC 20 horas\/aula","ementa":"Configuração histórica da área da Didática. Atividades de ensino como prática político-social e formativa do professor. Ensino-aprendizagem e questões político-pedagógicas e sociais da educação escolar. Concepção de conhecimento, de aprendizagem e as teorias pedagógicas. Organização do processo ensino-aprendizagem e o projeto pedagógico na escola. Modalidades de planejamento para a mediação pedagógica e sua relação com especificidade no campo de conhecimento do ensino de Biologia, Física e Química.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9103":{"codigo":"BOT9103","nome":"Sistemática Vegetal II - Prática","ementa":"Identificação botânica de plantas vasculares, a nível de família, através de análise morfológica de exemplares, utilizando-se chaves dicotômicas. Prática de coleta e herborização de exsicatas.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9104":{"codigo":"BOT9104","nome":"Sistemática Vegetal II - Teórica","ementa":"Introdução à Sistemática Biológica. Noções de Sistemática Filogenética (Cladística). Noções básicas de Morfologia Vegetal. Conquista do ambiente terrestre. Plantas terrestres (embriófitas). Briófitas (musgos, hepáticas e antóceros). Plantas vasculares (traqueófitas): evolução, caracterização morfológica e diversidade. Morfologia, taxonomia e diversidade de licófitas, monilófitas, gimnospermas e angiospermas. Principais famílias das angiospermas. Ferramentas e métodos da Taxonomia Vegetal. Herbário. Introdução à Nomenclatura Botânica.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9105":{"codigo":"BOT9105","nome":"Anatomia Vegetal Teórica","ementa":"Histologia das plantas vasculares (Pteridófitas, gimnospermas e angiospermas): meristemas, parênquimas, tecidos de sustentação, tecidos de revestimento, tecidos de condução e estruturas secretoras. Estruturação dos órgãos vegetais: raiz, caule, folha, flor, fruto e semente. Estrutura dos rudimentos seminais e do gametófito feminino; tipologia do saco embrionário. Microsporângio, microsporogênese e gametófito masculino. Embriogênese","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9106":{"codigo":"BOT9106","nome":"Anatomia Vegetal Prática","ementa":"Microtécnica vegetal; estudo dos conteúdos teóricos através da preparação de lâminas temporárias e semi-permanentes de tecido vegetal de raiz, caule, folha; estudo e observação de outras estruturas (madeira; flor; fruto e semente) em lâminas permanentes.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9107":{"codigo":"BOT9107","nome":"Fisiologia Vegetal Teórica","ementa":"Metabolismo de plantas superiores: Integração metabólica na célula vegetal. Absorção e transporte de água. Absorção iônica e nutrição vegetal. Metabolismo do nitrogênio. Fotossíntese e fotorespiração. Crescimento e desenvolvimento: reguladores de crescimento. Fisiologia de semente. Fotomorfogênese. Floração e frutificação.","carga_horaria":40,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9108":{"codigo":"BOT9108","nome":"Fisiologia Vegetal Prática","ementa":"Absorção e transporte de água - Prática: pressão de embebição, plasmólise, gutação, visualização indireta da transpiração. Absorção iônica e nutrição vegetal - Prática: cultivo de plantas de milho e solução com diferente disponibilidade de nitrogênio. Fotossíntese e fotorrespiração - Prática: extração de pigmentos fotossintéticos e efeito de fatores ambientais na fotossíntese. Fotomorfogênese - Prática: efeito da luz no formato de plântulas. Crescimento e desenvolvimento - Floração e frutificação - Prática: efeito de hormônios vegetais no crescimento e desenvolvimento de plantas Fisiologia da semente- Prática: germinação e quebra de dormência de sementes de algumas  espécies de plantas.","carga_horaria":20,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9105":{"codigo":"ECZ9105","nome":"Zoologia de Invertebrados II - Teórica","ementa":"Morfologia, anatomia, distribuição, evolução, sistemática e ecologia de invertebrados: Esquizocelomados: Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda. Enterocelomados: Filos Echinodermata,  Chaetognatha e Hemichordata.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9106":{"codigo":"ECZ9106","nome":"Zoologia de Invertebrados II - Prática","ementa":"Serão analisados exemplares fixados e vivos para estudos da morfologia externa, anatomia e sistemática dos Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda; e Filos Echinodermata, Chaetognatha e Hemichordata. Aspectos da distribuição, evolução, e ecologia serão discutidos e descritos ao longo das abordagens práticas","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9409":{"codigo":"MEN9409","nome":"Educação, Meio Ambiente e Sustentabilidade - PCC 10 horas\/aula","ementa":"A história das noções de meio ambiente e de natureza. Sustentabilidade ambiental, consumo e cidadania. Processos produtivos e sustentabilidade. A emergência da Educação Ambiental no Brasil. Vertentes contemporâneas em Educação Ambiental. Projetos de Educação Ambiental: planejamento, execução e avaliação.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9101":{"codigo":"MIP9101","nome":"Microbiologia Teórica","ementa":"Morfologia, citologia, fisiologia e genética de microrganismos. Ecologia microbiana. Microbiologia do solo, da água, do ar e dos alimentos. Microrganismos patogênicos. Controle de microrganismos. Microrganismos em Biotecnologia.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9102":{"codigo":"MIP9102","nome":"Microbiologia Prática","ementa":"Métodos de trabalho, esterilização, desinfecção e cultivo de microrganismos. Preparações microscópicas, morfologia de fungos e identificação de bactérias. Avaliação dos microganismos presentes no ar, água e produtos biotecnológicos. Antibiograma.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9107":{"codigo":"BEG9107","nome":"Genética Clássica - Teórica","ementa":"As leis básicas da Genética. Herança e ambiente. Interações genéticas. Determinação gênica do sexo e herança ligada ao sexo. Ligação, recombinação e mapeamento genético. Noções de herança quantitativa e citoplasmática. Os genes nas populações. Freqüências gênicas e genotípicas. Equilíbrio de Hardy-Weinberg.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9108":{"codigo":"BEG9108","nome":"Genética Clássica - Prática","ementa":"Cruzamentos experimentais, usando organismos modelo, para estudos de heranças por: dominância completa, dominância parcial, interação gênica e ligada ao sexo.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9107":{"codigo":"ECZ9107","nome":"Zoologia de Cordados - Teórica","ementa":"Análise das características gerais, relações filogenéticas, ecologia e sistemática dos Chordata. Serão desenvolvidos estudos dirigidos e de morfo-anatomia com observação de material fixado (via úmida e seca) e em locais com espécimens vivos, seguindo a organização abaixo. Diversidade de Cordados: Os Urochordata: Classes Larvacea, Ascidiacea e Thaliacea. Os Hemichordata e os Cephalochordata. Os Agnatha recentes. Os Chondrichthyes. Teleostomi, Acanthodii e os Osteichthyes. Os Tetrapoda  Anamniotas: Amphibia.  Amniotas: Os Répteis: quelônios, crocodilianos, lagartos e serpentes. As Aves. Archeornihes, Neornithes.Os Mamíferos. Prototheria, Metatheria e Eutheria.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9108":{"codigo":"ECZ9108","nome":"Zoologia de Cordados - Prática","ementa":"Sistemática, ecologia e comportamento; morfo-anatomia comparada. Os urocordados: Classes Larvacea, Ascidiacea e Thaleacea. Os Cephalocordados. Vertebrata. Agnatha Chondrichthyes. Teleostomi, Acanthodii e Osteichthyes. Tetrapoda anamniotas: Amphibia. Vertebrados amniotas - Tetrapoda amniotas. Testudomorpha, Archosauromorpha, Lepidosauromorpha e Synapsida. Répteis atuais: quelônios, crocodilianos, lagartos e serpentes. Aves. Mamíferos (Prototheria e Theria). Hominídeos. Manejo e conservação da vida silvestre no Brasil. Como Prática, serão analisados animais de coleção e dissecção quando possível; visitação a coleções e Zoológicos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9103":{"codigo":"FMC9103","nome":"Trabalho de Conclusão de Curso - Projeto","ementa":"Ciência, pesquisa e conhecimento. Método científico. Como analisar um trabalho científico. A elaboração do projeto de pesquisa. Definição do tema e elaboração de um projeto para o trabalho de conclusão de curso, dentro das normas do Colegiado, sob orientação técnica de um professor.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9410":{"codigo":"MEN9410","nome":"Metodologia de Ensino de Ciências e Biologia - PCC 30 horas\/aula","ementa":"As diferentes perspectivas sobre a produção do conhecimento científico. A história do ensino de ciências e biologia no Brasil. As propostas curriculares e os materiais didáticos para o ensino de ciências e biologia. As pesquisas sobre o ensino de ciências e biologia no Brasil. As dimensões epistemológico-culturais do ensino de ciências e biologia. A aplicabilidade dos conhecimentos em educação à metodologia dos processos de ensino-aprendizagem. Atividades de prática de ensino: planejamento, avaliação e ensaios pedagógicos.","carga_horaria":75,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9103":{"codigo":"MIP9103","nome":"Imunologia Teórica","ementa":"Bases fundamentais do sistema imune. Mecanismos envolvidos nas reações imunológicas in vivo e in vitro. Patologias de mamíferos associadas ao sistema imune.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9104":{"codigo":"MIP9104","nome":"Imunologia Prática","ementa":"Normas de Biossegurança para trabalho em Laboratórios, Órgãos linfóides, Sistema Fagocítico Mononuclear, Contagem de células, Citometria de fluxo, Ensaios de aglutinação em lâminas, Determinação dos grupos sangüíneos do sistema ABO e Rh, Coombs direto e indireto, Fator reumatóide, Teste de gravidez, Atividade hemolítica do soro humano,  Ensaios de Precipitação, Imunofluorescência, ELISA e Western Blotting.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9109":{"codigo":"BEG9109","nome":"Genética Evolutiva - Teórica","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação (gênica e cromossômica), Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas. A teoria da evolução e seu desenvolvimento. Especiação e mecanismos de especiação.Novas abordagens da teoria evolutiva dentro da micro e macroevolução.","carga_horaria":40,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9110":{"codigo":"BEG9110","nome":"Genética Evolutiva - Prática","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação, Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas.","carga_horaria":25,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9111":{"codigo":"BEG9111","nome":"Embriologia Humana","ementa":"Métodos de estudo em embriologia humana. Formação dos gametas femininos e masculinos. Características fundamentais da fecundação humana. Métodos contraceptivos hormonais, de barreira e comportamentais. Períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Diferenciação do ecto, meso e endoderma na organização do corpo do embrião e do feto. Aquisição do aspecto humano: formação da face e membros. Fatores intrínsecos e extrínsecos relacionados às malformações congênitas. Principais categorias de malformações congênitas. Estudo das membranas fetais e da placenta em gestações simples e gemelares. Estratégias de ensino em reprodução e embriologia humana. Temas atuais em reprodução e embriologia humana.","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9105":{"codigo":"CFS9105","nome":"Fisiologia Animal Comparada","ementa":"Fundamentos de regulação homeostática, nutrição, digestão, metabolismo, osmorregulação e excreção, ventilação e circulação, músculo e movimento, regulação neuroendócrina, reprodução, coordenação e interação dos organismos animais.","carga_horaria":75,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9109":{"codigo":"ECZ9109","nome":"Ecologia de Populações e Comunidades - Teórica","ementa":"Conceito de indivíduo, população, comunidade e ecossistema. Distribuição espacial de populações e processos demográficos. Fatores e processos determinantes de densidade. Modelos de crescimento populacional e regulação populacional. Componentes estruturais e funcionais de comunidades. Riqueza de espécies e diversidade. Conceito de nicho. Influência da competição, predação e mutualismo na estrutura de comunidades. Sucessão ecológica.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9110":{"codigo":"ECZ9110","nome":"Ecologia de Populações e Comunidades - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Análises dos efeitos da antropização em populações e comunidades, conservação da biodiversidade. Parâmetros demográficos e crescimento populacional. Uso de ferramentas computacionais de síntese e análise de dados ecológicos. Medidas de diversidade, fatores que influenciam na diversidade, teoria de biogeografia de ilhas. Nicho e diversidade funcional. Cascatas tróficas. Sucessão ecológica e ecologia de paisagem.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9411":{"codigo":"MEN9411","nome":"Estágio Supervisionado I","ementa":"A formação de professores e a prática de ensino. Estágio supervisionado em escolas de ensino fundamental e\/ou médio ou outros espaços possíveis (museus, parques de proteção ambiental, hospitais, penitenciárias, associações comunitárias) para o desenvolvimento de um trabalho pedagógico com tópicos ligados a área das ciências biológicas (planejamento, execução e avaliação contínua).","carga_horaria":200,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9412":{"codigo":"MEN9412","nome":"Estágio Supervisionado II","ementa":"A formação de professores e a prática de ensino de biologia. Estágio supervisionado em escolas de ensino fundamental e\/ou médio: planejamento, execução e avaliação. Observações, regência e produção de textos. Produção de conhecimento de forma crítica da atividade docente no ensino fundamental e\/ou médio.","carga_horaria":200,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9105":{"codigo":"MIP9105","nome":"Parasitologia Teórica","ementa":"Biologia de parasitos. Sistemática em parasitologia. Estudo teórico dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou  causadores de doenças ao homem.","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9106":{"codigo":"MIP9106","nome":"Parasitologia Prática","ementa":"Estudo prático dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou causadores de doenças ao homem. Coleta, preparação, análise e preservação de material biológico.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9107":{"codigo":"MIP9107","nome":"Tópicos em Biossegurança","ementa":"Biossegurança. Biossegurança praticada e não praticada. Legislação em biossegurança. Fontes de informação em biossegurança. Organismos geneticamente modificados (OGM). Níveis de biossegurança. Ética.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9111":{"codigo":"ECZ9111","nome":"Trabalho de Conclusão de Curso - Monografia","ementa":"Como organizar e redigir uma dissertação científica. Normas científicas e técnicas de redação de monografias. Como redigir um artigo científico. Como apresentar um trabalho científico.","carga_horaria":60,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"LLE9133","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9110":{"codigo":"MIP9110","nome":"Atividades Complementares","ementa":"","carga_horaria":200,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20132":{"id":"522","codigo":20132,"codigo_curso":708,"carga_horaria_ufsc":3137,"carga_horaria_mec":3125,"aulas_semana_min":18,"aulas_semana_esperado":25,"aulas_semana_max":30,"num_periodos_min":9,"num_periodos_esperado":9,"num_periodos_max":14,"descricao":"Referente a (3ª) Terceira Edição","ucs":{"BEG9101":{"codigo":"BEG9101","nome":"Biologia Celular - Teórica - PCC 20 horas","ementa":"Diversidade celular. Organização da célula procariota e eucariota. Evolução celular. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Métodos de estudo em biologia celular.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9102":{"codigo":"BEG9102","nome":"Biologia Celular - Prática","ementa":"O conteúdo prático compreende diferentes métodos de estudo da célula. Noções básicas de microscopia de luz e eletrônica. Organização geral das células procarióticas e eucarióticas. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares.","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9101":{"codigo":"CFS9101","nome":"Efeitos Biológicos das Radiações - PCC 15 horas","ementa":"Radiações eletromagnéticas: luz visível, UV, raios X e raios gama. Fotoradiobiologia: feitos biológicos, higiene e aplicações das radiações em biologia. Acidentes nucleares e suas implicações. Conseqüências da exposição à radiação ultravioleta","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9101":{"codigo":"ECZ9101","nome":"Introdução à Ecologia - Teórica","ementa":"Histórico e áreas de estudo em Ecologia. Ecologia e o novo paradigma. Níveis de organização, fatores do ambiente físico e biótico, Fluxo de energia e ciclos biogeoquímicos. Interações interespecíficas. Principais biomas e ecossistemas e padrões de diversidade. Introdução à elaboração de hipóteses e investigação em Ecologia. Reflexões sobre educação e meio ambiente no ensino básico.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9102":{"codigo":"ECZ9102","nome":"Introdução à Ecologia - Prática - PCC 20 horas","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Observar e descrever os fatores básicos do ambiente físico e  biótico e descrever as principais características que regem os padrões de organização das comunidades biológicas em ecossistemas naturais e  artificiais, a ciclagem de nutrientes e o fluxo de energia através das comunidades nos ecossistemas. Analisar os efeitos das atividades humanas  sobre os ecossistemas, com ênfase nas alterações dos ciclos biogeoquímicos e nas comunidades biológicas.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9101":{"codigo":"MEN9101","nome":"Introdução à Educação a Distância","ementa":"Tecnologias de Informação e Comunicação na Educação. Mídia-educação. Comunicação e Educação na formação de professores. A modalidade de Educação a Distância: histórico, características, definições e regulamentações. A mediação pedagógica na modalidade a distância. Organização de situações de aprendizagem.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC9101":{"codigo":"QMC9101","nome":"Química para Ciências Biológicas","ementa":"Ligações químicas. Propriedades físicas e químicas dos sais, óxidos, ácidos e bases. Cálculos estequimétricos. Noções de reações de óxido-redução. As forças de interações intermoleculares. Hibridização de C, N, O. Noções de estereoquímica. O átomo de carbono e as funções orgânicas, grupos funcionais das moléculas orgânicas e suas principais propriedades físicas e químicas.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA9101":{"codigo":"BQA9101","nome":"Bioquímica - Teórica - PCC 20 horas","ementa":"Estrutura e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos e ácidos nucléicos. Enzimas: mecanismos, cinética, inibição e regulação. Vitaminas e Coenzimas. Bioenergética e visão geral do metabolismo. Metabolismo de carboidratos, lipídeos, aminoácidos, bases nitrogenadas e proteínas. Bases moleculares da expressão gênica. Integração metabólica e regulação hormonal. Fotossíntese. Fixação biológica do nitrogênio.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BQA9102":{"codigo":"BQA9102","nome":"Bioquímica - Prática","ementa":"Princípios de segurança e cuidados gerais no laboratório de Bioquímica. Homogeneização de material biológico. Extração e precipitação de DNA genômico. Efeito da concentração de substrato na atividade enzimática. Efeito da temperatura na atividade enzimática. Dosagem de proteínas totais.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9102":{"codigo":"CFS9102","nome":"Biofísica Aplicada às Ciências Biológicas","ementa":"Estrutura das membranas biológicas. Função das proteínas de membrana: canais iônicos, difusão facilitada, transporte ativo. Atividade elétrica em membranas  biológicas: equilíbrio iônico, potencial de membrana, potencial de ação e sinapse. Hemodinâmica.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EED9504":{"codigo":"EED9504","nome":"Organização Escolar","ementa":"A escola: cultura escolar e cultura da escola. Níveis em modalidades de ensino da Educação Básica. Os tempos e espaços da organização escolar. Os sujeitos da escola. O currículo: conceitos e teorias. Projeto Político Pedagógico. Avaliação escolar.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9110":{"codigo":"MEN9110","nome":"Tópicos Especiais de Educação em Biologia - PCC 20 horas\/aula","ementa":"As relações entre cultura, linguagem e biologia no trabalho pedagógico. Os estudos culturais da ciência e a educação em biologia. A dimensão pedagógica das mídias (televisão, cinema, vídeo, revista, jornal e internet) e a educação em biologia. As questões étnico-raciais e sua relação com o ensino da biologia. A pesquisa sobre cultura, discurso e educação em biologia.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9101":{"codigo":"MOR9101","nome":"Histologia Aplicada às Ciências Biológicas - Teórica - PCC 20 horas","ementa":"Métodos e técnicas de estudo em histologia. Tecidos: Epitelial, Conjuntivo, Cartilaginoso, Ósseo, Sangue, Nervoso e Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfoides e Histologia das Glândulas Endócrinas.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9102":{"codigo":"MOR9102","nome":"Histologia Aplicada às Ciências Biológicas - Prática","ementa":"Introdução às técnicas histológicas, Tecido Epitelial, Tecido Conjuntivo, Tecido Cartilaginoso, Tecido Ósseo, Sangue, Tecido Nervoso e Tecido Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Reprodutor Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfóides e Histologia das Glândulas Endócrinas","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9105":{"codigo":"MTM9105","nome":"Matemática Elementar para Biocientistas","ementa":"Conjuntos Numéricos, Desigualdades, Funções Elementares, Elementos de combinatória e Espaços finitos de probabilidades, Modelos Discretos","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9103":{"codigo":"BEG9103","nome":"Genética Molecular - Teórica","ementa":"Material genético; replicação do DNA e síntese de RNA; código genético; síntese de proteínas; mutação e reparo do DNA; recombinação e transposição.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9104":{"codigo":"BEG9104","nome":"Genética Molecular - Prática","ementa":"Extração DNA genômico. Amplificação DNA (PCR). Eletroforese em gel de agarose e interpretação de resultados. Acesso ao genebank. Aplicações da análise do DNA.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9103":{"codigo":"CFS9103","nome":"Fisiologia Humana - Teórica","ementa":"Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9104":{"codigo":"CFS9104","nome":"Fisiologia Humana - Prática","ementa":"Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9101":{"codigo":"FMC9101","nome":"Farmacologia Teórica","ementa":"Conceituação de: drogas, fármaco, medicamento e remédio, efeitos terapêuticos, colateral e tóxico; bases farmacocinéticas, farmacodinâmica e neurotransmissão; classificação dos fármacos segundo o uso terapêutico; abuso de medicamentos; neurobiologia da dependência química, medicamentos que causam dependência; prevenção e possibilidades terapêuticas para o abuso de drogas.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9102":{"codigo":"FMC9102","nome":"Farmacologia Prática","ementa":"Sedimentar e aprofundar o conhecimento da disciplina teórica através do uso de programas de computador para simulações práticas, tutoriais e exercícios de casos reais baseados em evidências cientificas em animais e seres humanos. Simulações práticas de farmacocinética, farmacodinâmica e comportamento animal. Programas tutoriais práticos de metabolismo, mecanismos de ação de drogas e receptores farmacológicos, neurotransmissão, comportamento animal, farmacologia da inflamação e dependência de drogas. Casos de abuso de medicamentos, alcoolismo, tabagismo, maconha e outras drogas.","carga_horaria":15,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9103":{"codigo":"MOR9103","nome":"Anatomia Teórica","ementa":"Introdução ao Estudo da Anatomia Humana. Aparelho Locomotor(Osteologia,Junturas, Miologia). Sistema Cardiovascular. Sistema Respiratório. Sistema Digestório. Sistema Urinário. Sistema Genital Masculino e Feminino.Sistema Nervoso.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9104":{"codigo":"MOR9104","nome":"Anatomia Prática","ementa":"Estudo prático dos ossos, das articulações, dos músculos, do sistema nervoso central e periférico, do sistema circulatório, do sistema respiratório, do sistema urinário, do sistema genital masculino e sistema genital feminino.","carga_horaria":20,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9404":{"codigo":"PSI9404","nome":"Psicologia Educacional - Desenvolvimento e Aprendizagem","ementa":"Introdução à Psicologia como ciência: histórico, objetos e métodos. Interações sociais no contexto educacional e o lugar do professor. Introdução ao estudo de desenvolvimento e de aprendizagem :  infância, adolescência, idade adulta.  Contribuições da Psicologia na prática escolar cotidiana e na compreensão do fracasso escolar. Atividade de prática de ensino: uso de questionário, entrevista ou observação direta para investigação dos fenômenos psicológicos estudados e elaboração de relatório.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9105":{"codigo":"BEG9105","nome":"Embriologia Teórica","ementa":"Métodos de estudo em Embriologia Animal e Biologia do Desenvolvimento. Nomenclatura Embriológica básica.  Formação dos gametas femininos e masculinos. Etapas do processo de fecundação. Clivagem e gastrulação em ovos oligolécitos, mesolécitos e megalécitos. Mecanismos celulares e moleculares inerentes ao desenvolvimento embrionário. Diferenciação dos folhetos embrionários e organização da forma básica do corpo. Importância do saco vitelino, âmnio, cório, alantóide e placenta no desenvolvimento de vertebrados. Estratégias de Ensino em Embriologia Animal e Biologia do Desenvolvimento.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9106":{"codigo":"BEG9106","nome":"Embriologia Prática","ementa":"Levantamento dos métodos de estudo em Embriologia, usualmente utilizados no ensino fundamental e médio. Elaboração de um glossário constituído pela nomenclatura embriológica fundamental da área. Estudo comparativo dos processos de espermatogênese e ovogênese. Classificação dos ovos de acordo com a distribuição dos constituintes celulares. Caracterização in vitro das etapas da fecundação em modelo de invertebrado. Organização de pranchas e modelos de processos de clivagem e gastrulação em grupos de invertebrados e vertebrados. Distribuição do ectoderma, meso e endoderma na formação de tecidos, órgãos e sistemas. Análise comparativa da estrutura, função e destino do saco vitelino, âmnio, cório, alantóide e placenta nos vertebrados.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9112":{"codigo":"BEG9112","nome":"Citogenética - Teórica","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9113":{"codigo":"BEG9113","nome":"Citogenética - Prática","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9101":{"codigo":"BOT9101","nome":"Sistemática Vegetal I - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a  atividades práticas. Observar e descrever as principais características  morfológicas, celulares e reprodutivas dos grupos discutidos nas aulas teóricas. Discutir as eventuais relações entre características morfológicas com particularidades ecofisiológicas de cada um dos grupos abordados. Apresentação de técnicas de identificação básicas para estudos taxonômicos, morfoanatômicos e ecofisiológicos","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9102":{"codigo":"BOT9102","nome":"Sistemática Vegetal I - Teórica","ementa":"Introdução à Botânica.  Sistemática. Caracteres macro e micromorfológicos: níveis de  organização, sistemas reprodutivos e ciclos de vida. Correlações morfo-fisiológicas e morfo-ecológicas. Sistemática nos níveis dos  táxons superiores. Prática como Componente Curricular em algas e fungos","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9103":{"codigo":"ECZ9103","nome":"Zoologia de Invertebrados I - Teórica","ementa":"Introdução à Zoologia. Classificação dos seres vivos. Origem dos eucariontes e dos animais. Anatomia, distribuição, comportamento e sistemática de Protista e Metazoa: \"Mesozoários\" (Filos Placozoa, Rhombozoa e Orthonecta); Parazoa (Filo Porifera); Eumetazoa (Filos Cnidaria, Platyhelminthes, Nemertea, Rotifera, Gastrotricha, Kinorhyncha, Nemata, Nematomorpha, Priapula, Acanthocephala, Entoprocta, Gnathostomulida e Loricifera) e Filo Hemichordata.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9104":{"codigo":"ECZ9104","nome":"Zoologia de Invertebrados I - Prática","ementa":"Exercício de classificação.Observação de Protista. Observação morfo-anatômica de Porífera, Cnidaria, Platyhelminthes, Nemertea e blastocelomados.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9408":{"codigo":"MEN9408","nome":"Didática - PCC 20 horas\/aula","ementa":"Configuração histórica da área da Didática. Atividades de ensino como prática político-social e formativa do professor. Ensino-aprendizagem e questões político-pedagógicas e sociais da educação escolar. Concepção de conhecimento, de aprendizagem e as teorias pedagógicas. Organização do processo ensino-aprendizagem e o projeto pedagógico na escola. Modalidades de planejamento para a mediação pedagógica e sua relação com especificidade no campo de conhecimento do ensino de Biologia, Física e Química.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BIO9101":{"codigo":"BIO9101","nome":"Trabalho de Conclusão de Curso Projeto I","ementa":"Histórico e Estrutura do Conhecimento Científico. O Método Científico. Projetos de Pesquisa Científica. Projetos de Trabalhos de Conclusão de Curso (TCC). Base de Dados. Publicações.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9103":{"codigo":"BOT9103","nome":"Sistemática Vegetal II - Prática","ementa":"Identificação botânica de plantas vasculares, a nível de família, através de análise morfológica de exemplares, utilizando-se chaves dicotômicas. Prática de coleta e herborização de exsicatas.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9104":{"codigo":"BOT9104","nome":"Sistemática Vegetal II - Teórica","ementa":"Introdução à Sistemática Biológica. Noções de Sistemática Filogenética (Cladística). Noções básicas de Morfologia Vegetal. Conquista do ambiente terrestre. Plantas terrestres (embriófitas). Briófitas (musgos, hepáticas e antóceros). Plantas vasculares (traqueófitas): evolução, caracterização morfológica e diversidade. Morfologia, taxonomia e diversidade de licófitas, monilófitas, gimnospermas e angiospermas. Principais famílias das angiospermas. Ferramentas e métodos da Taxonomia Vegetal. Herbário. Introdução à Nomenclatura Botânica.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9105":{"codigo":"BOT9105","nome":"Anatomia Vegetal Teórica","ementa":"Histologia das plantas vasculares (Pteridófitas, gimnospermas e angiospermas): meristemas, parênquimas, tecidos de sustentação, tecidos de revestimento, tecidos de condução e estruturas secretoras. Estruturação dos órgãos vegetais: raiz, caule, folha, flor, fruto e semente. Estrutura dos rudimentos seminais e do gametófito feminino; tipologia do saco embrionário. Microsporângio, microsporogênese e gametófito masculino. Embriogênese","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9106":{"codigo":"BOT9106","nome":"Anatomia Vegetal Prática","ementa":"Microtécnica vegetal; estudo dos conteúdos teóricos através da preparação de lâminas temporárias e semi-permanentes de tecido vegetal de raiz, caule, folha; estudo e observação de outras estruturas (madeira; flor; fruto e semente) em lâminas permanentes.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9105":{"codigo":"ECZ9105","nome":"Zoologia de Invertebrados II - Teórica","ementa":"Morfologia, anatomia, distribuição, evolução, sistemática e ecologia de invertebrados: Esquizocelomados: Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda. Enterocelomados: Filos Echinodermata,  Chaetognatha e Hemichordata.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9106":{"codigo":"ECZ9106","nome":"Zoologia de Invertebrados II - Prática","ementa":"Serão analisados exemplares fixados e vivos para estudos da morfologia externa, anatomia e sistemática dos Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda; e Filos Echinodermata, Chaetognatha e Hemichordata. Aspectos da distribuição, evolução, e ecologia serão discutidos e descritos ao longo das abordagens práticas","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9409":{"codigo":"MEN9409","nome":"Educação, Meio Ambiente e Sustentabilidade - PCC 10 horas\/aula","ementa":"A história das noções de meio ambiente e de natureza. Sustentabilidade ambiental, consumo e cidadania. Processos produtivos e sustentabilidade. A emergência da Educação Ambiental no Brasil. Vertentes contemporâneas em Educação Ambiental. Projetos de Educação Ambiental: planejamento, execução e avaliação.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9101":{"codigo":"MIP9101","nome":"Microbiologia Teórica","ementa":"Morfologia, citologia, fisiologia e genética de microrganismos. Ecologia microbiana. Microbiologia do solo, da água, do ar e dos alimentos. Microrganismos patogênicos. Controle de microrganismos. Microrganismos em Biotecnologia.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9102":{"codigo":"MIP9102","nome":"Microbiologia Prática","ementa":"Métodos de trabalho, esterilização, desinfecção e cultivo de microrganismos. Preparações microscópicas, morfologia de fungos e identificação de bactérias. Avaliação dos microganismos presentes no ar, água e produtos biotecnológicos. Antibiograma.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9107":{"codigo":"BEG9107","nome":"Genética Clássica - Teórica","ementa":"As leis básicas da Genética. Herança e ambiente. Interações genéticas. Determinação gênica do sexo e herança ligada ao sexo. Ligação, recombinação e mapeamento genético. Noções de herança quantitativa e citoplasmática. Os genes nas populações. Freqüências gênicas e genotípicas. Equilíbrio de Hardy-Weinberg.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9108":{"codigo":"BEG9108","nome":"Genética Clássica - Prática","ementa":"Cruzamentos experimentais, usando organismos modelo, para estudos de heranças por: dominância completa, dominância parcial, interação gênica e ligada ao sexo.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9102":{"codigo":"BIO9102","nome":"Trabalho de Conclusão de Curso Projeto II","ementa":"Elaboração e apresentação do Projeto do Trabalho de Conclusão de Curso.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9107":{"codigo":"BOT9107","nome":"Fisiologia Vegetal Teórica","ementa":"Metabolismo de plantas superiores: Integração metabólica na célula vegetal. Absorção e transporte de água. Absorção iônica e nutrição vegetal. Metabolismo do nitrogênio. Fotossíntese e fotorespiração. Crescimento e desenvolvimento: reguladores de crescimento. Fisiologia de semente. Fotomorfogênese. Floração e frutificação.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9108":{"codigo":"BOT9108","nome":"Fisiologia Vegetal Prática","ementa":"Absorção e transporte de água - Prática: pressão de embebição, plasmólise, gutação, visualização indireta da transpiração. Absorção iônica e nutrição vegetal - Prática: cultivo de plantas de milho e solução com diferente disponibilidade de nitrogênio. Fotossíntese e fotorrespiração - Prática: extração de pigmentos fotossintéticos e efeito de fatores ambientais na fotossíntese. Fotomorfogênese - Prática: efeito da luz no formato de plântulas. Crescimento e desenvolvimento - Floração e frutificação - Prática: efeito de hormônios vegetais no crescimento e desenvolvimento de plantas Fisiologia da semente- Prática: germinação e quebra de dormência de sementes de algumas  espécies de plantas.","carga_horaria":20,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9107":{"codigo":"ECZ9107","nome":"Zoologia de Cordados - Teórica","ementa":"Análise das características gerais, relações filogenéticas, ecologia e sistemática dos Chordata. Serão desenvolvidos estudos dirigidos e de morfo-anatomia com observação de material fixado (via úmida e seca) e em locais com espécimens vivos, seguindo a organização abaixo. Diversidade de Cordados: Os Urochordata: Classes Larvacea, Ascidiacea e Thaliacea. Os Hemichordata e os Cephalochordata. Os Agnatha recentes. Os Chondrichthyes. Teleostomi, Acanthodii e os Osteichthyes. Os Tetrapoda  Anamniotas: Amphibia.  Amniotas: Os Répteis: quelônios, crocodilianos, lagartos e serpentes. As Aves. Archeornihes, Neornithes.Os Mamíferos. Prototheria, Metatheria e Eutheria.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9108":{"codigo":"ECZ9108","nome":"Zoologia de Cordados - Prática","ementa":"Sistemática, ecologia e comportamento; morfo-anatomia comparada. Os urocordados: Classes Larvacea, Ascidiacea e Thaleacea. Os Cephalocordados. Vertebrata. Agnatha Chondrichthyes. Teleostomi, Acanthodii e Osteichthyes. Tetrapoda anamniotas: Amphibia. Vertebrados amniotas - Tetrapoda amniotas. Testudomorpha, Archosauromorpha, Lepidosauromorpha e Synapsida. Répteis atuais: quelônios, crocodilianos, lagartos e serpentes. Aves. Mamíferos (Prototheria e Theria). Hominídeos. Manejo e conservação da vida silvestre no Brasil. Como Prática, serão analisados animais de coleção e dissecção quando possível; visitação a coleções e Zoológicos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9410":{"codigo":"MEN9410","nome":"Metodologia de Ensino de Ciências e Biologia - PCC 30 horas\/aula","ementa":"As diferentes perspectivas sobre a produção do conhecimento científico. A história do ensino de ciências e biologia no Brasil. As propostas curriculares e os materiais didáticos para o ensino de ciências e biologia. As pesquisas sobre o ensino de ciências e biologia no Brasil. As dimensões epistemológico-culturais do ensino de ciências e biologia. A aplicabilidade dos conhecimentos em educação à metodologia dos processos de ensino-aprendizagem. Atividades de prática de ensino: planejamento, avaliação e ensaios pedagógicos.","carga_horaria":75,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9103":{"codigo":"MIP9103","nome":"Imunologia Teórica","ementa":"Bases fundamentais do sistema imune. Mecanismos envolvidos nas reações imunológicas in vivo e in vitro. Patologias de mamíferos associadas ao sistema imune.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9104":{"codigo":"MIP9104","nome":"Imunologia Prática","ementa":"Normas de Biossegurança para trabalho em Laboratórios, Órgãos linfóides, Sistema Fagocítico Mononuclear, Contagem de células, Citometria de fluxo, Ensaios de aglutinação em lâminas, Determinação dos grupos sangüíneos do sistema ABO e Rh, Coombs direto e indireto, Fator reumatóide, Teste de gravidez, Atividade hemolítica do soro humano,  Ensaios de Precipitação, Imunofluorescência, ELISA e Western Blotting.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9109":{"codigo":"BEG9109","nome":"Genética Evolutiva - Teórica","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação (gênica e cromossômica), Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas. A teoria da evolução e seu desenvolvimento. Especiação e mecanismos de especiação.Novas abordagens da teoria evolutiva dentro da micro e macroevolução.","carga_horaria":40,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9110":{"codigo":"BEG9110","nome":"Genética Evolutiva - Prática","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação, Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas.","carga_horaria":25,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9111":{"codigo":"BEG9111","nome":"Embriologia Humana","ementa":"Métodos de estudo em embriologia humana. Formação dos gametas femininos e masculinos. Características fundamentais da fecundação humana. Métodos contraceptivos hormonais, de barreira e comportamentais. Períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Diferenciação do ecto, meso e endoderma na organização do corpo do embrião e do feto. Aquisição do aspecto humano: formação da face e membros. Fatores intrínsecos e extrínsecos relacionados às malformações congênitas. Principais categorias de malformações congênitas. Estudo das membranas fetais e da placenta em gestações simples e gemelares. Estratégias de ensino em reprodução e embriologia humana. Temas atuais em reprodução e embriologia humana.","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BIO9103":{"codigo":"BIO9103","nome":"Trabalho de Conclusão de Curso Monografia I","ementa":"Como organizar e redigir uma dissertação científica. Normas científicas e técnicas de redação de monografias. Como apresentar um Trabalho Científico. Execução do Trabalho de Conclusão de Curso, conforme o projeto elaborado.","carga_horaria":15,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9105":{"codigo":"BIO9105","nome":"Atividades Científico-Culturais","ementa":"Atividades que possibilitam o reconhecimento de habilidades, conhecimentos, competências e atitudes do aluno, incluindo os adquiridos fora do ambiente acadêmico.","carga_horaria":200,"fase_sugestao":7,"equivalencia":"MIP9110","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9109":{"codigo":"ECZ9109","nome":"Ecologia de Populações e Comunidades - Teórica","ementa":"Conceito de indivíduo, população, comunidade e ecossistema. Distribuição espacial de populações e processos demográficos. Fatores e processos determinantes de densidade. Modelos de crescimento populacional e regulação populacional. Componentes estruturais e funcionais de comunidades. Riqueza de espécies e diversidade. Conceito de nicho. Influência da competição, predação e mutualismo na estrutura de comunidades. Sucessão ecológica.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9110":{"codigo":"ECZ9110","nome":"Ecologia de Populações e Comunidades - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Análises dos efeitos da antropização em populações e comunidades, conservação da biodiversidade. Parâmetros demográficos e crescimento populacional. Uso de ferramentas computacionais de síntese e análise de dados ecológicos. Medidas de diversidade, fatores que influenciam na diversidade, teoria de biogeografia de ilhas. Nicho e diversidade funcional. Cascatas tróficas. Sucessão ecológica e ecologia de paisagem.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9121":{"codigo":"ECZ9121","nome":"Fisiologia Animal Comparada","ementa":"Fundamentos de regulação homeostática, nutrição, digestão, metabolismo, osmorregulação e excreção, ventilação e circulação, músculo e movimento, regulação neuroendócrina, reprodução, coordenação e interação dos organismos animais.","carga_horaria":75,"fase_sugestao":7,"equivalencia":"CFS9105","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9104":{"codigo":"BIO9104","nome":"Trabalho de Conclusão de Curso Monografia II","ementa":"Redação e apresentação do Trabalho de Conclusão de Curso (TCC).","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9411":{"codigo":"MEN9411","nome":"Estágio Supervisionado I","ementa":"A formação de professores e a prática de ensino. Estágio supervisionado em escolas de ensino fundamental e\/ou médio ou outros espaços possíveis (museus, parques de proteção ambiental, hospitais, penitenciárias, associações comunitárias) para o desenvolvimento de um trabalho pedagógico com tópicos ligados a área das ciências biológicas (planejamento, execução e avaliação contínua).","carga_horaria":200,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9105":{"codigo":"MIP9105","nome":"Parasitologia Teórica","ementa":"Biologia de parasitos. Sistemática em parasitologia. Estudo teórico dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou  causadores de doenças ao homem.","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9106":{"codigo":"MIP9106","nome":"Parasitologia Prática","ementa":"Estudo prático dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou causadores de doenças ao homem. Coleta, preparação, análise e preservação de material biológico.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9107":{"codigo":"MIP9107","nome":"Tópicos em Biossegurança","ementa":"Biossegurança. Biossegurança praticada e não praticada. Legislação em biossegurança. Fontes de informação em biossegurança. Organismos geneticamente modificados (OGM). Níveis de biossegurança. Ética.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9412":{"codigo":"MEN9412","nome":"Estágio Supervisionado II","ementa":"A formação de professores e a prática de ensino de biologia. Estágio supervisionado em escolas de ensino fundamental e\/ou médio: planejamento, execução e avaliação. Observações, regência e produção de textos. Produção de conhecimento de forma crítica da atividade docente no ensino fundamental e\/ou médio.","carga_horaria":200,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20171":{"id":"57","codigo":20171,"codigo_curso":708,"carga_horaria_ufsc":3137,"carga_horaria_mec":3125,"aulas_semana_min":18,"aulas_semana_esperado":25,"aulas_semana_max":30,"num_periodos_min":9,"num_periodos_esperado":9,"num_periodos_max":14,"descricao":"Referente a (4ª) Quarta Edição","ucs":{"CFS9101":{"codigo":"CFS9101","nome":"Efeitos Biológicos das Radiações - PCC 15 horas","ementa":"Radiações eletromagnéticas: luz visível, UV, raios X e raios gama. Fotoradiobiologia: feitos biológicos, higiene e aplicações das radiações em biologia. Acidentes nucleares e suas implicações. Conseqüências da exposição à radiação ultravioleta","carga_horaria":30,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9101":{"codigo":"ECZ9101","nome":"Introdução à Ecologia - Teórica","ementa":"Histórico e áreas de estudo em Ecologia. Ecologia e o novo paradigma. Níveis de organização, fatores do ambiente físico e biótico, Fluxo de energia e ciclos biogeoquímicos. Interações interespecíficas. Principais biomas e ecossistemas e padrões de diversidade. Introdução à elaboração de hipóteses e investigação em Ecologia. Reflexões sobre educação e meio ambiente no ensino básico.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9102":{"codigo":"ECZ9102","nome":"Introdução à Ecologia - Prática - PCC 20 horas","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Observar e descrever os fatores básicos do ambiente físico e  biótico e descrever as principais características que regem os padrões de organização das comunidades biológicas em ecossistemas naturais e  artificiais, a ciclagem de nutrientes e o fluxo de energia através das comunidades nos ecossistemas. Analisar os efeitos das atividades humanas  sobre os ecossistemas, com ênfase nas alterações dos ciclos biogeoquímicos e nas comunidades biológicas.","carga_horaria":45,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9101":{"codigo":"MEN9101","nome":"Introdução à Educação a Distância","ementa":"Tecnologias de Informação e Comunicação na Educação. Mídia-educação. Comunicação e Educação na formação de professores. A modalidade de Educação a Distância: histórico, características, definições e regulamentações. A mediação pedagógica na modalidade a distância. Organização de situações de aprendizagem.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9107":{"codigo":"MIP9107","nome":"Tópicos em Biossegurança","ementa":"Biossegurança. Biossegurança praticada e não praticada. Legislação em biossegurança. Fontes de informação em biossegurança. Organismos geneticamente modificados (OGM). Níveis de biossegurança. Ética.","carga_horaria":15,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"QMC9101":{"codigo":"QMC9101","nome":"Química para Ciências Biológicas","ementa":"Ligações químicas. Propriedades físicas e químicas dos sais, óxidos, ácidos e bases. Cálculos estequimétricos. Noções de reações de óxido-redução. As forças de interações intermoleculares. Hibridização de C, N, O. Noções de estereoquímica. O átomo de carbono e as funções orgânicas, grupos funcionais das moléculas orgânicas e suas principais propriedades físicas e químicas.","carga_horaria":60,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9101":{"codigo":"BEG9101","nome":"Biologia Celular - Teórica - PCC 20 horas","ementa":"Diversidade celular. Organização da célula procariota e eucariota. Evolução celular. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Métodos de estudo em biologia celular.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9102":{"codigo":"BEG9102","nome":"Biologia Celular - Prática","ementa":"O conteúdo prático compreende diferentes métodos de estudo da célula. Noções básicas de microscopia de luz e eletrônica. Organização geral das células procarióticas e eucarióticas. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA9101":{"codigo":"BQA9101","nome":"Bioquímica - Teórica - PCC 20 horas","ementa":"Estrutura e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos e ácidos nucléicos. Enzimas: mecanismos, cinética, inibição e regulação. Vitaminas e Coenzimas. Bioenergética e visão geral do metabolismo. Metabolismo de carboidratos, lipídeos, aminoácidos, bases nitrogenadas e proteínas. Bases moleculares da expressão gênica. Integração metabólica e regulação hormonal. Fotossíntese. Fixação biológica do nitrogênio.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BQA9102":{"codigo":"BQA9102","nome":"Bioquímica - Prática","ementa":"Princípios de segurança e cuidados gerais no laboratório de Bioquímica. Homogeneização de material biológico. Extração e precipitação de DNA genômico. Efeito da concentração de substrato na atividade enzimática. Efeito da temperatura na atividade enzimática. Dosagem de proteínas totais.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9102":{"codigo":"CFS9102","nome":"Biofísica Aplicada às Ciências Biológicas","ementa":"Estrutura das membranas biológicas. Função das proteínas de membrana: canais iônicos, difusão facilitada, transporte ativo. Atividade elétrica em membranas  biológicas: equilíbrio iônico, potencial de membrana, potencial de ação e sinapse. Hemodinâmica.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EED9504":{"codigo":"EED9504","nome":"Organização Escolar","ementa":"A escola: cultura escolar e cultura da escola. Níveis em modalidades de ensino da Educação Básica. Os tempos e espaços da organização escolar. Os sujeitos da escola. O currículo: conceitos e teorias. Projeto Político Pedagógico. Avaliação escolar.","carga_horaria":45,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9101":{"codigo":"MOR9101","nome":"Histologia Aplicada às Ciências Biológicas - Teórica - PCC 20 horas","ementa":"Métodos e técnicas de estudo em histologia. Tecidos: Epitelial, Conjuntivo, Cartilaginoso, Ósseo, Sangue, Nervoso e Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfoides e Histologia das Glândulas Endócrinas.","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9102":{"codigo":"MOR9102","nome":"Histologia Aplicada às Ciências Biológicas - Prática","ementa":"Introdução às técnicas histológicas, Tecido Epitelial, Tecido Conjuntivo, Tecido Cartilaginoso, Tecido Ósseo, Sangue, Tecido Nervoso e Tecido Muscular. Histologia dos Sistemas: Circulatório, Digestório, Urinário, Reprodutor Masculino e Reprodutor Feminino. Aparelho Respiratório. Histologia dos Órgãos Linfóides e Histologia das Glândulas Endócrinas","carga_horaria":30,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM9105":{"codigo":"MTM9105","nome":"Matemática Elementar para Biocientistas","ementa":"Conjuntos Numéricos, Desigualdades, Funções Elementares, Elementos de combinatória e Espaços finitos de probabilidades, Modelos Discretos","carga_horaria":60,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9103":{"codigo":"BEG9103","nome":"Genética Molecular - Teórica","ementa":"Material genético; replicação do DNA e síntese de RNA; código genético; síntese de proteínas; mutação e reparo do DNA; recombinação e transposição.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9104":{"codigo":"BEG9104","nome":"Genética Molecular - Prática","ementa":"Extração DNA genômico. Amplificação DNA (PCR). Eletroforese em gel de agarose e interpretação de resultados. Acesso ao genebank. Aplicações da análise do DNA.","carga_horaria":40,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS9103":{"codigo":"CFS9103","nome":"Fisiologia Humana - Teórica","ementa":"Líquidos corporais. Potencial de membrana e ação. Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"CFS9104":{"codigo":"CFS9104","nome":"Fisiologia Humana - Prática","ementa":"Funções dos sistemas: Neuromuscular, neurovegetativo, sensorial, cardiovascular, renal, respiratório, digestório e endócrino.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9101":{"codigo":"FMC9101","nome":"Farmacologia Teórica","ementa":"Conceituação de: drogas, fármaco, medicamento e remédio, efeitos terapêuticos, colateral e tóxico; bases farmacocinéticas, farmacodinâmica e neurotransmissão; classificação dos fármacos segundo o uso terapêutico; abuso de medicamentos; neurobiologia da dependência química, medicamentos que causam dependência; prevenção e possibilidades terapêuticas para o abuso de drogas.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC9102":{"codigo":"FMC9102","nome":"Farmacologia Prática","ementa":"Sedimentar e aprofundar o conhecimento da disciplina teórica através do uso de programas de computador para simulações práticas, tutoriais e exercícios de casos reais baseados em evidências cientificas em animais e seres humanos. Simulações práticas de farmacocinética, farmacodinâmica e comportamento animal. Programas tutoriais práticos de metabolismo, mecanismos de ação de drogas e receptores farmacológicos, neurotransmissão, comportamento animal, farmacologia da inflamação e dependência de drogas. Casos de abuso de medicamentos, alcoolismo, tabagismo, maconha e outras drogas.","carga_horaria":15,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9110":{"codigo":"MEN9110","nome":"Tópicos Especiais de Educação em Biologia - PCC 20 horas\/aula","ementa":"As relações entre cultura, linguagem e biologia no trabalho pedagógico. Os estudos culturais da ciência e a educação em biologia. A dimensão pedagógica das mídias (televisão, cinema, vídeo, revista, jornal e internet) e a educação em biologia. As questões étnico-raciais e sua relação com o ensino da biologia. A pesquisa sobre cultura, discurso e educação em biologia.","carga_horaria":45,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MOR9103":{"codigo":"MOR9103","nome":"Anatomia Teórica","ementa":"Introdução ao Estudo da Anatomia Humana. Aparelho Locomotor(Osteologia,Junturas, Miologia). Sistema Cardiovascular. Sistema Respiratório. Sistema Digestório. Sistema Urinário. Sistema Genital Masculino e Feminino.Sistema Nervoso.","carga_horaria":30,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR9104":{"codigo":"MOR9104","nome":"Anatomia Prática","ementa":"Estudo prático dos ossos, das articulações, dos músculos, do sistema nervoso central e periférico, do sistema circulatório, do sistema respiratório, do sistema urinário, do sistema genital masculino e sistema genital feminino.","carga_horaria":20,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PSI9404":{"codigo":"PSI9404","nome":"Psicologia Educacional - Desenvolvimento e Aprendizagem","ementa":"Introdução à Psicologia como ciência: histórico, objetos e métodos. Interações sociais no contexto educacional e o lugar do professor. Introdução ao estudo de desenvolvimento e de aprendizagem :  infância, adolescência, idade adulta.  Contribuições da Psicologia na prática escolar cotidiana e na compreensão do fracasso escolar. Atividade de prática de ensino: uso de questionário, entrevista ou observação direta para investigação dos fenômenos psicológicos estudados e elaboração de relatório.","carga_horaria":60,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9112":{"codigo":"BEG9112","nome":"Citogenética - Teórica","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9113":{"codigo":"BEG9113","nome":"Citogenética - Prática","ementa":"Caracterização cromossômica dos Eucariotos: morfologia, estrutura, ploidia, sistemas cromossômicos variantes. Mecanismos de divisão celular. Determinação cromossômica do sexo. Mutações cromossômicas. Aplicabilidade da citogenética. Evolução dos cariótipos.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9115":{"codigo":"BEG9115","nome":"Embriologia Animal - Teória","ementa":"Métodos de estudo em Embriologia Animal e Biologia do Desenvolvimento. Nomenclatura Embriológica básica. Formação dos gametas femininos e masculinos. Etapas do processo de fecundação. Clivagem e gastrulação em ovos oligolécitos, mesolécitos e megalécitos. Mecanismos celulares e moleculares inerentes ao desenvolvimento embrionário. Diferenciação dos folhetos embrionários e organização da forma básica do corpo. Importância do saco vitelino, âmnio, cório, alantóide e placenta no desenvolvimento de vertebrados. Estratégias de Ensino em Embriologia Animal e Biologia do Desenvolvimento.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9116":{"codigo":"BEG9116","nome":"Embriologia Animal - Prática","ementa":"Levantamento dos métodos de estudo em Embriologia, usualmente utilizados no ensino fundamental e médio. Elaboração de um glossário constituído pela nomenclatura embriológica fundamental da área. Estudo comparativo dos processos de espermatogênese e ovogênese. Classificação dos ovos de acordo com a distribuição dos constituintes celulares. Caracterização in vitro das etapas da fecundação em modelo de invertebrado. Organização de pranchas e modelos de processos de clivagem e gastrulação em grupos de invertebrados e vertebrados. Distribuição do ectoderma, meso e endoderma na formação de tecidos, órgãos e sistemas. Análise comparativa da estrutura, função e destino do saco vitelino, âmnio, cório, alantóide e placenta nos vertebrados.","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9101":{"codigo":"BOT9101","nome":"Sistemática Vegetal I - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a  atividades práticas. Observar e descrever as principais características  morfológicas, celulares e reprodutivas dos grupos discutidos nas aulas teóricas. Discutir as eventuais relações entre características morfológicas com particularidades ecofisiológicas de cada um dos grupos abordados. Apresentação de técnicas de identificação básicas para estudos taxonômicos, morfoanatômicos e ecofisiológicos","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9102":{"codigo":"BOT9102","nome":"Sistemática Vegetal I - Teórica","ementa":"Introdução à Botânica.  Sistemática. Caracteres macro e micromorfológicos: níveis de  organização, sistemas reprodutivos e ciclos de vida. Correlações morfo-fisiológicas e morfo-ecológicas. Sistemática nos níveis dos  táxons superiores. Prática como Componente Curricular em algas e fungos","carga_horaria":30,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9103":{"codigo":"ECZ9103","nome":"Zoologia de Invertebrados I - Teórica","ementa":"Introdução à Zoologia. Classificação dos seres vivos. Origem dos eucariontes e dos animais. Anatomia, distribuição, comportamento e sistemática de Protista e Metazoa: \"Mesozoários\" (Filos Placozoa, Rhombozoa e Orthonecta); Parazoa (Filo Porifera); Eumetazoa (Filos Cnidaria, Platyhelminthes, Nemertea, Rotifera, Gastrotricha, Kinorhyncha, Nemata, Nematomorpha, Priapula, Acanthocephala, Entoprocta, Gnathostomulida e Loricifera) e Filo Hemichordata.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9104":{"codigo":"ECZ9104","nome":"Zoologia de Invertebrados I - Prática","ementa":"Exercício de classificação.Observação de Protista. Observação morfo-anatômica de Porífera, Cnidaria, Platyhelminthes, Nemertea e blastocelomados.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9408":{"codigo":"MEN9408","nome":"Didática - PCC 20 horas\/aula","ementa":"Configuração histórica da área da Didática. Atividades de ensino como prática político-social e formativa do professor. Ensino-aprendizagem e questões político-pedagógicas e sociais da educação escolar. Concepção de conhecimento, de aprendizagem e as teorias pedagógicas. Organização do processo ensino-aprendizagem e o projeto pedagógico na escola. Modalidades de planejamento para a mediação pedagógica e sua relação com especificidade no campo de conhecimento do ensino de Biologia, Física e Química.","carga_horaria":60,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BIO9101":{"codigo":"BIO9101","nome":"Trabalho de Conclusão de Curso Projeto I","ementa":"Histórico e Estrutura do Conhecimento Científico. O Método Científico. Projetos de Pesquisa Científica. Projetos de Trabalhos de Conclusão de Curso (TCC). Base de Dados. Publicações.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9103":{"codigo":"BOT9103","nome":"Sistemática Vegetal II - Prática","ementa":"Identificação botânica de plantas vasculares, a nível de família, através de análise morfológica de exemplares, utilizando-se chaves dicotômicas. Prática de coleta e herborização de exsicatas.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9104":{"codigo":"BOT9104","nome":"Sistemática Vegetal II - Teórica","ementa":"Introdução à Sistemática Biológica. Noções de Sistemática Filogenética (Cladística). Noções básicas de Morfologia Vegetal. Conquista do ambiente terrestre. Plantas terrestres (embriófitas). Briófitas (musgos, hepáticas e antóceros). Plantas vasculares (traqueófitas): evolução, caracterização morfológica e diversidade. Morfologia, taxonomia e diversidade de licófitas, monilófitas, gimnospermas e angiospermas. Principais famílias das angiospermas. Ferramentas e métodos da Taxonomia Vegetal. Herbário. Introdução à Nomenclatura Botânica.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9105":{"codigo":"BOT9105","nome":"Anatomia Vegetal Teórica","ementa":"Histologia das plantas vasculares (Pteridófitas, gimnospermas e angiospermas): meristemas, parênquimas, tecidos de sustentação, tecidos de revestimento, tecidos de condução e estruturas secretoras. Estruturação dos órgãos vegetais: raiz, caule, folha, flor, fruto e semente. Estrutura dos rudimentos seminais e do gametófito feminino; tipologia do saco embrionário. Microsporângio, microsporogênese e gametófito masculino. Embriogênese","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BOT9106":{"codigo":"BOT9106","nome":"Anatomia Vegetal Prática","ementa":"Microtécnica vegetal; estudo dos conteúdos teóricos através da preparação de lâminas temporárias e semi-permanentes de tecido vegetal de raiz, caule, folha; estudo e observação de outras estruturas (madeira; flor; fruto e semente) em lâminas permanentes.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9105":{"codigo":"ECZ9105","nome":"Zoologia de Invertebrados II - Teórica","ementa":"Morfologia, anatomia, distribuição, evolução, sistemática e ecologia de invertebrados: Esquizocelomados: Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda. Enterocelomados: Filos Echinodermata,  Chaetognatha e Hemichordata.","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9106":{"codigo":"ECZ9106","nome":"Zoologia de Invertebrados II - Prática","ementa":"Serão analisados exemplares fixados e vivos para estudos da morfologia externa, anatomia e sistemática dos Filos Echiura, Sipuncula, Annelida, Arthropoda e Mollusca. Lofoforados: Filos Phoronida, Ectoprocta e Brachiopoda; e Filos Echinodermata, Chaetognatha e Hemichordata. Aspectos da distribuição, evolução, e ecologia serão discutidos e descritos ao longo das abordagens práticas","carga_horaria":60,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9409":{"codigo":"MEN9409","nome":"Educação, Meio Ambiente e Sustentabilidade - PCC 10 horas\/aula","ementa":"A história das noções de meio ambiente e de natureza. Sustentabilidade ambiental, consumo e cidadania. Processos produtivos e sustentabilidade. A emergência da Educação Ambiental no Brasil. Vertentes contemporâneas em Educação Ambiental. Projetos de Educação Ambiental: planejamento, execução e avaliação.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9101":{"codigo":"MIP9101","nome":"Microbiologia Teórica","ementa":"Morfologia, citologia, fisiologia e genética de microrganismos. Ecologia microbiana. Microbiologia do solo, da água, do ar e dos alimentos. Microrganismos patogênicos. Controle de microrganismos. Microrganismos em Biotecnologia.","carga_horaria":30,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9102":{"codigo":"MIP9102","nome":"Microbiologia Prática","ementa":"Métodos de trabalho, esterilização, desinfecção e cultivo de microrganismos. Preparações microscópicas, morfologia de fungos e identificação de bactérias. Avaliação dos microganismos presentes no ar, água e produtos biotecnológicos. Antibiograma.","carga_horaria":15,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9107":{"codigo":"BEG9107","nome":"Genética Clássica - Teórica","ementa":"As leis básicas da Genética. Herança e ambiente. Interações genéticas. Determinação gênica do sexo e herança ligada ao sexo. Ligação, recombinação e mapeamento genético. Noções de herança quantitativa e citoplasmática. Os genes nas populações. Freqüências gênicas e genotípicas. Equilíbrio de Hardy-Weinberg.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BEG9108":{"codigo":"BEG9108","nome":"Genética Clássica - Prática","ementa":"Cruzamentos experimentais, usando organismos modelo, para estudos de heranças por: dominância completa, dominância parcial, interação gênica e ligada ao sexo.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9102":{"codigo":"BIO9102","nome":"Trabalho de Conclusão de Curso Projeto II","ementa":"Elaboração e apresentação do Projeto do Trabalho de Conclusão de Curso.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9107":{"codigo":"BOT9107","nome":"Fisiologia Vegetal Teórica","ementa":"Metabolismo de plantas superiores: Integração metabólica na célula vegetal. Absorção e transporte de água. Absorção iônica e nutrição vegetal. Metabolismo do nitrogênio. Fotossíntese e fotorespiração. Crescimento e desenvolvimento: reguladores de crescimento. Fisiologia de semente. Fotomorfogênese. Floração e frutificação.","carga_horaria":40,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BOT9108":{"codigo":"BOT9108","nome":"Fisiologia Vegetal Prática","ementa":"Absorção e transporte de água - Prática: pressão de embebição, plasmólise, gutação, visualização indireta da transpiração. Absorção iônica e nutrição vegetal - Prática: cultivo de plantas de milho e solução com diferente disponibilidade de nitrogênio. Fotossíntese e fotorrespiração - Prática: extração de pigmentos fotossintéticos e efeito de fatores ambientais na fotossíntese. Fotomorfogênese - Prática: efeito da luz no formato de plântulas. Crescimento e desenvolvimento - Floração e frutificação - Prática: efeito de hormônios vegetais no crescimento e desenvolvimento de plantas Fisiologia da semente- Prática: germinação e quebra de dormência de sementes de algumas  espécies de plantas.","carga_horaria":20,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9107":{"codigo":"ECZ9107","nome":"Zoologia de Cordados - Teórica","ementa":"Análise das características gerais, relações filogenéticas, ecologia e sistemática dos Chordata. Serão desenvolvidos estudos dirigidos e de morfo-anatomia com observação de material fixado (via úmida e seca) e em locais com espécimens vivos, seguindo a organização abaixo. Diversidade de Cordados: Os Urochordata: Classes Larvacea, Ascidiacea e Thaliacea. Os Hemichordata e os Cephalochordata. Os Agnatha recentes. Os Chondrichthyes. Teleostomi, Acanthodii e os Osteichthyes. Os Tetrapoda  Anamniotas: Amphibia.  Amniotas: Os Répteis: quelônios, crocodilianos, lagartos e serpentes. As Aves. Archeornihes, Neornithes.Os Mamíferos. Prototheria, Metatheria e Eutheria.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9108":{"codigo":"ECZ9108","nome":"Zoologia de Cordados - Prática","ementa":"Sistemática, ecologia e comportamento; morfo-anatomia comparada. Os urocordados: Classes Larvacea, Ascidiacea e Thaleacea. Os Cephalocordados. Vertebrata. Agnatha Chondrichthyes. Teleostomi, Acanthodii e Osteichthyes. Tetrapoda anamniotas: Amphibia. Vertebrados amniotas - Tetrapoda amniotas. Testudomorpha, Archosauromorpha, Lepidosauromorpha e Synapsida. Répteis atuais: quelônios, crocodilianos, lagartos e serpentes. Aves. Mamíferos (Prototheria e Theria). Hominídeos. Manejo e conservação da vida silvestre no Brasil. Como Prática, serão analisados animais de coleção e dissecção quando possível; visitação a coleções e Zoológicos.","carga_horaria":60,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9410":{"codigo":"MEN9410","nome":"Metodologia de Ensino de Ciências e Biologia - PCC 30 horas\/aula","ementa":"As diferentes perspectivas sobre a produção do conhecimento científico. A história do ensino de ciências e biologia no Brasil. As propostas curriculares e os materiais didáticos para o ensino de ciências e biologia. As pesquisas sobre o ensino de ciências e biologia no Brasil. As dimensões epistemológico-culturais do ensino de ciências e biologia. A aplicabilidade dos conhecimentos em educação à metodologia dos processos de ensino-aprendizagem. Atividades de prática de ensino: planejamento, avaliação e ensaios pedagógicos.","carga_horaria":75,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9103":{"codigo":"MIP9103","nome":"Imunologia Teórica","ementa":"Bases fundamentais do sistema imune. Mecanismos envolvidos nas reações imunológicas in vivo e in vitro. Patologias de mamíferos associadas ao sistema imune.","carga_horaria":30,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9104":{"codigo":"MIP9104","nome":"Imunologia Prática","ementa":"Normas de Biossegurança para trabalho em Laboratórios, Órgãos linfóides, Sistema Fagocítico Mononuclear, Contagem de células, Citometria de fluxo, Ensaios de aglutinação em lâminas, Determinação dos grupos sangüíneos do sistema ABO e Rh, Coombs direto e indireto, Fator reumatóide, Teste de gravidez, Atividade hemolítica do soro humano,  Ensaios de Precipitação, Imunofluorescência, ELISA e Western Blotting.","carga_horaria":15,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9109":{"codigo":"BEG9109","nome":"Genética Evolutiva - Teórica","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação (gênica e cromossômica), Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas. A teoria da evolução e seu desenvolvimento. Especiação e mecanismos de especiação.Novas abordagens da teoria evolutiva dentro da micro e macroevolução.","carga_horaria":40,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9110":{"codigo":"BEG9110","nome":"Genética Evolutiva - Prática","ementa":"Fatores que alteram o Equilíbrio de Hardy-Weinberg: Endogamia, Deriva Genética, Mutação, Fluxo Gênico e Seleção. A variabilidade genética em populações panmíticas e isoladas.","carga_horaria":25,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG9111":{"codigo":"BEG9111","nome":"Embriologia Humana","ementa":"Métodos de estudo em embriologia humana. Formação dos gametas femininos e masculinos. Características fundamentais da fecundação humana. Métodos contraceptivos hormonais, de barreira e comportamentais. Períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Diferenciação do ecto, meso e endoderma na organização do corpo do embrião e do feto. Aquisição do aspecto humano: formação da face e membros. Fatores intrínsecos e extrínsecos relacionados às malformações congênitas. Principais categorias de malformações congênitas. Estudo das membranas fetais e da placenta em gestações simples e gemelares. Estratégias de ensino em reprodução e embriologia humana. Temas atuais em reprodução e embriologia humana.","carga_horaria":30,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"BIO9103":{"codigo":"BIO9103","nome":"Trabalho de Conclusão de Curso Monografia I","ementa":"Como organizar e redigir uma dissertação científica. Normas científicas e técnicas de redação de monografias. Como apresentar um Trabalho Científico. Execução do Trabalho de Conclusão de Curso, conforme o projeto elaborado.","carga_horaria":15,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9105":{"codigo":"BIO9105","nome":"Atividades Científico-Culturais","ementa":"Atividades que possibilitam o reconhecimento de habilidades, conhecimentos, competências e atitudes do aluno, incluindo os adquiridos fora do ambiente acadêmico.","carga_horaria":200,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9109":{"codigo":"ECZ9109","nome":"Ecologia de Populações e Comunidades - Teórica","ementa":"Conceito de indivíduo, população, comunidade e ecossistema. Distribuição espacial de populações e processos demográficos. Fatores e processos determinantes de densidade. Modelos de crescimento populacional e regulação populacional. Componentes estruturais e funcionais de comunidades. Riqueza de espécies e diversidade. Conceito de nicho. Influência da competição, predação e mutualismo na estrutura de comunidades. Sucessão ecológica.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"ECZ9110":{"codigo":"ECZ9110","nome":"Ecologia de Populações e Comunidades - Prática","ementa":"Executar atividades conectando os conteúdos teóricos a atividades práticas. Análises dos efeitos da antropização em populações e comunidades, conservação da biodiversidade. Parâmetros demográficos e crescimento populacional. Uso de ferramentas computacionais de síntese e análise de dados ecológicos. Medidas de diversidade, fatores que influenciam na diversidade, teoria de biogeografia de ilhas. Nicho e diversidade funcional. Cascatas tróficas. Sucessão ecológica e ecologia de paisagem.","carga_horaria":45,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ9121":{"codigo":"ECZ9121","nome":"Fisiologia Animal Comparada","ementa":"Fundamentos de regulação homeostática, nutrição, digestão, metabolismo, osmorregulação e excreção, ventilação e circulação, músculo e movimento, regulação neuroendócrina, reprodução, coordenação e interação dos organismos animais.","carga_horaria":75,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BIO9104":{"codigo":"BIO9104","nome":"Trabalho de Conclusão de Curso Monografia II","ementa":"Redação e apresentação do Trabalho de Conclusão de Curso (TCC).","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MEN9411":{"codigo":"MEN9411","nome":"Estágio Supervisionado I","ementa":"A formação de professores e a prática de ensino. Estágio supervisionado em escolas de ensino fundamental e\/ou médio ou outros espaços possíveis (museus, parques de proteção ambiental, hospitais, penitenciárias, associações comunitárias) para o desenvolvimento de um trabalho pedagógico com tópicos ligados a área das ciências biológicas (planejamento, execução e avaliação contínua).","carga_horaria":200,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP9105":{"codigo":"MIP9105","nome":"Parasitologia Teórica","ementa":"Biologia de parasitos. Sistemática em parasitologia. Estudo teórico dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou  causadores de doenças ao homem.","carga_horaria":30,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MIP9106":{"codigo":"MIP9106","nome":"Parasitologia Prática","ementa":"Estudo prático dos principais grupos de protistas, metazoários e artrópodos transmissores e\/ou causadores de doenças ao homem. Coleta, preparação, análise e preservação de material biológico.","carga_horaria":15,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LSB9904":{"codigo":"LSB9904","nome":"Língua Brasileira de Sinais I - PCC 18horas-aula","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sianis: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar ionformações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","3":"PCC"},"tipo_uc":"Disciplina"},"MEN9412":{"codigo":"MEN9412","nome":"Estágio Supervisionado II","ementa":"A formação de professores e a prática de ensino de biologia. Estágio supervisionado em escolas de ensino fundamental e\/ou médio: planejamento, execução e avaliação. Observações, regência e produção de textos. Produção de conhecimento de forma crítica da atividade docente no ensino fundamental e\/ou médio.","carga_horaria":200,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}}}}