{"codigo":651,"nome":"TECNOLOGIAS DA INFORMAÇÃO E COMUNICAÇÃO [Campus Araranguá]","sigla_centro":"CTS","sigla_departamento":"ARA","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20092":20092,"20111":20111},"situacao":1,"situacao_descricao":"em extinção","num_vagas_total":0,"num_vagas_primeiro_semestre":0,"num_vagas_segundo_semestre":0,"presencial":true,"curriculos":{"20092":{"id":"435","codigo":20092,"codigo_curso":651,"carga_horaria_ufsc":2880,"carga_horaria_mec":2400,"aulas_semana_min":12,"aulas_semana_esperado":16,"aulas_semana_max":28,"num_periodos_min":6,"num_periodos_esperado":6,"num_periodos_max":11,"descricao":"Referente ao curriculo 20092","ucs":{"TIC7101":{"codigo":"TIC7101","nome":"Organização e Arquitetura de Computadores","ementa":"Noções básicas de arquitetura e organização de computadores. Descrição da organização interna de computadores: CPU, memória, periféricos. Entradas e saídas de dados. Armazenamento e representação de dados: base binária e complemento a dois, ponto flutuante, caractere. Armazenamento e representação de instruções. Modos de endereçamento. Conjunto típico de instruções de uma CPU. Noções da estrutura de software: linguagem Assembly, linguagens de programação, compiladores e interpretadores, sistema operacional, aplicativos, utilitários e pacotes.","carga_horaria":108,"fase_sugestao":1,"equivalencia":"ARA7123","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7102":{"codigo":"TIC7102","nome":"Sistemas Multimídia I","ementa":"Introdução  à multimídia, conceitos e aplicações de hipertexto e hipermídia.Multimidia em CD\/DVD e na Internet.Ergonomia de interfaces multimídia.Ferramentas de desenvolvimento para multimídia. Conceitos básicos de imagem,textos, desenhos, animações e áudio. Softwares educativos. Exemplos de aplicações multimídia: voz sobre IP, videofonia, videoconferência, ambiente virtual de aprendizagem, ambiente virtual colaborativo e tv interativa na educação.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"ARA7206","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7113":{"codigo":"TIC7113","nome":"Programação em Computadores I","ementa":"Conceitos: algoritmos e programas, compiladores, pseudocódigo. Linguagens de Programação. Variáveis. Tipos de dados pré-definidos. Expressões. Comandos e Estruturas de controle: atribuição, seleção, iteração, leitura e escrita. Subprogramação: parâmetros, funções, procedimentos. Fases do desenvolvimento de programas: codificação, compilação e execução. Desenvolvimento de programas em uma linguagem de alto nível.","carga_horaria":108,"fase_sugestao":1,"equivalencia":"ARA7140","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7124":{"codigo":"TIC7124","nome":"Inovação e Criatividade na Era do Conhecimento","ementa":"Origens Econômica e Sociológica do Processo de Inovação (Pensamento de Schumpeter). Visões da Inovação e da Evolução Tecnológica. Métodos e estratégias de Gestão de Inovação. Conceito em criatividade, o papel da criatividade nas modernas organizações, bloqueios, técnicas do desenvolvimento da criatividade.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"ARA7201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7135":{"codigo":"TIC7135","nome":"Perfil do Profissional de Tecnologias da Informação e Comunicação (TIC)","ementa":"Estrutura curricular do curso Tecnologia da Informação e Comunicação (TIC), áreas e disciplinas. Apresentação e interação com o ambiente virtual adotado na UFSC. Histórico e evolução das TIC. Interações profissionais em diferentes áreas de TIC. Oficinas de TIC. Conceitos básicos de legislação em informática. Ética profissional.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"ARA7120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7201":{"codigo":"TIC7201","nome":"Introdução a Redes de Computadores","ementa":"Conceitos básicos de redes de computadores, protocolos, classificação das redes de computadores, topologias de redes, arquiteturas RM-OSI e Internet. Noções de comunicação de dados: meios de transmissão de dados, técnicas de Codificação, Modulação, Multiplexação, Comutação, modos de Transmissão, técnicas de Controle de Erros. Estrutura da Internet: borda e núcleo, redes de acesso, rede de redes. Camadas aplicação, transporte, rede, enlace e física da arquitetura Internet.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7126","prerequisito":"TIC7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7202":{"codigo":"TIC7202","nome":"Estruturas de Dados","ementa":"Alocação dinâmica de memória. Variáveis estáticas e dinâmicas. Estruturas lineares. Tabelas de Espalhamento. Árvores. Árvores de Pesquisa. Métodos de ordenação. Métodos de acesso a arquivos. Técnicas de implementações iterativas e recursivas de estruturas de dados. Complexidade dos algoritmos em estruturas de dados.Listas lineares e suas generalizações: listas ordenadas, listas encadeadas, pilhas e filas. Aplicações de listas. Alocação dinâmica. Métodos de classificação.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7125","prerequisito":"TIC7101 e TIC7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7214":{"codigo":"TIC7214","nome":"Programação em Computadores II","ementa":"Alocação dinâmica de memória e ponteiros. Manipulação de caracteres. Recursividade. Implementação de estruturas de dados estáticas e dinâmicas (listas, filas e pilhas). Manipulação de Arquivos. Algoritmos de ordenação. Interfaces com o usuário. Desenvolvimento de programas em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7141","prerequisito":"TIC7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7225":{"codigo":"TIC7225","nome":"Introdução a Administração ( Distância)","ementa":"A Importância da Administração. Evolução Histórica das Organizações. Teorias da Administração. O Trabalho Individual e em Grupo. As Áreas Funcionais da Empresa. Funções e Áreas Organizacionais. O Processo Empresarial. Organização, planejamento e direção: Comunicação, tomada de decisão, poder e autoridade. Atributos do Gestor na Organização. Administração de Recursos Digitais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7204","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7226":{"codigo":"TIC7226","nome":"Introdução a Economia e Contabilidade","ementa":"Ciência Econômica: Objeto que caracteriza as teorias econômicas. A escola clássica: objeto e método. A escola marxista: objeto e método. A escola neoclássica: objeto e método; equilíbrio parcial e geral. Valor de preço nas teorias econômicas. Análise Keynesiana: princípio da demanda efetiva.Questões de economia brasileira: Macro e microeconomia. Contabilidade e suas finalidades. Patrimônio e patrimônio líquido. Registros contábeis por meio de partidas dobradas. Estruturação das demonstrações contábeis. Classificação dos custos de acordo com sua natureza. Custos de produção: matérias primas, mão de obra direta e custos indiretos de fabricação. Custos dos produtos vendidos de mercadorias e de serviços prestados. Métodos de custeio.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7202","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7237":{"codigo":"TIC7237","nome":"Comunicação Oral e Escrita","ementa":"Redação técnica: relatório, resumo e resenha. Normas da ABNT para trabalhos acadêmicos: citações e referências bibliográficas. Elaboração de fichas de resumo. Técnicas de leitura e produção de texto científico (artigos\/paper\/poster). Redação de texto oficial e curriculum vitae. Técnicas de apresentação em público: oratória, postura, imagem pessoal, linguagem, entonação, vivacidade, dinamismo para apresentação. O uso de multimídia para apresentação.  Exercícios práticos-didáticos da oratória.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"ARA7122","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7203":{"codigo":"TIC7203","nome":"Banco de Dados I","ementa":"Introdução aos sistemas de gerência de bancos de dados. Projeto de banco de dados: conceitual, lógico e físico. Projeto conceitual de dados: entidades, relacionamentos, atributos, generalização e especialização. Projeto lógico para o modelo de dados relacional. Dependências funcionais e normalização. Linguagens de definição e de manipulação de dados. SQL. Restrições de integridade e visões. Organização física de bancos de dados: estruturas de armazenamento e indexação. Desenvolvimento de aplicações de banco de dados.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7129","prerequisito":"TIC7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7301":{"codigo":"TIC7301","nome":"Sistemas Operacionais","ementa":"Histórico, evolução e funções dos sistemas operacionais. Tipos de sistemas operacionais. Estrutura de um sistema operacional. Conceito e estados de um processo. Métodos para comunicação e sincronização. Processos; Escalonamento. Gerenciamento de entrada\/saída: aspectos de hardware e software. Gerência de memória: princípios básicos, paginação, multiprogramação, memória virtual, algoritmos para troca de páginas, cache, algoritmos para manipulação de cache. Sistema de arquivos: visão do usuário, diretrizes para projetos, aspectos de confiabilidade, segurança e desempenho. Sistemas operacionais distribuídos. Principais sistemas operacionais de mercado.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7131","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7313":{"codigo":"TIC7313","nome":"Engenharia de Software I","ementa":"Evolução da prática de desenvolvimento de software; Critérios de qualidade de artefatos de software; modelos de ciclo de vida; metodologias de desenvolvimento de software; manutenção de software; engenharia reversa; modelagem formal de sistemas; abordagens voltadas ao reuso de software; teste de software; gerenciamento do processo de produção de software e técnicas de apoio ao gerenciamento do processo de produção de software; apoio automatizado ao desenvolvimento de software.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7124","prerequisito":"TIC7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7314":{"codigo":"TIC7314","nome":"Programação Orientada a Objetos","ementa":"Conceitos fundamentais do paradigma de Programação Orientada a Objetos: objetos, classes, atributos, métodos. Encapsulamento. Herança. Polimorfismo. Mensagens. Tratamento de exceções. Reusabilidade. Criação e utilização de bibliotecas de classes. Persistência de dados e de Objetos. Desenvolvimento de programas utilizando uma linguagem orientada a objetos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7127 ou ARA7532","prerequisito":"TIC7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7325":{"codigo":"TIC7325","nome":"Princípios de Marketing (Distância)","ementa":"Conceitos e abordagens históricas do Marketing. Definições centrais de Marketing. O ambiente de Marketing. O mercado e sua visão de segmentação e posicionamento. Conceito de Canal de Marketing; estratégias e estruturas de canal. Canais como Sistemas Competitivos. Seleção de Canais de Distribuição. Serviço ao Cliente. Relacionamentos entre Fornecedores e Clientes no Canal. Marketing voltado para o valor. Princípios e estratégias de preço. Finanças aplicadas ao marketing. Planejamento, execução e utilização da pesquisa de mercado como um instrumento do SIM (Sistema de Informações de Marketing). A pesquisa mercadológica no processo de tomada de decisão em marketing. Marketing Pessoal: aspectos da competitividade e pessoas.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7205","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7537":{"codigo":"TIC7537","nome":"Informática na Educação I","ementa":"Uso de tecnologias de Informação e Comunicação aplicadas as teorias de aprendizagem. Estratégias para o uso de softwares educativos no ensino. Principais teorias do desenvolvimento humano: cognitivas, sócio-interacionais. Inteligências múltiplas. A informática educacional: conceitos e aplicações das teorias de aprendizagem. Estratégias Educacionais. Avaliação de Software Educacional. Exemplos de softwares educacionais. Recursos multimídia como recurso didático. Informática na Educação Especial e acessibilidade. Desenvolvimento de protótipo de hipermídia educacional.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7203","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7302":{"codigo":"TIC7302","nome":"Sistemas Multimídia II","ementa":"Tecnologias, aplicações e plataforma multimídia. Hardware e software para multimídia. Ferramentas de autoria.  Representação de dados multimídia: imagem, desenho, texto, áudio e vídeo. Padrões de codificação de dados multimídia. Processamento de imagem. Técnicas de compressão imagem, áudio e vídeo. Projeto e modelagem de aplicação multimídia. Conceitos de computação gráfica.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7209","prerequisito":"TIC7102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7337":{"codigo":"TIC7337","nome":"Educação à Distância I","ementa":"Conceituação de Educação a Distância (EaD). Histórico da EaD no Brasil. Características, regulamentações,  políticas institucionais da EAD. Modelos de cursos. A Mediação pedagógica na modalidade EaD. A Importância da elaboração do material didático na EAD. Papel do Professor na EaD. Procedimentos de Tutoria em EaD. Exemplo de projetos desenvolvidos para EaD. TV Digital e a Educação. Ambiente Virtual de Aprendizagem.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7207","prerequisito":"TIC7537","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7401":{"codigo":"TIC7401","nome":"Computação Distribuída","ementa":"Arquitetura de Sistemas Distribuídos. Paradigmas de Computação Distribuída: Troca de Mensagens, Cliente\/Servidor, Comunicação em Grupo, Objetos Distribuídos. Comunicação entre Processos. Suporte de SO para Computação Distribuída. Sincronização em Sistemas Distribuídos. Consistência e Replicação de Dados em Sistemas. Distribuídos. Sistemas de Arquivo Distribuídos. Computação GRID.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7132","prerequisito":"TIC7201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7412":{"codigo":"TIC7412","nome":"Engenharia de Software II","ementa":"Análise de requisitos: requisitos funcionais e requisitos não-funcionais; técnicas para levantamento e representação de requisitos, incluindo casos de uso. Modelagem OO: classe, atributo, associação, agregação e herança. Projeto OO: técnicas para projeto; padrões de projeto, componentes e frameworks; projeto de arquitetura. Linguagem de especificação orientada a objetos. Métodos de análise e projeto orientados a objetos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7130","prerequisito":"TIC7313","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7413":{"codigo":"TIC7413","nome":"Banco de Dados II","ementa":"SQL embutida: instruções estáticas e dinâmicas, cursores. Processamento de consultas: otimização algébrica; plano de execução de uma consulta considerando estimativas sobre os dados, índices, buffers e pipelines. Transações: definição, propriedades, estados. Recuperação de falhas: categorias de falhas, gerência de buffer, técnicas de recuperação. Controle de concorrência: teoria da serializabilidade, escalonadores otimistas e pessimistas, tratamento de deadlock. Noções básicas de bancos de dados distribuídos: arquiteturas, projeto, processamento de consultas, gerência de transações. Tópicos avançados em BDs: BDs OO e Objeto-relacionais, BDs semi-estruturados (XML), BDs geográficos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7134","prerequisito":"TIC7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7424":{"codigo":"TIC7424","nome":"Princípios e Ferramentas da Qualidade(Distância)","ementa":"Conceitos Básicos de Qualidade e Gestão da Qualidade; Enfoques para Gestão da Qualidade. Sistemas de Gestão da Qualidade. Custos da Qualidade. Histórico da Qualidade no Brasil. Ferramentas e técnicas para a Qualidade total.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ARA7208","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7435":{"codigo":"TIC7435","nome":"Ambientes Virtuais de Aprendizagem I","ementa":"Introdução ao AVA. Processo de ensino e aprendizagem em um AVA. Tecnologia em AVAs. Avaliação usabilidade de um AVA. Requisitos para o aluno on-line, transição do ensino tradicional para o ensino on-line. Análise e prática didática com as ferramentas de um AVA. Novas tendências em e-learning e e-training corporativos. Definição de requisitos para desenvolvimento ambientes educacionais digitais. Análise, modelagem e desenvolvimento de protótipo de software educacional\/hipermídia educacional.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7211","prerequisito":"TIC7537","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7437":{"codigo":"TIC7437","nome":"Edição e Tratamento de Midias","ementa":"Processamento digital de imagem, áudio e vídeo.  Padrões de codificação de dados multimídia. Representação digital de dados multimídia. Técnicas e tecnologias usadas para captura e digitalização de imagem, desenho, áudio e vídeo. Técnicas de compressão dados multimídia: imagem, áudio e vídeo. A terceira dimensão - computação gráfica. Software de edição, tratamento e manipulação de arquivos digitais de imagem, áudio e vídeo. Desenvolvimento de aplicações multimídia. Tendências.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7133","prerequisito":"TIC7302","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7501":{"codigo":"TIC7501","nome":"Interface Humano-Computador","ementa":"Princípios de Ergonomia em Informática, Interfaces e Usabilidade. Fatores humanos. A comunicação e a semiótica. Conceitos de Usabilidade. Ferramentas avaliação de usabilidade. Critérios e recomendações ergonômicas. Técnicas de concepção, análise e avaliação de Interface Humano-Computador. Design participatório. Objetivo de avaliação de usabilidade. Métodos para avaliação de usabilidade. Acessibilidade na Web. Prática didática com as ferramentas de usabilidade e acessibilidade na web.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7213","prerequisito":"TIC7313","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7513":{"codigo":"TIC7513","nome":"Redes de Computadores II","ementa":"Arquitetura TCP\/IP. Camada de Aplicação: conceitos e protocolos. Camadas de transporte: protocolos TCP e UDP. Camada de rede TCP\/IP: endereçamentos, roteamente e protocolos. Aspectos de segurança em redes de computadores. Administração de redes de computadores.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7128","prerequisito":"TIC7201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7526":{"codigo":"TIC7526","nome":"Análise Gerencial de Custos em TI","ementa":"Princípios e métodos de custos. Análise de custo-volume-lucro. Custo padrão. Método dos centros de custos. Custeio baseado em atividades (ABC). Método da Unidade de Esforço de Produção (UEP). Gestão por atividades (ABM).","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7230","prerequisito":"TIC7226","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7558":{"codigo":"TIC7558","nome":"Estágio Obrigatório I","ementa":"O estágio obrigatório deverá ser realizado nas áreas afins do Curso de Graduação. As atividades de estágio obrigatório estão regulamentadas pela UFSC em http:\/\/www.reitoria.ufsc.br\/estagio\/","carga_horaria":144,"fase_sugestao":5,"equivalencia":"ARA7214","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7624":{"codigo":"TIC7624","nome":"Gestão de Projetos de TI ( Distância )","ementa":"Conceitos básicos de projetos em TI. Fases e gerenciamento de projetos em TI. Aplicação de metodologias. Escopo, objetivos, justificativas, produtos e entregas do projeto. Qualidade, estudo de viabilidade, riscos e custos de projetos em TI. Produção de propostas. Estratégias e ferramentas de apoio a decisão.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ARA7210","prerequisito":"TIC7225","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7659":{"codigo":"TIC7659","nome":"Estágio Obrigatório II","ementa":"O estágio obrigatório deverá ser realizado nas áreas afins do Curso de Graduação. As atividades de estágio obrigatório estão regulamentadas pela UFSC em http:\/\/www.reitoria.ufsc.br\/estagio\/","carga_horaria":144,"fase_sugestao":6,"equivalencia":"ARA7215","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1632":{"codigo":"ZZT1632","nome":"Disciplinas Optativas","ementa":"","carga_horaria":360,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ARA7034":{"codigo":"ARA7034","nome":"Relações Interétnicas","ementa":"Multiculturalismo. Temas de História e cultura Afro-Brasileira e indígena. Grupos étnicos. Processos sócio-culturais de construção de identidade étnicas. Particularidades históricas e processos de diferenciação. Etnicidades e questões raciais, acomodações e conflitos. Sociedades pluriétnicas, cultura e política.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7038":{"codigo":"ARA7038","nome":"Seminários de TCC","ementa":"","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"ARA7218":{"codigo":"ARA7218","nome":"Web Semântica","ementa":"Conceitos fundamentais para a web do futuro. Representação do conhecimento, ontologias, anotações semânticas e inferências. Padrões de linguagem para a representação de conhecimento. Estratégias para a construção de ontologias. Ferramentas para edição, armazenagem, manipulação e visualização de ontologias. Máquinas de inferência. Desenvolvimento de aplicações de web semântica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7129 e ARA7133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7219":{"codigo":"ARA7219","nome":"Tópicos Especiais em Tecnologias Digitais","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7231":{"codigo":"ARA7231","nome":"Tópicos Especiais em Tecnologias Digitais II","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7232":{"codigo":"ARA7232","nome":"Tecnologias de Informação e Comunicação e suas Evoluções","ementa":"Introdução as Tecnologias da Informação e Comunicação (TIC´s). Historia das Telecomunicações. Componentes básicos dos sistemas de Telecomunicações. Sistemas Telefônicos. Sistemas de Comunicação via Rádio. Sistemas de Comunicação via satélites. Sistema de comunicação via meios ópticos. Sistemas de comunicação móveis. Histórico das Comunicações Móveis. Ambiente Móvel Celular. Telefonia Móvel Digital. Tipos de Sistema Rádio Móvel: AMPS, IS-54, GSM, IS-95 e DECT (1; 2; 2,5; 3; 4G - LTE)). Redes de Comunicação de Dados de Alta Velocidade. Tecnologia de Interconexão de Redes. Redes integradas e serviços de telecomunicações. Evolução dos sistemas de telecomunicações. Princípios e tendências.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7233":{"codigo":"ARA7233","nome":"Tópicos Especiais em Tecnologias Digitais IV","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7234":{"codigo":"ARA7234","nome":"Tópicos Especiais em Tecnologias Digitais V","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7512":{"codigo":"TIC7512","nome":"Desenvolvimento de Sistemas para Web","ementa":"Características da arquitetura de aplicações na Web. Paradigma de desenvolvimento de aplicações para a Web. Plataformas para desenvolvimento de aplicações para a web. Banco de Dados para Web. Estudo de casos. Seleção e Estudo de uma linguagem para programação Web para aplicações específicas, de acordo com a evolução tecnológica. WebDesign.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7216","prerequisito":"TIC7413","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7611":{"codigo":"TIC7611","nome":"Circuitos e Técnicas Digitais","ementa":"Simulação de portas CMOS: tensões, correntes, atraso, minimização e mapeamento. Circuitos combinacionais (codificador, decodificador, somador, multiplicador, barrel shifter, unidade lógica e aritmética). Elementos de interconexão (multiplexador, barramento tri- state) e de armazenamento (latch, flip-flop, registrador, célula de memória). Relógio e temporização. Circuitos seqüenciais: registrador de deslocamento e contador. Memórias (DRAM, SRAM, ROM, FLASH). Arranjos lógicos (PAL, PLA, FPGA).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"TIC7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7612":{"codigo":"TIC7612","nome":"Segurança em Serviços Digitais Distribuídos","ementa":"Conceitos básicos de segurança (algoritmos criptográficos, assinatura digital, distribuição de chaves); Autenticação em sistemas distribuídos. Modelos de segurança em sistemas distribuídos; Implementação da segurança em sistemas distribuídos (abordagens centralizadas e baseadas no particionamento); Segurança do WWW (segurança do servidor, segurança da informação em trânsito); Segurança no ambiente Java; Objetos distribuídos e a segurança. Pratica de implementacao de Scripts para integracao de sistemas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7217","prerequisito":"TIC7401","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7613":{"codigo":"TIC7613","nome":"Tópicos Especiais em Tecnologias Digitais","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Tecnologia Digital que promova a integracao das Tecnologias da Informação e Comunicação","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7219","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7223":{"codigo":"ARA7223","nome":"Tópicos Especiais em Educação e Cultura Digital","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7226":{"codigo":"ARA7226","nome":"Plano de Negócios","ementa":"Conceito de Plano de Negócios. Benefícios. Aplicações. Estrutura. Sumário executivo. Descrição da empresa e características do empreendimento. Funções fundamentais do negócio. Planejamento estratégico. Análise do mercado e fatores de competitividade. Produtos e serviços. Estratégicas competitivas. Marketing. Gestão e estrutura organizacional. Plano operacional. Plano financeiro de custeio e de investimentos. Fontes de financiamento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7227":{"codigo":"ARA7227","nome":"Gestão de Pessoas em Negócios Digitais","ementa":"Gestão de pessoas para a inovação e competitividade. Os processos de gestão de pessoas. A gestão de Pessoas na Era Digital. Modelos de Negócios Digitais para integração e relacionamento com stakeholders. Gestão do capital intelectual. Gestão dos profissionais do conhecimento. Gestão da sustentabilidade e inovação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7235":{"codigo":"ARA7235","nome":"Sistema de Financiamento para Ciência, Tecnologia e Inovação","ementa":"Conceito de Inovação; Sistema Nacional de Ciência, Tecnologia e Inovação; Agências Nacionais de Fomento e seus Mecanismos de Financiamento à Inovação; As Fontes de Recursos Reembolsáveis e Não Reembolsáveis; Operações de Risco; Modelos e Parâmetros utilizados pelas Agências para Apresentação e Avaliação dos Programas de Inovação.\".","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7236":{"codigo":"ARA7236","nome":"Gestão de Tecnologia","ementa":"Planejamento estratégico do desenvolvimento tecnológico. Gestão das Tecnologias e do Capital Intelectual nas Organizações. Análises e oportunidades no Desenvolvimento Tecnológico. Organização para a tecnologia. Empreendedorismo x Gestão de Negócios. Projetos de desenvolvimento de produtos e processos de base tecnológica. Ferramentas de Gestão da Tecnologia. Engenharia simultânea. Processos, cenários e atores na Transferência de Tecnologia.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7237":{"codigo":"ARA7237","nome":"Tópicos Especiais em Negócios Digitais IV","ementa":"Disciplina da matriz curricular aberta a tópicos de estudo da área de Negócios Digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7238":{"codigo":"ARA7238","nome":"Tópicos Especiais em Negócios Digitais V","ementa":"Disciplina da matriz curricular aberta a tópicos de estudo da área de Negócios Digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7326":{"codigo":"TIC7326","nome":"Empreendedorismo","ementa":"Conceito de empreendimento, empreendedorismo e intra empreendedorismo. Perfil do empreendedor. Geração de idéias. Análises e oportunidades. Mecanismos e procedimentos para criação de empresas. Qualidade e competitividade. Marketing pessoal e empresarial. Gestão do empreendimento. Fundamentos e componentes do Plano de Negócios. Estudo de Casos e desenvolvimento de protótipo de plano de negócios.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7212","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7524":{"codigo":"TIC7524","nome":"Gestão do Conhecimento","ementa":"Era digital e Era do Conhecimento; Organização do Conhecimento; Princípios e processos da gestão do conhecimento;Desenvolvimento de um ambiente para a gestão do conhecimento;Desenvolvimento de uma estratégia de gestão do conhecimento; Auditoria (mapeamento) de conhecimento; Memória organizacional; Técnicas e tecnologias de suporte a gestão do conhecimento nas empresas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7224","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7525":{"codigo":"TIC7525","nome":"Introdução ao Direito Digital","ementa":"Caracterização das leis de software. Tratamento e sigilo de dados. Ética, privacidade e anonimato. Noções de Direitos Autorais. Responsabilidade civil e penal sobre a tutela da informação. Regulamentação do trabalho do profissional de informática. Legislação relativa aos direitos de defesa do consumidor. Análise da política nacional de informática. Tendências e Projetos de Lei. Propriedade Intelectual. A relevância da Propriedade Intelectual sob o aspecto jurídico, científico e tecnológico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7225","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7625":{"codigo":"TIC7625","nome":"Tópicos Especiais em Negócios Digitais","ementa":"Disciplina da matriz curricular aberta a tópicos de estudo da área de Negócios Digitais que promova a integracao das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7227","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7220":{"codigo":"ARA7220","nome":"Educação à Distância II","ementa":"A escolha de mídias na educação a distância. As implicações da utilização das diferentes mídias no processo de ensino aprendizagem a distância. Elaboração de material impresso e digital para cursos em EaD. Diretrizes para elaboração de aulas por videoconferência\/teleconferência. Desenvolvimento de plano de aula para cursos utilizando a videoconferência\/teleconferência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7239":{"codigo":"ARA7239","nome":"Tópicos Especiais em Educação e Cultura Digital II","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7240":{"codigo":"ARA7240","nome":"Tópicos Especiais em Educação e Cultura Digital III","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7241":{"codigo":"ARA7241","nome":"Tópicos Especiais em Educação e Cultura Digital IV","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7242":{"codigo":"ARA7242","nome":"Tópicos Especiais em Educação e Cultura Digital V","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7436":{"codigo":"TIC7436","nome":"Manifestações Culturais - Redes Sociais Virtuais","ementa":"Definição de Redes sociais. Redes Sociais e relações culturais e tecnologicas. Redes sociais e formação cultural. Comunidades virtuais: resistência e ações sociais. Conceito de Comunidade de prática. Análise e avaliação de redes sociais virtuais e comunidades de prática. Oficinas de desenvolvimento ou avaliação de redes sociais ou comunidade de prática utilizando recursos digitais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7222","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7636":{"codigo":"TIC7636","nome":"Manifestações Culturais - CiberCultura","ementa":"Conceitos de Cibercultura e Ciberespaço: processos e tendências. Ciberarte: arte eletrônica interativa e colaborativa. Mídia locativa. Alternative Reality Game (ARG). Hipertexto, hipermídia e interatividade. Elementos da sintaxe e linguagem cinematográfica: planos, ângulos, enquadramento, movimento de câmera, som, cor, iluminação, cenários. Semiótica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7222","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7637":{"codigo":"TIC7637","nome":"Acessibilidade e Inclusão Digital","ementa":"Contribuir para a sensibilização sobre o uso da TIC - com foco na inclusão digital e social. Analisar projetos, programas e ferramentas com o foco de inclusão digital para pessoas com deficiência, mobilidade reduzida ou idosas. Explorar ferramentas ergonômicas e acessíveis. Elaborar projeto de TIC para usuários com necessidades especiais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7221","prerequisito":"TIC7501","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7638":{"codigo":"TIC7638","nome":"Tópicos Especiais em Educação e Cultura Digital","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integracao das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"ARA7223","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"TIC7148":{"codigo":"TIC7148","nome":"Atividades Complementares I: Seminários","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ARA7006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7248":{"codigo":"TIC7248","nome":"Atividades Complementares II: Monitoria","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ARA7006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7348":{"codigo":"TIC7348","nome":"Atividades Complementares III: Palestras","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ARA7006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7448":{"codigo":"TIC7448","nome":"Atividades Complementares IV: Estágio Extra-Curricular","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ARA7006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7548":{"codigo":"TIC7548","nome":"Atividades Complementares V: Visitas a Empresas","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"TIC7648":{"codigo":"TIC7648","nome":"Atividades Complementares VI: Iniciação Científica","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7007":{"codigo":"ARA7007","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20111":{"id":"472","codigo":20111,"codigo_curso":651,"carga_horaria_ufsc":2880,"carga_horaria_mec":2880,"aulas_semana_min":12,"aulas_semana_esperado":16,"aulas_semana_max":28,"num_periodos_min":6,"num_periodos_esperado":6,"num_periodos_max":11,"descricao":"Referente ao curriculo 20111","ucs":{"ARA7120":{"codigo":"ARA7120","nome":"Introdução à Computação","ementa":"Perfil do profissional da computação. Campo de atuação. Ética profissional. Regulamentação profissional. Estrutura e objetivos do curso. Histórico e evolução dos computadores. Introdução à computação. Características básicas dos computadores: hardware e software. Componentes básicos dos computadores: memória, unidade central de processamento, entrada e saída. Modelo de von Neumann. Software básico e programas aplicativos. Sistemas de numeração: representação numérica e conversão de base.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"TIC7135","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7121":{"codigo":"ARA7121","nome":"Fundamentos Matemáticos para Computação","ementa":"Lógica matemática. Indução finita. Conjuntos. Relações e funções. Contagem. Álgebra booleana. Recursão. Fundamentos de grafos.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"TIC7135","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7122":{"codigo":"ARA7122","nome":"Elaboração de Trabalhos Acadêmicos","ementa":"Normas da ABNT para trabalhos acadêmicos: citações e referências bibliográficas. Fontes de pesquisa. Produção de relatório, resumo e resenha. Técnicas de leitura, produção e apresentação de trabalhos científicos.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"TIC7237","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7140":{"codigo":"ARA7140","nome":"Programação em Computadores I","ementa":"Conceito de algoritmo. Pseudo-código e fluxograma. Estrutura de um algoritmo. identificadores, palavras reservadas, variáveis, constantes, declaração de variáveis, comandos de entrada e saída, estruturas de controle de fluxo, estruturas de dados homogêneas (vetores e matrizes) e heterogêneas (registros). Tipos definidos pelo usuário. Modularização. Introdução à uma Linguagem de Programação de alto nível estruturada. Atividades em laboratório com a linguagem selecionada.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"TIC7113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7201":{"codigo":"ARA7201","nome":"Inovação e Criatividade na Era do Conhecimento","ementa":"Origens Econômica e Sociológica do Processo de Inovação (Pensamento de Schumpeter). Visões da Inovação e da Evolução Tecnológica. Métodos e estratégias de Gestão de Inovação. Conceito em criatividade, o papel da criatividade nas modernas organizações, bloqueios, técnicas do desenvolvimento da criatividade.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"TIC7124","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7202":{"codigo":"ARA7202","nome":"Introdução a Economia","ementa":"Conceito de Economia. Problema Econômico Fundamental. Necessidades, Bens e suas Classificações. Organização Econômica: Elementos dos sistemas econômicos; agentes econômicos; fatores de produção; economia de mercado e economia planificada. Estruturas de Mercado. A decisão de Investir. Fundamentos de matemática financeira Juros; Taxa de Juros; Fluxo de Caixa; Série Uniforme; Valor Futuro; Valor Presente. Indicadores financeiros para análise de projetos de investimentos: Taxa de Mínima Atratividade; Método do Valor Presente Líquido; Índice Benefício\/Custo; Retorno Adicional sobre o Investimento; Taxa Interna de Retorno e Período de recuperação do investimento..","carga_horaria":72,"fase_sugestao":1,"equivalencia":"TIC7226","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7123":{"codigo":"ARA7123","nome":"Organização e Arquitetura de Computadores I","ementa":"Aritmética binária: ponto fixo e flutuante. Unidades lógicas e aritméticas. Barramento de dados e de controle. Hierarquia de memória: cache, interna e externa. Memória virtual. Entrada e saída. Relógio. Ciclo de máquina. Ciclo de instrução. Microprogramas. Instruções que implementam operações, desvio do fluxo de controle e transferência de dados. Conjuntos de instruções: CISC x RISC. Pipeline. Controle de acesso aos dispositivos e resolução de conflitos. Interrupções. Polling. Acesso direto à memória. Evolução da arquitetura dos computadores.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"TIC7101","prerequisito":"ARA7120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7141":{"codigo":"ARA7141","nome":"Programação em Computadores II","ementa":"Ponteiros. Alocação dinâmica. Tipo abstrato de dado. Implementação de estruturas de dados alocadas dinamicamente. Recursividade. Manipulação de arquivos.  Fundamentos de algoritmos de ordenação e pesquisa de dados. Uso de uma linguagem de programação em laboratório.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"TIC7214","prerequisito":"ARA7140","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7203":{"codigo":"ARA7203","nome":"Informática na Educação I","ementa":"História da Informática na Educação. Conceitos das teorias de aprendizagem. Uso de tecnologias de Informação e Comunicação aplicadas as teorias de aprendizagem. Exemplos de softwares educacionais. Avaliação de Software Educacional. Redes sociais na educação. Recursos multimídia como recurso didático. Informática na Educação Especial.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"TIC7537","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7204":{"codigo":"ARA7204","nome":"Introdução  à  Administração","ementa":"Organização como sistema social. Processo de gestão estratégica. Estrutura organizacional. Estilo de gestão, poder, autoridade, delegação e tomada de decisão. Planejamento estratégico e ambiente externo. Controle estratégico. Administração de Recursos Digitais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"TIC7225","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7205":{"codigo":"ARA7205","nome":"Princípios de Marketing","ementa":"Conceitos e abordagens históricas e evolutivas do Marketing. O ambiente de Marketing. O mercado e sua visão de segmentação e posicionamento. Marketing voltado para o valor. Comportamento do consumidor, influência na compra e o processo de decisão de compra. Mix de marketing: produto, preço, praça e promoção. Marketing aplicado aos negócios digitais.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"TIC7325","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7206":{"codigo":"ARA7206","nome":"Sistemas Multimídia I","ementa":"Introdução à multimídia, conceitos e aplicações de hipertexto e hipermídia. Ferramentas de desenvolvimento para multimídia. Conceitos básicos de imagem, textos, gráficos vetoriais, animação por computador, vídeo e áudio. Exemplos de aplicações multimídia.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"TIC7102","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7124":{"codigo":"ARA7124","nome":"Engenharia de Software I","ementa":"Análise de requisitos: requisitos funcionais e requisitos não-funcionais; técnicas para levantamento e representação de requisitos, incluindo casos de uso. Modelagem orientada a objetos. Projeto orientado a objetos: técnicas para projeto; padrões de projeto, componentes e frameworks; projeto de arquitetura. Linguagem de especificação orientada a objetos. Métodos de análise e projeto orientados a objetos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"TIC7313","prerequisito":"ARA7141","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7125":{"codigo":"ARA7125","nome":"Estruturas de Dados I","ementa":"Listas lineares e suas generalizações: listas ordenadas, listas encadeadas, pilhas e filas. Aplicações de listas. Algoritmos de inserção, remoção e consulta. Tabelas de Espalhamento Árvores binária. Métodos de pesquisa. Técnicas de implementação iterativa e recursiva de estruturas de dados.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"TIC7202","prerequisito":"ARA7141","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7126":{"codigo":"ARA7126","nome":"Redes de Computadores I","ementa":"Redes de computadores e a Internet. Camada de aplicação. Camada de transporte. Camada de rede. A camada de enlace e redes locais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"TIC7201","prerequisito":"ARA7121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7127":{"codigo":"ARA7127","nome":"Programação Orientada a Objetos","ementa":"Conceitos de classes, atributos, métodos e objetos. Encapsulamento. Herança. Polimorfismo. Mensagens. Tratamento de exceções. Reusabilidade. Criação e utilização de bibliotecas de classes. Persistência de Objetos. Desenvolvimento de programas utilizando uma linguagem orientada a objetos.\".","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ARA7532 ou TIC7314","prerequisito":"ARA7141","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7207":{"codigo":"ARA7207","nome":"Educação a Distância I","ementa":"Conceituação de Educação a Distância (EaD). Histórico da EaD no Brasil. Características, regulamentações,  políticas institucionais da EAD. Modelos de cursos. A Mediação pedagógica na modalidade EaD. A Importância da elaboração do material didático na EAD. Papel do Professor na EaD. Procedimentos de Tutoria em EaD. Exemplo de projetos desenvolvidos para EaD. TV Digital e a Educação.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"TIC7337","prerequisito":"ARA7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7208":{"codigo":"ARA7208","nome":"Princípios e Ferramentas da Qualidade","ementa":"Conceitos básicos de Qualidade. Formação histórica dos conceitos de Qualidade. Abordagens da Qualidade. Fundamentos e Critérios da Excelência da Gestão pela Qualidade. Qualidade em Serviços. Gestão de Processos. Ciclo PDCA. Ferramentas da Qualidade. Sistemas Certificáveis da Gestão da Qualidade. Gestão da Qualidade com a Tecnologia da Informação.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"TIC7424","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7128":{"codigo":"ARA7128","nome":"Redes de Computadores II","ementa":"Introdução. Redes sem fio e redes móveis. Roteamento. Administração de Redes de Computadores. Segurança. Aplicações.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7513","prerequisito":"ARA7126","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7129":{"codigo":"ARA7129","nome":"Banco de Dados I","ementa":"Introdução aos sistemas de gerência de bancos de dados.  Projeto de banco de dados: conceitual, lógico e físico. Projeto conceitual de dados: entidades, relacionamentos, atributos, generalização e especialização. Projeto lógico para o modelo de dados relacional. Dependências funcionais e normalização. Linguagens de definição e de manipulação de dados. Restrições de integridade e visões. Desenvolvimento de aplicação de banco de dados.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7203","prerequisito":"ARA7125","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7130":{"codigo":"ARA7130","nome":"Engenharia de Software II","ementa":"Evolução da prática de desenvolvimento de software; Critérios de qualidade de artefatos de software; modelos de ciclo de vida; metodologias de desenvolvimento de software; manutenção de software; engenharia reversa; modelagem formal de sistemas; abordagens voltadas ao reuso de software; teste de software; gerenciamento do processo de produção de software e técnicas de apoio ao gerenciamento do processo de produção de software; apoio automatizado ao desenvolvimento de software.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7412","prerequisito":"ARA7124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7131":{"codigo":"ARA7131","nome":"Sistemas Operacionais","ementa":"Histórico e evolução dos sistemas operacionais. Arquitetura de sistemas operacionais. Gerenciamento de processos. Gerenciamento de memória. Gerenciamento de dispositivos de entrada e saída. Sistemas de arquivos. Segurança em sistemas operacionais. Estudos de caso.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7301","prerequisito":"ARA7123 e ARA7125","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7209":{"codigo":"ARA7209","nome":"Sistemas Multimídia II","ementa":"Tecnologias, aplicações e plataforma multimídia. Hardware e software para multimídia. Ferramentas de autoria. Representação de dados multimídia: imagem, gráficos vetoriais, texto, áudio, animação por computador e vídeo. Padrões de codificação de dados multimídia. Conceitos de compressão de imagem, áudio e vídeo. Projeto e modelagem de aplicações multimídia.\".","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7302","prerequisito":"ARA7206","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7210":{"codigo":"ARA7210","nome":"Gestão de Projetos","ementa":"Conceitos básicos de projetos. Fases e gerenciamento de projetos. Aplicação de metodologias. Escopo, objetivos, justificativas, produtos e entregas do projeto. Qualidade, estudo de viabilidade, riscos e custos de projetos. Produção de propostas. Estratégias e ferramentas de apoio a decisão.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"TIC7624","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7132":{"codigo":"ARA7132","nome":"Computação Distribuída","ementa":"Arquitetura de Sistemas Distribuídos. Paradigmas de Computação Distribuída: Troca de Mensagens, Cliente\/Servidor, Comunicação em Grupo, Objetos Distribuídos. Comunicação entre Processos. Suporte de SO para Computação Distribuída. Sincronização em Sistemas Distribuídos. Consistência e Replicação de Dados em Sistemas Distribuídos. Sistemas de Arquivo distribuídos. Computação em GRID.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"TIC7401","prerequisito":"ARA7128 e ARA7131","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7133":{"codigo":"ARA7133","nome":"Inteligência Artificial","ementa":"Introdução e histórico. Teoria de problemas e sua resolução. Paradigmas da IA. Modelagem de Agentes Inteligentes. Métodos de busca. Representação e aquisição de Conhecimento. Métodos de raciocínio. Tratamento de incertezas. Sistemas especialistas. Fundamentos de: lógica nebulosa, redes neurais artificiais e algoritmos genéticos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"ARA7121 e ARA7125","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7134":{"codigo":"ARA7134","nome":"Banco de Dados II","ementa":"SQL embutida. Instruções estáticas e dinâmicas, cursores. Organização física de bancos de dados. Processamento de consultas: Otimização algébrica; plano de execução. Transações: definição, propriedades, estados. Recuperação de falhas: categorias de falhas, gerência de buffer, técnicas de recuperação. Controle de concorrência. Noções básicas de bancos de dados distribuídos. Tópicos avançados em Banco de Dados.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"TIC7413","prerequisito":"ARA7129","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7211":{"codigo":"ARA7211","nome":"Ambientes Virtuais de Aprendizagem","ementa":"Introdução aos Ambientes Virtuais de Aprendizagem (AVA). Processo de ensino e aprendizagem em um AVA em diferentes contextos. Tecnologia em AVAs. Análise e prática das ferramentas de um AVA. Avaliação de usabilidade de um AVA. Tendências em e-learning e e-training corporativos. Análise, modelagem e desenvolvimento de protótipo de um curso no AVA.\".","carga_horaria":72,"fase_sugestao":5,"equivalencia":"TIC7435","prerequisito":"ARA7207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7212":{"codigo":"ARA7212","nome":"Empreendedorismo","ementa":"Empreendedorismo: fundamentos e conceitos. Perfil do empreendedor. Processo empreendedor. Ambientes da inovação: pré-incubadoras, incubadoras e parques tecnológicos. Geração de ideias e análise de oportunidades. Fundamentos e componentes do Plano de Negócios. Mecanismos e procedimentos para criação de empresas. Planejamento de um empreendimento a partir do Modelo Canvas.\".","carga_horaria":72,"fase_sugestao":5,"equivalencia":"TIC7326","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7213":{"codigo":"ARA7213","nome":"Interface Humano - Computador","ementa":"Princípios de Ergonomia Interfaces humano-computador (IHC). Recomendações ergonômicas para IHC. Padrões de projetos em IHC. Ciclo de engenharia de usabilidade. Técnicas de análise contextual, concepção e avaliação. Experiência do usuário. Acessibilidade na Web. Prática didática com as ferramentas de usabilidade e acessibilidade na web.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"TIC7501","prerequisito":"ARA7124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7214":{"codigo":"ARA7214","nome":"Estágio Obrigatório I","ementa":"O estágio obrigatório deverá ser realizado nas áreas afins do Curso de Graduação. As atividades de estágio obrigatório estão regulamentadas pela UFSC em","carga_horaria":108,"fase_sugestao":5,"equivalencia":"TIC7558","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7215":{"codigo":"ARA7215","nome":"Estágio Obrigatório II","ementa":"O estágio obrigatório deverá ser realizado nas áreas afins do Curso de Graduação. As atividades de estágio obrigatório estão regulamentadas pela UFSC em","carga_horaria":108,"fase_sugestao":6,"equivalencia":"TIC7659","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7230":{"codigo":"ARA7230","nome":"Trabalho de Conclusão de Curso","ementa":"Esta disciplina propõe a elaboração de um projeto científico e revisão bibliográfica de um tema definido com o professor orientador.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"ARA7122 e ARA7210","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1692,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1653":{"codigo":"ZZT1653","nome":"Disciplinas Optativas (I,II,III,IV, V)","ementa":"","carga_horaria":360,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ARA7034":{"codigo":"ARA7034","nome":"Relações Interétnicas","ementa":"Multiculturalismo. Temas de História e cultura Afro-Brasileira e indígena. Grupos étnicos. Processos sócio-culturais de construção de identidade étnicas. Particularidades históricas e processos de diferenciação. Etnicidades e questões raciais, acomodações e conflitos. Sociedades pluriétnicas, cultura e política.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"ARA7216":{"codigo":"ARA7216","nome":"Desenvolvimento de Sistemas para WEB","ementa":"Características da arquitetura de aplicações na Web. Paradigma de desenvolvimento de aplicações para a Web. Plataformas para desenvolvimento de aplicações para a web. Banco de dados para Web. Estudo de casos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7512","prerequisito":"ARA7129 e ARA7132","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7217":{"codigo":"ARA7217","nome":"Segurança da Informação e de Sistemas","ementa":"Conceitos básicos de segurança (algoritmos criptográficos, assinatura digital, distribuição de chaves). Autenticação em sistemas distribuídos. Modelos de segurança em sistemas distribuídos. Implementação da segurança em sistemas distribuídos. Segurança do WWW. Objetos distribuídos e a segurança.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7612","prerequisito":"ARA7132","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7218":{"codigo":"ARA7218","nome":"Web Semântica","ementa":"Conceitos fundamentais para a web do futuro. Representação do conhecimento, ontologias, anotações semânticas e inferências. Padrões de linguagem para a representação de conhecimento. Estratégias para a construção de ontologias. Ferramentas para edição, armazenagem, manipulação e visualização de ontologias. Máquinas de inferência. Desenvolvimento de aplicações de web semântica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7129 e ARA7133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7219":{"codigo":"ARA7219","nome":"Tópicos Especiais em Tecnologias Digitais","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7613","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7231":{"codigo":"ARA7231","nome":"Tópicos Especiais em Tecnologias Digitais II","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7232":{"codigo":"ARA7232","nome":"Tecnologias de Informação e Comunicação e suas Evoluções","ementa":"Introdução as Tecnologias da Informação e Comunicação (TIC´s). Historia das Telecomunicações. Componentes básicos dos sistemas de Telecomunicações. Sistemas Telefônicos. Sistemas de Comunicação via Rádio. Sistemas de Comunicação via satélites. Sistema de comunicação via meios ópticos. Sistemas de comunicação móveis. Histórico das Comunicações Móveis. Ambiente Móvel Celular. Telefonia Móvel Digital. Tipos de Sistema Rádio Móvel: AMPS, IS-54, GSM, IS-95 e DECT (1; 2; 2,5; 3; 4G - LTE)). Redes de Comunicação de Dados de Alta Velocidade. Tecnologia de Interconexão de Redes. Redes integradas e serviços de telecomunicações. Evolução dos sistemas de telecomunicações. Princípios e tendências.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7233":{"codigo":"ARA7233","nome":"Tópicos Especiais em Tecnologias Digitais IV","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7234":{"codigo":"ARA7234","nome":"Tópicos Especiais em Tecnologias Digitais V","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de tecnologias digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7224":{"codigo":"ARA7224","nome":"Gestão do Conhecimento","ementa":"Era digital e Era do Conhecimento. Organização do conhecimento. Princípios e processos da gestão do conhecimento. Desenvolvimento de um ambiente para a gestão do conhecimento. Desenvolvimento de uma estratégia de gestão do conhecimento. Auditoria de conhecimento. Memória organizacional. Técnicas e tecnologias de suporte a gestão do conhecimento nas empresas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7524","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7225":{"codigo":"ARA7225","nome":"Introdução ao Direito Digital","ementa":"Caracterização das leis de software. Tratamento e sigilo de dados. Ética, privacidade e anonimato. Noções de Direitos Autorais. Responsabilidade civil e penal sobre a tutela da informação. Regulamentação do trabalho do profissional de informática. Legislação relativa aos direitos de defesa do consumidor. Análise da política nacional de informática. Tendências e Projetos de Lei. Propriedade Intelectual. A relevância da Propriedade Intelectual sob o aspecto jurídico, científico e tecnológico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7525","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7226":{"codigo":"ARA7226","nome":"Plano de Negócios","ementa":"Conceito de Plano de Negócios. Benefícios. Aplicações. Estrutura. Sumário executivo. Descrição da empresa e características do empreendimento. Funções fundamentais do negócio. Planejamento estratégico. Análise do mercado e fatores de competitividade. Produtos e serviços. Estratégicas competitivas. Marketing. Gestão e estrutura organizacional. Plano operacional. Plano financeiro de custeio e de investimentos. Fontes de financiamento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7227":{"codigo":"ARA7227","nome":"Gestão de Pessoas em Negócios Digitais","ementa":"Gestão de pessoas para a inovação e competitividade. Os processos de gestão de pessoas. A gestão de Pessoas na Era Digital. Modelos de Negócios Digitais para integração e relacionamento com stakeholders. Gestão do capital intelectual. Gestão dos profissionais do conhecimento. Gestão da sustentabilidade e inovação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7625","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7235":{"codigo":"ARA7235","nome":"Sistema de Financiamento para Ciência, Tecnologia e Inovação","ementa":"Conceito de Inovação; Sistema Nacional de Ciência, Tecnologia e Inovação; Agências Nacionais de Fomento e seus Mecanismos de Financiamento à Inovação; As Fontes de Recursos Reembolsáveis e Não Reembolsáveis; Operações de Risco; Modelos e Parâmetros utilizados pelas Agências para Apresentação e Avaliação dos Programas de Inovação.\".","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7236":{"codigo":"ARA7236","nome":"Gestão de Tecnologia","ementa":"Planejamento estratégico do desenvolvimento tecnológico. Gestão das Tecnologias e do Capital Intelectual nas Organizações. Análises e oportunidades no Desenvolvimento Tecnológico. Organização para a tecnologia. Empreendedorismo x Gestão de Negócios. Projetos de desenvolvimento de produtos e processos de base tecnológica. Ferramentas de Gestão da Tecnologia. Engenharia simultânea. Processos, cenários e atores na Transferência de Tecnologia.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7237":{"codigo":"ARA7237","nome":"Tópicos Especiais em Negócios Digitais IV","ementa":"Disciplina da matriz curricular aberta a tópicos de estudo da área de Negócios Digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7238":{"codigo":"ARA7238","nome":"Tópicos Especiais em Negócios Digitais V","ementa":"Disciplina da matriz curricular aberta a tópicos de estudo da área de Negócios Digitais que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7220":{"codigo":"ARA7220","nome":"Educação à Distância II","ementa":"A escolha de mídias na educação a distância. As implicações da utilização das diferentes mídias no processo de ensino aprendizagem a distância. Elaboração de material impresso e digital para cursos em EaD. Diretrizes para elaboração de aulas por videoconferência\/teleconferência. Desenvolvimento de plano de aula para cursos utilizando a videoconferência\/teleconferência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7221":{"codigo":"ARA7221","nome":"Informática na Educação II","ementa":"Análise e inserção da informática na educação no ensino fundamental e médio. Análise de Software Educacional para conteúdos curriculares do ensino fundamental, médio e profissionalizante. Tecnologia Inclusiva. Desenvolvimento de recursos didáticos para auxiliar aos professores e alunos da rede de ensino na aplicação de software educacional que apóie o processo ensino-aprendizagem em uma área de conhecimento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7637","prerequisito":"ARA7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7222":{"codigo":"ARA7222","nome":"Redes Sociais e Virtuais","ementa":"Definição de Redes sociais e suas influências culturais, organizacionais e tecnológicas. Tipologia de redes. Noções de Comunidade de prática. Análise e avaliação de redes sociais virtuais e comunidades de prática. Estudos de caso e ou análise de recursos e  ferramentas tecnológicas de análise de redes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7436 ou TIC7636","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7223":{"codigo":"ARA7223","nome":"Tópicos Especiais em Educação e Cultura Digital","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"TIC7638","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7239":{"codigo":"ARA7239","nome":"Tópicos Especiais em Educação e Cultura Digital II","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7240":{"codigo":"ARA7240","nome":"Tópicos Especiais em Educação e Cultura Digital III","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7241":{"codigo":"ARA7241","nome":"Tópicos Especiais em Educação e Cultura Digital IV","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7242":{"codigo":"ARA7242","nome":"Tópicos Especiais em Educação e Cultura Digital V","ementa":"Disciplina da matriz curricular aberta à tópicos de estudo da área de Educação e Cultura Digital que promova a integração das Tecnologias da Informação e Comunicação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7001":{"codigo":"ARA7001","nome":"Programa de Intercâmbio I","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7002":{"codigo":"ARA7002","nome":"Programa de Intercâmbio II","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ARA7006":{"codigo":"ARA7006","nome":"Atividades Complementares: TIC","ementa":"Os procedimentos, bem como os critérios para a realização de atividades complementares do curso de Tecnologias da Informação e Comunicação encontram-se no Regulamento das Atividades Complementares. Para consultar o regulamento, acesse a página do curso em: https:\/\/tic.ufsc.br\/regulamento-atividades-complementares\/","carga_horaria":144,"fase_sugestao":999,"equivalencia":"TIC7148 e TIC7248 e TIC7348 e TIC7448","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ARA7007":{"codigo":"ARA7007","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"ARA7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}}}}