{"codigo":237,"nome":"ENGENHARIA DE PRODUÇÃO - Bacharelado","sigla_centro":"CTC","sigla_departamento":"EPS","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20231":20231},"situacao":0,"situacao_descricao":"regular","num_vagas_total":240,"num_vagas_primeiro_semestre":60,"num_vagas_segundo_semestre":60,"presencial":true,"curriculos":{"20231":{"id":"662","codigo":20231,"codigo_curso":237,"carga_horaria_ufsc":4320,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":20,"aulas_semana_max":31,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao Currículo 2023.1","ucs":{"EGR5213":{"codigo":"EGR5213","nome":"Representação Gráfica Espacial","ementa":"Introdução sobre o funcionamento do sistema visual humano; Formas de visualização humana; Sistema de projeção ortogonal Mongeano; Elementos básicos de construção - ponto, reta, e plano; Mecanismos de determinação de verdadeira grandeza - Rebatimento e Mudança de plano; Construção de objetos (modelagem) envolvendo, intersecção, secção e planificação.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2301":{"codigo":"EPS2301","nome":"Programação para Engenharia de Produção I","ementa":"Fundamentos de lógica de programação: tipos básicos de dados; operadores; estruturas de seleção e repetição. Estruturas de dados. Leitura e manipulação de dados tabelados. Modularização: variáveis locais e globais, funções, recursividade e bibliotecas de funções. Algoritmos: formulação, planejamento e complexidade. Introdução à programação Orientada a Objetos. Fundamentos da linguagem de programação a ser utilizada e sua interface de desenvolvimento. Ferramentas computacionais importantes para Engenheiros de Produção.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EPS7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2302":{"codigo":"EPS2302","nome":"Introdução à Engenharia de Produção","ementa":"Ciência, Tecnologia e Sociedade. A engenharia de produção: Histórico, definição da engenharia de produção e suas sub-áreas. Perfil e competências do engenheiro de produção. Ética, Direitos Humanos e Relações Étnico-Raciais. Exercício profissional: o sistema CONFEA\/CREA. Codificação ética da profissão. Atribuições Profissionais do Engenheiro de Produção. Diretrizes e matriz curricular do curso.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EPS5120 e EPS7029","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EQA5119":{"codigo":"EQA5119","nome":"Química Tecnológica","ementa":"Combustão. Combustíveis. Água potável e industrial. Metais e ligas metálicas. Cerâmicas. Polímeros. Corrosão.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5101":{"codigo":"FSC5101","nome":"Física I","ementa":"Introdução aos conceitos fundamentais da cinemática, dinâmica e estática. Leis de conservação da energia e do momento linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3110":{"codigo":"MTM3110","nome":"Cálculo 1","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3121":{"codigo":"MTM3121","nome":"Álgebra Linear","ementa":"Matrizes. Determinantes. Sistemas lineares. Espaço vetorial real. Produto interno. Transformações lineares. Autovalores e autovetores de um operador linear. Diagonalização. Aplicações da Álgebra Linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5214":{"codigo":"EGR5214","nome":"Desenho e Modelagem Geométrica","ementa":"Introdução  ao  desenho  à  mão  livre.  Normas  para  o  desenho.  Técnicas  fundamentais  de  traçado  à  mão  livre.  Vistas  ortogonais  e  auxiliares.  Perspectivas  isométricas  e  cavaleiras.  Cotagem.  Escalas.  Indicação  do  estado  de  superfícies.  Tolerâncias  e  ajustes  mecânicos.  Introdução  ao  CAD.  Conceitos  básicos  e  tipos  de  modelagem.  Sistemas  de  coordenadas  e  de  entrada  de  dados.  Estratégias  de  criação  de  modelos.  Comandos  de  construção,  edição  e  visualização  de  modelos.  Vistas  secionais.  Representação  de  elementos  de  máquina:  Desenho  dos  elementos  de  união,  Desenho  dos  elementos  de  trasmissão.  Noções  de  projeto  e  de  representação  de  conjuntos  e  detalhes  mecânicos.","carga_horaria":108,"fase_sugestao":2,"equivalencia":"","prerequisito":"EGR5213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2320":{"codigo":"EPS2320","nome":"Introdução a Sistemas de Produção","ementa":"Teoria de Sistemas aplicada à Engenharia de Produção. Modelo de Transformação e tipos de sistemas de produção. Objetivos do sistema de produção. Estratégia de Produção. Projeto de produtos e serviços. Arranjo Físico e Fluxo. Tecnologias de processo. Organização do Trabalho.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"EPS2302","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7002":{"codigo":"EPS7002","nome":"Probabilidade e Modelos Estocásticos","ementa":"Probabilidade: definições, variáveis aleatórias discretas e contínuas; distribuições conjuntas, marginais e condicionais; funções de distribuições de probabilidades: normal, qui-quadrado, exponencial, binominal e Poisson. Processos Estocásticos: definições, cadeias de Markov e matriz de transição. Teoria das filas: sistemas M\/M\/1, M\/M\/c e M\/M\/ck. Simulação: geração de números pseudo-aleatórios, formulação de modelos de simulação; validação do modelo; linguagens de simulação. Noções de confiabilidade de sistemas.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"MTM3110 e MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5002":{"codigo":"FSC5002","nome":"Física II","ementa":"Estudo da Cinemática e Dinâmica da rotação de corpos rígidos. Oscilações e ondas Mecânicas(som). Estática e Dinãmica dos Fluídos. Noções sobre temperatura, calor, princípios da Termodiâmica e teoria cinética dos gases.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"FSC5101 e MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5103":{"codigo":"FSC5103","nome":"Estática para Engenharia","ementa":"Estudo  das  condições  de  equilíbrio  de  partículas  e  de  corpos  rígidos  (estruturas,  vigas,  treliças  etc)  no  plano  e  no  espaço,  envolvendo  o  cálculo  das  reações  em  conexões  padrão  utilizadas  em  engenharia;  cálculo  de  forças  axiais,  esforços  cortantes  e  momentos  fletores  em  estruturas  e  vigas;  cálculo  de  centróides  de  áreas  e  de  volumes  de  figuras  simples  e  de  figuras  compostas;  cálculo  de  momentos  de  inércia  de  chapas  planas  simples  e  compostas  e  de  sólidos  simples  e  compostos;  equilíbrio  de  cabos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"FSC5101 e MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3120":{"codigo":"MTM3120","nome":"Cálculo 2","ementa":"Aplicações da integral definida. Técnicas de integração (por partes, substituição trigonométrica, frações parciais). Integral imprópria. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies. Funções de várias variáveis. Derivadas parciais. Máximos e mínimos de funções de duas variáveis.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5405":{"codigo":"EMC5405","nome":"Fundamentos da Termodinâmica","ementa":"Origens  da  termodinâmica:  aspectos  históricos.  Conceitos  básicos.  Primeira  lei.  Segunda  lei.  Entropia.  Equilíbrio  termodinâmico  (sistemas  homogêneos,  relações  de  Maxwell,  relações  envolvendo  entalpia,  energia  interna  e  entropia;  fator  de  compressibilidade  isotérmica  e  coeficiente  de  compressibilidade  volumétrica;  comportamento  de  gases  reais  e  equações  de  estado;  diagrama  generalizado  para  variações  de  entalpia  a  temperatura  constante;  diagrama  generalizado  para  variações  de  entropia  a  temperatura  constante;  desenvolvimento  de  tabelas  de  propriedades  termodinâmicas a  partir  de  dados  experimentais).  Transições  de  fase.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"FSC5002 e MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5425":{"codigo":"EMC5425","nome":"Fenômenos de Transportes","ementa":"Conceitos fundamentais em mecânica dos fluidos; dimensões e unidades; campos escalar, vetorial e tensorial; viscosidade. Hidrostática; pressão em fluido estático, manômetros; forças sobre superfícies planas e curvas submersas. Análise de escoamento; leis básicas para sistemas e volumes de controle;  conservação da massa; equação da quantidade de movimento linear; primeira lei da termodinâmica; equação de Bernoulli. Escoamento viscoso incompressível; escoamento em tubos;  diagrama de  Moody; perdas de carga distribuidas e localizadas. Conceitos fundamentais em transmissão de calor;  dimensões e unidades; leis básicas  da transmissão de calor; condução, convecção e radiação; mecanismos combinados de transmissão de calor. Condução unidimensional em regime permanente; espessura crítica de isolamento; aletas; estruturas compostas. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"FSC5002 e MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2330":{"codigo":"EPS2330","nome":"Introdução à Economia para Engenharia","ementa":"Oferta e demanda. Teoria do consumidor. Teoria da firma. Estruturas de mercados e formação de preços. \nMercado para fatores de produção. Externalidades e bens públicos.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EPS5222","prerequisito":"MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7000":{"codigo":"EPS7000","nome":"Estatística e Modelos de Previsão","ementa":"Estatística: planejamento de pesquisa e levantamento de dados, amostragem, análise de dados, análise de correlação e regressão, estimação de parâmetros, testes de hipóteses paramétricos e não paramétricos. Previsão: médias móveis e decomposição de séries, Holt-Winters e outros métodos determinísticos. Regressão simples e múltipla. Modelos ARIMA.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5113":{"codigo":"FSC5113","nome":"Física III","ementa":"Análise dos principais fenômenos da eletricidade  e magnetismo abrangendo o estudo de campo elétrico, potencial elétrico, capacitor, corrente elétrica, força eletromotriz, campo magnético e indução eletromagnética.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"FSC5002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5202":{"codigo":"INE5202","nome":"Cálculo Numérico em Computadores","ementa":"Erros e Sistemas de Numeracão. Solução de equações algébricas e transcendentais. Solução de equações polinomiais. Sistemas de equações lineares e não lineares. Interpolação Ajustamento de curvas. Integração numérica. Solução numérica de equações diferenciais ordinárias e sistemas de equações diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EPS2301","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3103":{"codigo":"MTM3103","nome":"Cálculo 3","ementa":"Integração múltipla: integrais duplas e triplas. Noções de cálculo vetorial: curvas e superfícies. Campos escalares e vetoriais. Integrais de linha e de superfícies. Teoremas de Green, Stokes e da Divergência.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5201":{"codigo":"EMC5201","nome":"Materiais de Engenharia","ementa":"Materiais  e  Engenharia.  Ligações  químicas  e  seu  efeito  nas  propriedades  dos  principais  Materiais  de  Engenharia.  Estruturas  Cristalinas.  Defeitos  em  Sólidos.  Difusão  em  Sólidos.  Propriedades  Mecânicas  dos  Metais.  Falhas  em  Metais.Diagramas  de  Equilíbrio.  Análise  microestrutural  de  Materiais,  principais  processamentos  de  materiais  metálicos  e  sua  correlação  com  microestrutura  e  propriedades  resultantes  no  material.Transformações  de  fases  em  metais:  reações  perlítica,  bainítica  e  martensítica.Tratamentos  térmicos  em metais:  recozimento,  normalização,  têmpera,  revenido,  solubilização  e  precipitação.  Estrutura,  Propriedades  e  Processamento  de  Cerâmicas  de  Alto  Desempenho.  Estrutura,  Propriedades  e  Processamento  de  Plásticos  de  Engenharia.  Noções  de  Propriedades  e  Processamento  de  Materiais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EQA5119","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2340":{"codigo":"EPS2340","nome":"Modelagem e Análise de Decisão","ementa":"A Teoria da decisão e suas abordagens. Abordagem normativa, descritiva e prescritiva. As limitações da \nracionalidade. Modelagem de problemas de decisão: alternativas, influências do ambiente e preferências. \nEstruturação de problemas: matriz e árvore de decisão. Princípio da Dominância. Decisão sob incerteza. Decisão \nsob risco. Princípio de Bernoulli. Avaliação e levantamento da informação. Noções sobre decisão com múltiplos \nobjetivos: função de valor, método AHP, métodos outranking.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EPS7009","prerequisito":"EPS2330 e EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2341":{"codigo":"EPS2341","nome":"Gestão da Segurança e Saúde no Trabalho","ementa":"Segurança e Saúde no trabalho. Riscos Ambientais. Equipamentos de proteção individual. Sinalização de \nsegurança. Normatização e legislações aplicadas a Gestão da Segurança e Saúde no Trabalho. Primeiros Socorros \ne Prevenção a Incêndios. Metodologias e Técnicas de Gerenciamento e Análise de Riscos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"EPS2320 e EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS5235":{"codigo":"EPS5235","nome":"Planejamento e Controle da Produção","ementa":"Visão geral dos sistemas de produção. Planejamento estratégico da produção. Planejamento mestre da produção. Programação da produção: administração de estoques, seqüenciamento,emissão e liberação de ordens. Acompanhamento da produção.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"EPS2320 e EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5122":{"codigo":"FSC5122","nome":"Física Experimental I","ementa":"Complementação  dos conteúdos de mecânica, acústica, termologia. Obtida através de montagem e realização de experiências, em número de 12 (doze), versando sobre os tópicos acima.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5207":{"codigo":"FSC5207","nome":"Mecânica II - Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Dinâmica da partícula e do corpo rígido.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"FSC5002 e MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3131":{"codigo":"MTM3131","nome":"Equações Diferenciais Ordinárias","ementa":"Equações diferenciais ordinárias de primeira ordem. Equações diferenciais ordinárias lineares homogêneas de ordem n. Equações diferenciais ordinárias lineares não homogêneas de ordem 2. Noções gerais de Transformada de Laplace. Sistemas de Equações Diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"MTM3120 e MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5128":{"codigo":"EMC5128","nome":"Mecânica dos Sólidos A","ementa":"Conceitos de projeto. Concepção, projeto preliminar, projeto detalhado, análise. Tipos de análise. Análise experimental, análise por simulação com modelos. Tipos de modelos. Modelos mecânicos, modelos matemáticos, modelos numéricos. Tipos de modelos usados em Mecânica dos Sólidos: barras, vigas, placas, cascas, sólidos. Identificação e idealização dos modelos quanto a sua forma geométrica, carregamento, materiais e condições de contorno. Solicitações internas. Reações. Diagramas. Esforços em treliças. Tensões. Estados de tensão. Equações diferenciais de equilíbrio. Transformação de tensões e deformações. Critérios de falha. Tensões uniaxiais, pinos, colunas, tensões em treliças. Deformações, definições, relações deformação-deslocamento. Transformação de deformações. Diagramas tensão-deformação, Lei de Hooke. Deformações axiais em barras e problemas hiperestáticos em barras. Flexão simples plana, obliqua, seções assimétricas. Cisalhamento em vigas longas. Torção. Solicitações compostas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"FSC5103 e MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5202":{"codigo":"EMC5202","nome":"Usinagem dos Materiais","ementa":"Conceituação  e  relevância  da  técnica  de  usinagem  dos  materiais  na  obtenção  de  componentes  e  produtos  de  engenharia  com  elevado  valor  agregado,  mediante  transformação  da  forma  e  dimensões  da  matéria-prima.  Conceito,  caracterização  e  funções  do  sistema  máquina  -  ferramenta  -  peça.  Sistemas,  processos  e  fundamente  da  usinagem  por  ação  mecânica  com  ferramentas  de  geometria  definida  e  não  definida;  por  ação  térmica  e  termo-química;  as  principais  variáveis  de  processo  em  cada  caso.  Fenômenos  térmicos,  mecânicos  e  químicos  envolvidos  nos  processos  de  usinagem.  Ferramenta  para  usinagem:  fundamentação  geométrica;  os  materiais  envolvidos  na  construção  destas;  os  mecanismos  de  desgaste  e  falha  (falência)  das  ferramentas,  as  principais  famílias  de  sistemas  (máquinas  ferramenta),  suas  características  e  aplicações.  Determinação  dos  custos  de  usinagem  e  análise  de  produtividade.  Os  defeitos  introduzidos  nos  produtos  usinados  por  ação  de  processos  e  as  conseqüências  desses  defeitos  para  a  aplicação  e  desempenho  dos  produtos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMC5201","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5236":{"codigo":"EMC5236","nome":"Medição de Grandezas Mecânicas","ementa":"Noções sobre experimentação. Grandezas a medir. Sistemas de medição. Características estatísticas e dinâmicas. Medição elétrica de grandezas mecânicas. Aparelhos para indicação e registro. Transdutores ativos. Transdutores passivos. Sistema de medição digital. Automação da medição.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2350":{"codigo":"EPS2350","nome":"Introdução a Finanças para Engenharia","ementa":"Princípios e procedimentos contábeis básicos. Demonstrativos financeiros. Indicadores financeiros e de \ndesempenho. Análise financeira de empresas.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS7010","prerequisito":"EPS2330","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2351":{"codigo":"EPS2351","nome":"Gerenciamento de Projetos","ementa":"Conceito de projeto. Fases e componentes de um projeto. Estruturas organizacionais e o gerenciamento de projetos. Planejamento e controle de projetos. O gerente de projeto e as competências interpessoais. Portfólio em gestão de projetos. Modelos de gerenciamento ágil e tradicional de projetos. Ferramentas computacionais de apoio ao projeto. Tendências e oportunidades em gerenciamento de projetos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS7005":{"codigo":"EPS7005","nome":"Pesquisa Operacional","ementa":"Introdução: histórico, objetivos, restrições e modelos. Condições de otimalidade. Programação linear: modelos de programação linear, método simplex, dualidade, análise de sensibilidade e pós-otimalidade. Problemas lineares especiais.Programação não-linear; otimização multivariada; otimização sem restrições. Programação Inteira, Binária e Mista: algoritmos e modelos. Programação Dinâmica determinística e estocástica.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EPS2301 e EPS2340","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7060":{"codigo":"EPS7060","nome":"Gestão Ambiental","ementa":"Fundamentos da questão ambiental. Modelos de produção e sustentabilidade. Ferramentas da gestão ambiental. Leis e normas ambientais e métodos de avaliação de impactos. Gerenciamento de resíduos. Desastres ambientais.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"EPS2320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2306":{"codigo":"EPS2306","nome":"Projeto Integrado I","ementa":"Conceitos relevantes para os projetos na temática de Modelagem do Negócio. Escolha de problemas. \nDesenvolvimento de Soluções. Apresentação dos resultados e\/ou soluções à organização.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2000,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2360":{"codigo":"EPS2360","nome":"Engenharia da Qualidade","ementa":"Introdução à Engenharia da Qualidade: métodos quantitativos de diagnóstico, monitoramento e otimização \ndirigidos à garantia da qualidade. Introdução ao Controle Estatístico da Qualidade: Gráficos de controle para \nvariáveis, Gráficos de controle para atributos. Estudos de Capacidade do processo. Planejamento e Avaliação de \nExperimentos: a otimização experimental de processos.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2361":{"codigo":"EPS2361","nome":"Análise de Dados","ementa":"Gerenciamento na Era da Informação. Gestão da Informação e o Suporte à Decisão. Ferramentas Computacionais \ne linguagens de programação. Fundamentos de bancos de dados. Fluxo de Projeto de análise de dados. \nVisualização da Informação e Dados. Tecnologia da Informação e BI. Implantação de Projetos de TI e de análise \nde dados.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS7000 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2362":{"codigo":"EPS2362","nome":"Ergonomia","ementa":"Introdução à Ergonomia. Princípios de Fisiologia do trabalho. Antropometria e Biomecânica. Princípios de Organização do trabalho. Condições Ambientais de trabalho. Princípios de Psicologia do trabalho. Princípios de Design Universal. O Projeto do trabalho. Análise Ergonômica do Trabalho (AET). Normativas vigentes.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS2341","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2363":{"codigo":"EPS2363","nome":"Análise de Custos para Engenharia","ementa":"Princípios e métodos de custeio. Análise custo-volume-lucro. Custo padrão. Método dos centros de custos. Custeio \nbaseado em atividades (ABC). Método da unidade de esforço de produção (UEP).","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS2350","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS7019":{"codigo":"EPS7019","nome":"Engenharia Econômica","ementa":"- Matemática Financeira: conceito de juros; relações de equivalência; taxas nominais e efetivas; amortização de dívidas (Price, SAC e Misto). Inflação e correção monetária. Análise econômica de investimentos: princípios e conceitos; VAUE, TIR e Pay-back; substituição de equipamentos; aluguel, leasing e financiamentos. Risco, incerteza e análise de sensibilidade. Calculadoras financeiras e planilhas.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS2340 e EPS2350","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7024":{"codigo":"EPS7024","nome":"Métodos Quantitativos na Gestão da Produção Industrial","ementa":"Introdução: Teoria da Produção; fatores de produção; planejamento e controle da produção; caracterização dos sistemas de produção. 2 Linhas de Produção: Introdução e formulação do problema; procedimentos heurísticos; sequenciamento de linhas mistas (múltiplos produtos). Plano Mestre da Produção (16 horas-aula) - Introdução e objetivos; políticas de encomendas; modelos dinâmicos de determinação de lotes; métodos heurísticos; modelos considerando capacidade limitada. Programação da Produção:  Introdução e definição do problema; flow-shop com uma máquina; flow-shop com duas ou mais máquinas; job shop; regras de despacho. Planejamento de Materiais: Introdução; heurísticas para definição de lotes de material na produção com múltiplos estágios; cálculo das necessidades de material; MRP. Tecnologia de Grupo: Definições; codificação e classificação de peças; algoritmos de clusterização.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS5235 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5113":{"codigo":"EEL5113","nome":"Eletrotécnica Geral","ementa":"Noções básicas de Eletricidade. Circuitos Elétricos. Transformadores. Motores Elétricos. Medidas Elétricas.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"FSC5113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5203":{"codigo":"EMC5203","nome":"Conformação de Metais e Moldagem de Polímeros","ementa":"Classificação  e  descrição  sumária  dos  diversos  processos  de  conformação  mecânica.  Tecnologia  e  campos  de  aplicação  dos  processos  de  forjamento,  laminação,  trefilação  e  extrusão.  Processos  de  conformação  de  chapas:  operação  de  corte,  dobramento,  estiramento  e  embutimento.  Introdução  a  estampabilidade  de  chapas.  Ferramentas.  Máquinas  utilizadas.  Fundamentos  do  processamento  de  polímeros.  Moldagem  por  extrusão  Moldagem  por  sopro.  Termoformagem. Moldagem  por  injeção.    Variantes  do  processo  e  tipos  de  moldes.  Projeto  e  fabricacao  de  moldes  com  CAE\/CAD\/CAM.  Confecção  de  moldes  com  técnicas","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMC5201 e EMC5236","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2370":{"codigo":"EPS2370","nome":"Logística e Cadeia de Suprimentos","ementa":"Conceito e Evolução da Logística e Cadeia de suprimentos. Os fluxos logísticos e efeito chicote na cadeia. Logística de Suprimento. Logística Reversa. Distribuição Física e canais de distribuição. Nível de serviço e custos logísticos (trade-off). Os elementos do mix logístico. Processamento de pedidos. Estoques. Armazéns. Transporte. Lotes de compras. O sistema logístico. Tecnologias aplicadas à logística. Tendências em logística.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS2363 e EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2371":{"codigo":"EPS2371","nome":"Metodologia de Pesquisa","ementa":"Fundamentos da metodologia científica: Método científico, seus elementos, etapas e aplicabilidade na \nengenharia de produção. Métodos e técnicas de pesquisa típicas na engenharia de produção. Instrumentos de \ncoleta de dados. O pré-projeto de pesquisa e o projeto final de pesquisa. A comunicação científica. \nDocumentação e redação de trabalhos científicos. Normas para Elaboração de Trabalhos Acadêmicos (normas \nABNT e outras).","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2372":{"codigo":"EPS2372","nome":"Engenharia de Métodos","ementa":"Projeto de Métodos. Técnicas de registro e análise do processo. Análise do posto de trabalho. Metodologias de resolução de problemas. Programas de participação do trabalhador na melhoria dos métodos de trabalho. Medida do trabalho: cronometragem, amostragem do trabalho e tempos pré-determinados.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS7022","prerequisito":"EPS2362","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2373":{"codigo":"EPS2373","nome":"Simulação de Eventos Discretos","ementa":"Natureza e características da simulação. Tipos de simulação. Mecanismos de avanço do tempo da simulação \ndiscreta. Metodologia de simulação. Testes de aderência de dados. Verificação e validação de modelos. Análise \nde resultados de uma simulação.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS7005 e EPS7024","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2374":{"codigo":"EPS2374","nome":"Gestão de Operações de Serviços","ementa":"Contextualização e relevância dos serviços na economia. Características e classificação de serviços. Estratégia e processos de serviços. Design em serviços. Avaliação da qualidade em serviços. Experiência do cliente. Modelos de negócio em serviços. Integração produto-serviço. Princípios da servitização. Tecnologia em serviços.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2375":{"codigo":"EPS2375","nome":"Planejamento de Unidade Produtivas Ext 18h-a)","ementa":"Noções de planejamento empresarial. Metodologia para elaboração dos anteprojetos. Estudos de mercado. \nDefinição das estratégias de competitividade do anteprojeto. Modelagem de Negócios. Análise do processo \nprodutivo. Estudo de tamanho e escala produtiva. Estudos de localização. Determinação do investimento. \nProjeção de fluxo de caixa. Análise de viabilidade econômica. Análise de viabilidade financeira. Análise de Riscos.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS2306 e EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2307":{"codigo":"EPS2307","nome":"Projeto Integrado II","ementa":"Conceitos relevantes para os projetos na temática de Modelagem do Negócio. Escolha de problemas. \nDesenvolvimento de Soluções. Apresentação dos resultados e\/ou soluções à organização.","carga_horaria":108,"fase_sugestao":8,"equivalencia":"","prerequisito":"EPS2306","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2380":{"codigo":"EPS2380","nome":"Projeto de Instalações","ementa":"Unidades de uma instalação: produtiva e administrativa. Arranjo físico: conceito, tipos de arranjo físico, estudo \ndo fluxo, dimensionamento de áreas, métodos para elaboração de arranjo físico, layout de almoxarifado, layout \nde células de produção. Movimentação e Armazenagem de Materiais: conceitos e equipamentos.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"EPS2372 e EPS2375","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2381":{"codigo":"EPS2381","nome":"Gestão da Qualidade","ementa":"A gestão da qualidade e os novos processos de gestão. Qualidade e as novas tendências na manufatura avançada. Modelos de relações com o mercado e a sociedade. A gestão da qualidade e a sobrevivência das organizações. Gestão da qualidade, revoluções industriais e inovação. A gestão da qualidade e os processos de manutenção e ampliação de mercados. Qualidade total. Gestão da qualidade em serviços. Gestão operacional da qualidade. Estratégias e ferramentas para a gestão e avaliação da qualidade. Gestão tática da qualidade. Gestão estratégica da qualidade.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS7023","prerequisito":"EPS2360","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2382":{"codigo":"EPS2382","nome":"Desenvolvimento de Produtos","ementa":"Fundamentos e Fases do Desenvolvimento de Produto; Estrutura do processo de desenvolvimento de produto; \nProblema de projeto; Projeto preliminar: requisitos dos clientes e do produto; Projeto conceitual e geração de \nsoluções; Diretrizes para o Projeto Detalhado; Técnicas e ferramentas para o desenvolvimento de novos \nprodutos.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EPS7021","prerequisito":"EPS2351","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2900,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2383":{"codigo":"EPS2383","nome":"Manutenção e Confiabilidade","ementa":"Medidas de confiabilidade e distribuições de tempo de vida. Confiabilidade de componentes em série e paralelo. \nFMEA e FTA. A função manutenção. Manutenção Corretiva. Manutenção Preventiva. Manutenção Preditiva. \nManutenção Centrada em Confiabilidade. Manutenção Produtiva Total.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"EPS2361 e EPS2372","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2384":{"codigo":"EPS2384","nome":"Projeto Final de Curso I","ementa":"Planejamento técnico do trabalho junto com o orientador escolhido; Elaboração do cronograma do trabalho; \nDefinição da metodologia e das ferramentas a serem empregadas no trabalho; Busca da literatura.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"EPS2371","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2390":{"codigo":"EPS2390","nome":"Sistemas de Produção Enxutos","ementa":"Introdução e conceitos. Cultura e Estratégia enxuta. Manufatura enxuta. Logística enxuta. Outras abordagens enxutas.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"EPS2370 e EPS2372","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS2391":{"codigo":"EPS2391","nome":"Projeto Final Curso II","ementa":"Aplicação prática dos tópicos estudados no curso de Engenharia de Produção, na forma de projetos técnicos e\/ou científicos ao nível dos atribuídos a um engenheiro.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"EPS2384","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT0002":{"codigo":"ZZT0002","nome":"Optativa II","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6458":{"codigo":"ZZT6458","nome":"Optativa III","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6459":{"codigo":"ZZT6459","nome":"Optativa IV","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6655":{"codigo":"ZZT6655","nome":"Optativa V","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6656":{"codigo":"ZZT6656","nome":"Optativa VI","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EPS2310":{"codigo":"EPS2310","nome":"Estágio Supervisionado em Engenharia de Produção","ementa":"","carga_horaria":216,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT6690":{"codigo":"ZZT6690","nome":"Disciplina Optativa VII","ementa":"","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6691":{"codigo":"ZZT6691","nome":"Disciplina Optativa VIII","ementa":"","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EPS0123":{"codigo":"EPS0123","nome":"Gerenciamento por Processos","ementa":"Introdução e conceitos. Cadeia de valor de processos. Modelos para Gerenciamento por processos. Notação para Gerenciamento de processos de Negócio. Indicadores-chave de desempenho. Projetos de melhoria em Gerenciamento por processos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2351","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS0223":{"codigo":"EPS0223","nome":"Manufatura  Avançada","ementa":"Conceitos e evolução. Planejamento e controle integrado de processos produtivos em sistemas de manufatura. Gestão da manufatura avançada. Transformação digital de sistemas produtivos. Sistemas produtivos distribuídos, manufatura avançada (inteligente, digital, conectada e social) e manutenção inteligente. Aplicação de conceitos, tecnologias e métodos avançados de apoio à tomada de decisão baseados em simulação, otimização e orientados a dados. Panorama, tendências e oportunidades. Tópicos especiais em sistemas de manufatura.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2373 e EPS2383 e EPS7024","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS0323":{"codigo":"EPS0323","nome":"Seis Sigma","ementa":"Fundamentos do programa seis sigma. Projetos seis sigma para a melhoria da qualidade e produtividade. Implementação do programa seis sigma. Outras aplicações do seis sigma.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2381","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS0423":{"codigo":"EPS0423","nome":"Economia Circular","ementa":"Economia Circular: histórico e conceituação. Modelos de negócios circulares. As mudanças na cadeia de suprimentos. Barreiras, capacitadores e aceleradores da economia circular. Aplicações práticas da economia circular em modelos de negócios.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7060","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS0523":{"codigo":"EPS0523","nome":"Planejamento de Sistemas Logísticos","ementa":"Conceitos e evolução. Sistemas Produtivos e Logísticos. Projeto de sistemas logísticos. Planejamento e integração de processos produtivos, logísticos e de transporte. Aplicação de modelagem e simulação para apoiar o projeto de sistemas logísticos. Panorama, tendências e oportunidades. Tópicos especiais em planejamento de sistemas logísticos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2370 e EPS2373","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS0623":{"codigo":"EPS0623","nome":"Gestão da Cadeia de Suprimentos","ementa":"Conceitos e evolução. Tipos de cadeias de suprimentos. Integração de processos e coordenação de cadeias de suprimentos. Colaboração, cooperação e gestão de relacionamentos. Modelos para análise e aprimoramento de desempenho. Cadeias de suprimentos globais. Sustentabilidade na Cadeia de Suprimentos. Panorama, tendências e oportunidades. Tópicos especiais em cadeias de suprimentos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2370","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS0723":{"codigo":"EPS0723","nome":"Modelagem de Sistemas Logísticos","ementa":"Introdução. Estoques: modelo de lote econômico com demanda constante; modelo de lote econômico com demanda variável; modelo de lote econômico com demanda aleatória; modelo de estoque e precificação. Localização de Instalações: problema de p-medianas; problema de p-centros; planejamento da cadeia de suprimentos; localização do estoque de segurança. Problemas de Roteirização: problema de caminhos mínimos; problema do caixeiro viajante; problema do carteiro chinês; VRP capacitado; VRP com restrições de janela de tempo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2370 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS2308":{"codigo":"EPS2308","nome":"Projeto Integrado III (Modelagem Quantitativa de Dados","ementa":"Conceitos relevantes para os projetos na temática de Modelagem Quantitativa de Dados. Escolha de problemas. Desenvolvimento de Soluções. Apresentação dos resultados e\/ou soluções à organização.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS3023":{"codigo":"EPS3023","nome":"Disciplina de Pós Graduação I","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3123":{"codigo":"EPS3123","nome":"Disciplina de Pós-Graduação II","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3223":{"codigo":"EPS3223","nome":"Disciplina de Pós Graduação III","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3323":{"codigo":"EPS3323","nome":"Disciplina de Pós Graduação IV","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3423":{"codigo":"EPS3423","nome":"Disciplina de Pós Graduação V","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3523":{"codigo":"EPS3523","nome":"Disciplina de Pós Graduação VI","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS0823":{"codigo":"EPS0823","nome":"Finanças Corporativas","ementa":"Risco e retorno, teoria das carteiras, estrutura de capital, política de dividendos e financiamento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS0923":{"codigo":"EPS0923","nome":"Análise de Dados II","ementa":"Introdução ao Aprendizado Máquina (Machine learning); Exploração e visualização dos dados usando uma ferramenta estatística; prototipagem, avaliação e validação de modelos de Machine Learning; Aprendizado supervisionado\/Não supervisionado; Problemas de regressão; Problemas de classificação; Problemas de clusterização; Técnicas avançadas de treinamento; Procedimentos e técnicas para estruturação de análises; Boas práticas para execução de análises compartilhadas e reprodutíveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2361","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS1023":{"codigo":"EPS1023","nome":"Avaliação de Ativos","ementa":"Avaliação de renda fixa: características dos títulos de renda fixa, precificação, rendimento, risco e inadimplência, estrutura a termo da taxa de juros; Avaliação de empresas: avaliação por fluxo de caixa descontado, avaliação relativa; Análise de riscos: sensibilidade, cenários, simulação de Monte Carlo; Introdução à tópicos especiais em avaliação de ativos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS1123":{"codigo":"EPS1123","nome":"Programação para Engenharia de Produção II","ementa":"Fundamentos de lógica de programação: tipos básicos de dados; operadores; estruturas de seleção e repetição. \nEstruturas de dados. Leitura e manipulação de dados tabelados. Modularização: variáveis locais e globais, \nfunções, recursividade e bibliotecas de funções. Algoritmos: formulação, planejamento e complexidade. \nIntrodução à Programação Orientada a Objetos. Fundamentos da linguagem de programação a ser utilizada e \nsua interface de desenvolvimento. Ferramentas computacionais importantes para Engenheiros de Produção.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2301","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS1323":{"codigo":"EPS1323","nome":"Business Intelligence e Visualização de Dados","ementa":"Visualização e análise de dados. Tipos de visualizações e seus usos. Dashboards e Business Intelligence. Percepção visual e princípios do design aplicados a dashboards. Construção de dashboards estáticos e dashboards interativos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2361","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS1423":{"codigo":"EPS1423","nome":"Simulação de Sistemas Dinâmicos","ementa":"Introdução: simulação discreta e simulação contínua. Conceito de retroalimentação e conceito de defasagem temporal. Estruturação do problema. Formulação e construção do modelo: notação, diagramação e linguagens de representação de modelos. Verificação e validação do modelo. Análise de sensibilidade. Formulação e avaliação de cenários. Aplicações nas áreas de manufatura, serviços, energia e outras.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS2373","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EPS3623":{"codigo":"EPS3623","nome":"Disciplina de Pós Graduação VII","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3723":{"codigo":"EPS3723","nome":"Disciplina de Pós Graduação VIII","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3823":{"codigo":"EPS3823","nome":"Disciplina de Pós Graduação IX","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS3923":{"codigo":"EPS3923","nome":"Disciplina de Pós Graduação  X","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS4023":{"codigo":"EPS4023","nome":"Disciplina de Pós Graduação XI","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS4123":{"codigo":"EPS4123","nome":"Disciplina de Pós Graduação XII","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EPS2300":{"codigo":"EPS2300","nome":"AACCs (Atividades Complementares)","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS0023":{"codigo":"EPS0023","nome":"Ações de Extensão","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"}}}}}