{"codigo":607,"nome":"ENGENHARIA CIVIL DE INFRAESTRUTURA [Campus Joinville]","sigla_centro":"CTJ","sigla_departamento":"EMB","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20122":20122,"20161":20161,"20251":20251},"situacao":0,"situacao_descricao":"regular","num_vagas_total":250,"num_vagas_primeiro_semestre":25,"num_vagas_segundo_semestre":25,"presencial":true,"curriculos":{"20122":{"id":"511","codigo":20122,"codigo_curso":607,"carga_horaria_ufsc":4374,"carga_horaria_mec":3600,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20122","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5003":{"codigo":"EMB5003","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos, elementos básicos de construção reta, plano e ponto. Construção de objetos envolvendo intersecção, secção, planificação e modelagem. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5035","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5004":{"codigo":"EMB5004","nome":"Introdução a Engenharia","ementa":"Contextualização à vida acadêmica (a universidade, o curso de engenharia da mobilidade, o currículo, serviços de apoio, laboratórios). Contextualização à vida profissional. Funções do engenheiro no contexto tecnológico e social. O mercado de trabalho na engenharia. Métodos científicos na resolução de problemas de engenharia. Introdução à atividade profissional do engenheiro: especificação, projeto, implementação, construção de protótipos e testes para problemas, dispositivos e situações da engenharia da mobilidade. Gestão da inovação e da tecnologia. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. Tutoria na disciplina consciente. A responsabilidade dos estudantes na disciplina consciente. Responsabilidade social. Diferenças vs desigualdades. A igualdade étnico racial na engenharia.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5038 e EMB5832","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5006":{"codigo":"EMB5006","nome":"Química Tecnológica","ementa":"Estrutura Atômica. Ligações Químicas. Mol. Estequiometria. Combustão e Combustíveis. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Corrosão metálica: Oxidação-redução. Equação de Nernst. Mecanismos de corrosão. Meios corrosivos. Métodos de controle e monitoramento da corrosão. Polímeros: Estrutura química de polímeros. Cristalinidade. Propriedades químicas. Propriedades mecânicas. Principais polímeros de uso geral. Tratamento de águas. Tratamento de efluentes industriais. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5028":{"codigo":"EMB5028","nome":"Comunicação e Expressão","ementa":"Comunicação e linguagem: diversos tipos de linguagem verbal e não verbal. Aspectos fundamentais para a construção de textos. Estrutura e produção de textos com base em parâmetros da linguagem técnico-científica: resumo, resenha, relatório, artigo. O texto acadêmico e as normas da ABNT. Metodologia científica. Formas de comunicação oral: características. Técnicas de apresentação em público.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5037","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5002":{"codigo":"EMB5002","nome":"Fisica - Introdução à Mecânica","ementa":"Unidades de medida e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação da quantidade de movimento.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5034","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5010":{"codigo":"EMB5010","nome":"Estatística e Probabilidade","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5013":{"codigo":"EMB5013","nome":"Introdução à Programação de Computadores","ementa":"Componentes básicos de um computador. Sistemas de numeração. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos), tipos de dados, estruturas de seleção e repetição, fluxo de execução (modularização), estruturas de dados homogêneas (vetores e matrizes), manipulação de arquivos. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5600","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5008","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5032":{"codigo":"EMB5032","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EMB5020","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5009":{"codigo":"EMB5009","nome":"Termodinâmica","ementa":"Introdução e conceitos básicos. Trabalho e calor. Propriedades de substâncias puras. Primeira lei da termodinâmica. Primeira lei da termodinâmica aplicada a volumes de controle. Segunda lei da termodinâmica. Entropia e a segunda lei da termodinâmica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5011":{"codigo":"EMB5011","nome":"Estática","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Cálculo de centróides de áreas e de volumes de figuras simples e compostas. Análise de forças distribuídas como cargas concentradas. Cálculo de momento de inércia de superfície para áreas simples e compostas. Cálculo de momento de inércia de massa para sólidos simples e compostos. Análise de Treliças, Estruturas e Máquinas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5026":{"codigo":"EMB5026","nome":"Ergonomia e Segurança","ementa":"Conceitos básicos. Fisiologia do trabalho. Antropometria e Biomecânica. Variáveis ambientais: iluminação e cores, ruído, vibrações, temperatura. Introdução à análise ergonômica do trabalho. Cognição no trabalho. Ergonomia do produto. Segurança no trabalho.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5008","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5033":{"codigo":"EMB5033","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características de sistemas de medição; Calibração; Estimativa de incerteza de medição; Especificação geométrica; Medição de comprimento, ângulo, forma e rugosidade.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EMB5018","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5015":{"codigo":"EMB5015","nome":"Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Cinemática do \tponto material, Dinâmica do  ponto   material. Trabalho, Energia e Momento linear. Cinemática dos corpos rígidos.  Dinâmica dos corpos rígidos. Energia, Impulso linear e Impulso angular para corpos rígidos.  Vibrações forçadas sem amortecimento. Vibrações forçadas com amortecimento.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5041","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5017":{"codigo":"EMB5017","nome":"Mecânica dos Fluidos","ementa":"Conceitos fundamentais. Estática dos fluidos. Formulação integral e diferencial das leis de conservação. Escoamento invíscido incompressível. Análise dimensional e semelhança. Escoamento interno viscoso incompressível: escoamento laminar completamente desenvolvido e escoamento em tubos e dutos. Escoamento externo viscoso incompressível: teoria da camada limite e forças de arrasto e sustentação sobre corpos imersos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5027":{"codigo":"EMB5027","nome":"Metodologia de Projeto de Produto","ementa":"Introdução: A visão do projeto e do produto no contexto histórico, ambiental, e de custo. Importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos. Projeto preliminar: modelagem, análise e simulação de soluções de projeto; projeto detalhado. Construção e teste de protótipos. Aplicações: produtos em engenharia veicular; transporte, infraestrutura, sistemas embarcados em nível de software e hardware. Noções de Engenharia de Sistemas.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5042","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5031":{"codigo":"EMB5031","nome":"Eletromagnetismo","ementa":"Lei de Coulomb. O Campo Elétrico e Potencial Eletrostático. Capacitância e Capacitores. Corrente Elétrica. Campo Magnético. A Lei de Ampere. A Lei da Indução. Circuitos. As Equações de Maxwell.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5043 ou FSC5113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5103":{"codigo":"EMB5103","nome":"Transmissão de Calor I","ementa":"Mecanismos básicos de transmissão de calor. Princípios básicos da condução de calor. Condução unidimensional em regime permanente. Condução bidimensional em regime permanente. Condução em regime transiente. Métodos numéricos aplicados. Princípios básicos da radiação térmica. Radiação entre superfícies. Introdução à convecção.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5205 ou EMC5417","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5201":{"codigo":"EMB5201","nome":"Geologia da Engenharia","ementa":"Estrutura e dinâmica interna da Terra. Minerais. Rochas ígneas, metamórficas e sedimentares. Estruturas dos maciços rochosos. Água subterrânea. Processos da dinâmica superficial. Geologia do Brasil. Tecnologia de rochas na construção civil. Métodos de investigação de campo. Cartas de Geologia de Engenharia. Classificação dos maciços rochosos. Geologia de Engenharia aplicada a túneis, barragens, taludes e rodovias.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5834","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5203":{"codigo":"EMB5203","nome":"Geoprocessamento","ementa":"Conceitos Básicos. Sistemas de Projeções. Sistema de Informações Geográficas. Estrutura de Dados Geográficos. Análise e Modelagem Espacial. Aplicações em Transportes. Histórico. Representação de dados: raster, vetorial e não espacial. Captura de dados espaciais; Transformação raster-vetorial; Sistemas de coordenadas e projeção; Técnicas de representação gráfica. Modelagem de dados: alfanuméricos, cartográficos, topológicos e redes. Análise de dados espaciais com uso de GIS. Geoestatística. Softwares e uso de computadores. Uso de GPS.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5933","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5204":{"codigo":"EMB5204","nome":"Sistemas de Transportes","ementa":"Concepções da estrutura urbana e transporte urbano. Planejamento de transportes. Qualidade e Produtividade nos transportes. Aspectos técnicos e econômicos das modalidades de transportes. Coordenação das modalidades de transportes. Viabilidade econômica de projetos rodoviários. Transportes especializados. Os transportes no Brasil e novas perspectivas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5211":{"codigo":"EMB5211","nome":"Planejamento e Controle de Projetos e Construções","ementa":"Metodologia de planejamento. Representação gráfica de projetos (redes); Determinação de datas, folgas e caminhos críticos; PERT - Program Evaluation and Review Technique; CPM - Critical Path Method; Cronograma físico. Cronograma físico-financeiro. Análise de viabilidade econômica de projetos. Administração da construção. Modalidades de contratos de obras. Licitações. Caderno de encargos, memorial descritivo. Leis sociais aplicadas a construção de infraestrutura. Orçamentação de obras. Métodos heurísticos para alocação de recursos. Controle físico-financeiro.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5846","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5806":{"codigo":"EMB5806","nome":"Mecânica dos Sólidos II","ementa":"Análise de tensões: estado triaxial de tensões. Aplicação do círculo de Mohr à análise tridimensional de tensões. Critérios de escoamento e de fratura: critérios de ruptura de Tresca, de Von Mises e de MohrCoulomb. Tubos de parede fina submetidos à pressão interna. Tubos de parede fina. Casca de revolução. Análise tridimensional das deformações específica. Dimensionamento de vigas. Projeto de vigas prismáticas. Cálculo de deslocamentos em estruturas. Cálculo da deformação das vigas por integração direta. Equação da linha elástica. Vigas estaticamente indeterminadas. Trabalho de deformação. Colunas. Estabilidade das estruturas. Fórmula de Euler para colunas com extremidades articuladas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ECV5214 ou EMB5839","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5825":{"codigo":"EMB5825","nome":"Topografia I","ementa":"Medidas diretas de distâncias. Medidas de ângulos horizontais. Instrumentos topográficos. Orientação: Norte Magnético, Geográfico e de quadricula. Métodos de levantamento planimétrico e classes de precisão. Planimetria: Poligonais aberta, fechada, enquadrada. Cálculos de área. Desenho topográfico.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5202","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5109":{"codigo":"EMB5109","nome":"Gestão Industrial","ementa":"A empresa como sistema, Evolução do pensamento administrativo, Planejamento Estratégico, Gestão de recursos materiais e humanos. Planejamento e Controle da Produção, Empreendedorismo. Noções de Economia.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5206":{"codigo":"EMB5206","nome":"Engenharia de Tráfego","ementa":"Elementos de Engenharia de tráfego: vias, veículos e usuários. Características do tráfego: fluxo, velocidade, volume, densidade, headway, tempo de viagem e atrasos. Pólos geradores de tráfego.  Estacionamentos. Dispositivos de controle de tráfego. Dimensionamento de semáforos. Fluxo de tráfego: abordagem macroscópica, microscópica e mesoscópica. Segurança viária. Capacidade e Níveis de Serviço.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5927","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5214":{"codigo":"EMB5214","nome":"Custos e Orçamentação","ementa":"Fundamentos de contabilidade. Principais demonstrações. Princípios e métodos de custos. Análise de custo-volume-lucro. Custo padrão. Custeio baseado em atividades. Método das unidades de esforço de produção. Gestão por atividades. Custos unitários de serviços de infraestrutura: terraplenagem, pavimentação, conservação e restauração. Custos de Operação de veículos. Orçamentos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5840","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5801":{"codigo":"EMB5801","nome":"Mecânica dos Solos I","ementa":"Origem e formação dos solos. Índices físicos. Estrutura. Plasticidade e consistência. \nCompacidade. Classificação (TRB, MCT). Classificação dos solos tropicais e subtropicais. Uso da \npedologia na estimativa de comportamento geotécnico. Características e propriedades de \nengenharia de horizontes lateríticos e saprolíticos. Comportamento dos solos residuais das \nprincipais rochas brasileiras. Permeabilidade. Percolação. Pressões dos solos. Compressibilidade \ne adensamento dos solos. Exploração do subsolo. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5844","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5805":{"codigo":"EMB5805","nome":"Materiais de Construção","ementa":"Emprego dos materiais de construção: metais, polímeros, cerâmicas, madeira e betuminosos. Agregados e aglomerantes hidráulicos. Aditivos químicos e adições minerais. Propriedades das argamassas e concretos. Ensaios de laboratório. Normas técnicas que regem os materiais de construção.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5835","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5829":{"codigo":"EMB5829","nome":"Topografia II","ementa":"Altimetria. Nivelamento Geométrico, Trigonométrico e taqueométrico. Representações de relevo. Levantamento Planialtimétrico. Marcação e interpretação de curvas de nível. Locações de obra. Topografia automatizada. Noções de terraplenagem. Aplicação de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5202","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5923":{"codigo":"EMB5923","nome":"Projeto e Operação de Terminais","ementa":"Conceituação geral e função dos terminais de transportes. Caracterização e especificidades dos terminais e estações de cargas e de passageiros dos modais rodoviário, ferroviário, metroviário, dutoviário, aquaviário e aéreo. Áreas de estacionamentos. Estudos de Localização. Componentes físicos: edificações e supraestrutura. Regulamentos e normas para o projeto de terminais. Relação entre o dimensionamento das instalações, o arranjo físico e as capacidades de armazenamento e de transporte. Tecnologias e equipamentos de movimentação de cargas e pessoas. Nível de serviço do transporte de cargas e de passageiros. Indicadores de desempenho de terminais. Terminais intermodais. Aspectos relacionados à expansão das instalações.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5212","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5208":{"codigo":"EMB5208","nome":"Legislação de Concessões e Contratos","ementa":"Aspectos da concessão de serviço público. Os poderes do poder concedente. Espécies de contratos administrativos. Legislação das licitações e das concessões. Espécies de concessões. Responsabilidades do poder concedente e do concessionário. As concessões no sistema de transportes. Equilíbrio econômico financeiro dos contratos de concessão. A intervenção judicial. Controles administrativos. Controles de qualidade do serviço.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"ECV5333","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5803":{"codigo":"EMB5803","nome":"Estruturas de Concreto Armado I","ementa":"Concreto armado. Estado limite último. Dimensionamento de vigas à flexão simples e cisalhamento. Cálculo e distribuição de armaduras e detalhamento.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5847","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5804":{"codigo":"EMB5804","nome":"Hidráulica Geral","ementa":"Conceito de hidrostática e hidrodinâmica. Escoamento em condutos forçado e condutos livres, Máquinas hidráulicas: bombas e turbinas. Orifícios, bocais, bueiros, tubos curtos e vertedores. Medição de vazão","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5838","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5807":{"codigo":"EMB5807","nome":"Projeto de Terminais","ementa":"Diferentes aspectos e abordagens do projeto arquitetônico. Condicionantes estéticas: linguagens e tendências arquitetônicas. Leitura, análise e crítica de projeto. Planta de situação, locação. Plantas baixas com layout. Cortes e Perspectivas. Simbologia e convenções do projeto arquitetônico. Análises conceituais e estudo de alternativas. Acessibilidade-escadas, rampas, plataformas para cadeirantes e idosos. Bioclimática aplicada ao projeto. Aplicações em CAD (desenho assistido por computador) para diversos tipos de projetos. Detalhamento de projetos. Normas e regulamentos de projetos de terminais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5837","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5808":{"codigo":"EMB5808","nome":"Mecânica dos Solos II","ementa":"Compactação dos solos. Índice de suporte Califórnia. Resistência ao cisalhamento dos solos. Estabilidade de Taludes. Empuxos de terra. Estruturas de contenção. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5851","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5810":{"codigo":"EMB5810","nome":"Elementos e Técnica de Infraestrutura","ementa":"Modalidade de serviços. Equipamentos de terraplanagem. Execução da terraplanagem. Análise e composição de custos. Planejamento e controle de obras. Estudos de impacto ambiental. Aplicação de ferramentas computacionais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5852","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5830":{"codigo":"EMB5830","nome":"Projeto Geométrico e Capacidade de Vias","ementa":"Características e elementos técnicos gerais para o projeto de rodovias e vias urbanas. Estudos de traçado. Critérios para a escolha de diretrizes de rodovias. Concordância horizontal: circular simples e com transição. Locação de eixos. Superelevação. Superlargura. Distâncias de visibilidade. Concordância vertical. Cálculo do greide. Volumes de terraplenagem. Interseções.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5210 ou EMB5841","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5802":{"codigo":"EMB5802","nome":"Hidrologia Aplicada","ementa":"Sistema de tratamento de água. Sistema de abastecimento de água. Sistema de coleta e transporte de esgoto. Sistema de tratamento esgoto. Sistema de drenagem urbana. Sistema de resíduos sólidos (acondicionamento, coleta e transporte e tratamento de resíduos sólidos)","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5843 ou ENS5102","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5811":{"codigo":"EMB5811","nome":"Pavimentação de Vias","ementa":"Conceitos e tipos de pavimentos. Comportamento mecânico das estruturas de pavimento. Projeto geotécnico. Comportamento dinâmico dos solos. Estudos de materiais para pavimentação: características e propriedades. Dosagem de misturas asfálticas. Usinas asfálticas. Estudo do Tráfego. Dimensionamento e execução de pavimentos asfálticos, poliédricos e concreto de cimento Portland. Conservação e Restauração de Vias. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"ECV5154 ou EMB5856","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5812":{"codigo":"EMB5812","nome":"Estruturas de Concreto Armado II","ementa":"Lajes de concreto armado. Carregamento nas lajes. Esforços solicitantes. Reações das lajes nas \nvigas. Dimensionamento das lajes. Disposições construtivas. Disposições construtivas de norma. \nLajes mistas: detalhamento e cuidados de projeto\/execução. Laje cogumelo e sapatas: analogias \nde cálculo. Detalhamento. Reservatórios convencionais e cuidados nos cálculos simplificados. \nPilares de concreto armado. Esforços solicitantes. Instabilidade local. Instabilidade global. Limite \nde deformação. Limite de abertura de fissuras. Pilares: tipos conforme a esbeltez. Pilares curtos e  \n47 esbeltez intermediária. Flexão compressão: definições e cálculo simplificado. Cálculo pelo \nprocesso expedito e pelo processo exato. Quadro de carga e tabelamento (visando padronização) \nde pilares. Detalhamento. Função dos estribos.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"ECV5262 ou EMB5854","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5813":{"codigo":"EMB5813","nome":"Instalações Elétricas","ementa":"Introdução sobre sistema elétrico. Concepção de um projeto elétrico. Previsão de carga. Características e dimensionamento de condutores, dutos e proteção. Tipos de tomadas, comandos e disjuntores. Cálculo de demanda. Padrão de entrada de energia. Segurança em eletricidade. Circuito elétrico e quadro de distribuição. Normas técnicas sobre instalações. Montagem de circuitos com proteção, iluminação e tomada. Luminotécnia. Projeto de uma instalação elétrica predial.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EMB5849","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5814":{"codigo":"EMB5814","nome":"Instalações Hidráulicas","ementa":"Compatibilização entre projetos.  Dimensionamento de instalações de água fria e quente, de esgoto sanitário. Sistemas preventivos de combate a incêndio. Esgotamento de águas pluviais. Instalações prediais de gases combustíveis (GLP - Gás Liquefeito de Petróleo e Gás Natural  GN). Materiais empregados nas instalações.  Noções sobre construções bioclimáticas.  Conservação e uso racional de água em edificações.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EMB5850","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5817":{"codigo":"EMB5817","nome":"Fundações","ementa":"Investigação geotécnica: princípios e execução dos ensaios SPT, CPT, Vane Test, Pressiômetro, Dilatômetro, condutividade hidráulica. Parâmetros geotécnicos derivados dos ensaios. Fundações superficiais e profundas: métodos de capacidade de carga, dimensionamento geotécnico, estimativa de recalques, casos especiais, aspectos executivos. Dimensionamento estrutural de sapatas e blocos. Patologias e reforços de fundações","carga_horaria":72,"fase_sugestao":8,"equivalencia":"ECV5135 ou EMB5857","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5821":{"codigo":"EMB5821","nome":"Planejamento do Trabalho de Conclusão de Curso","ementa":"A pesquisa e o método científico. Formulação do problema de pesquisa. Construção de hipóteses. Tipos e características da pesquisa. Elaboração de projetos de pesquisa. Nesta etapa será proposto o projeto para o trabalho de conclusão do curso, tendo o seguinte conteúdo: Título, tema, problematização, hipóteses, objetivos, justificativa, fundamentação teórica, metodologia, resultados esperados, cronograma e relação das principais referências.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5044 ou EMB5618","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3024,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5831":{"codigo":"EMB5831","nome":"Tecnologia Aplicada à Infraestrutura de Transportes","ementa":"Incerteza em medições: conceitos e generalidades. Instrumentos: classificação e tipos. Instrumentos controlados por computador. Interface instrumento-computador. Transdutores e instrumentos comuns para infraestrutura de transportes. Técnicas de instrumentação de infraestruturas e ensaios. Utilização de softwares específicos para cálculos infraestruturais. Análise de resultados.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5809","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5815":{"codigo":"EMB5815","nome":"Obras Portuárias e Aeroviárias","ementa":"(Aeroportos) Noções Gerais da Aviação Civil. Características da aeronave relacionadas com o projeto do aeroporto. Controle de Tráfego Aéreo. Planejamento do Aeroporto. Projeto Geométrico da área de pouso. Planejamento da área terminal. Sinalização. Dimensionamento de pavimentos. Drenagem. Impactos no meio ambiente. (Portos) Morfologia Fluvial. Hidrometria e batimetria fluviais. Hidráulica de canais aplicada a projetos de navegação fluvial. Melhoramento dos cursos d'água naturais para navegação: obras de melhoramentos gerais ou de normalização, obras de regularização do leito, obras de canalização, obras de transposição de desníveis (eclusas e outras), canais artificiais. Proteção de margens de hidrovias. Embarcações e comboios para navegação fluvial. Projeto de hidrovias. Estruturas de atracação interiores e portos fluviais. Exploração e conservação das vias de navegação interior. Tráfego nos portos. Regime dos rios. Portos marítimos.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5859 e EMB5865","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5816":{"codigo":"EMB5816","nome":"Pontes e Concreto Protendido","ementa":"Conceitos gerais pontes. Superestrutura. Sistema Estutural e Construtivo.  Perfis tipo  I  Pré-Moldados.  Formação do Trem Tipo. Aparelhos de apoio. Esforços nas  Longarinas  e  Transversinas. Ligação Laje-Viga I. Dimensionamento e Detalhamento. Sistema Estrutural Estaiado com Tabuleiro de Concreto,  Geometria  do Estaiamento  (Leque\/ Paralelo\/Assimétrico), Modelação do Sistema Tabuleiro-Estai-Mastro, Critérios e Verificações Básicas de Projeto. Conceitos gerais de concreto protendido. Sistemas de protensão. Efeito do esforço normal nas tensões. Flexão. Verificação das tensões em serviço. Critérios de projeto. Estado limite último. Fissuração. Traçado da armadura. Traçado dos cabos. Perdas de protensão. Perdas imediatas. Perdas progressivas. Cisalhamento. Tópicos especiais.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5860","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5818":{"codigo":"EMB5818","nome":"Estruturas Metálicas e Materiais Compósitos","ementa":"Aço: definição e processo de fabricação; diferenças entre ferro e aço. Aço para construção: CA (Concreto Armado), CP (concreto protendido) e telas soldadas.  Aços dúteis e frágeis. Categorias e resistência característica. Diagramas tensão-deformação. Estruturas de aço. Métodos de segurança e Método dos Estados Limites. Propriedades do aço estrutural. Peças tracionadas simples e compostas. Peças comprimidas, simples e compostas. Ligações com parafusos. Ligações com solda. Peças fletidas, resistência ao momento fletor. Peças fletidas, resistência da alma. Peças submetidas à flexão composta reta. Vigas mistas aço concreto. Materiais compósitos.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5862","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5820":{"codigo":"EMB5820","nome":"Ferrovias, Metrovias e Túneis","ementa":"(Ferrovias e Metrovias) Generalidades sobre o sistema de transporte ferroviário e metroviário. Modelo institucional (organização da estrutura operacional). Componentes do sistema de transporte ferroviário e metroviário. Análise econômica das ferrovias e metrovias. Infra e superestrutura da via permanente. Dimensionamento da via permanente, dormentação, lastreamento, bitola, velocidade diretriz. Normas específicas. Execução, conservação e proteção da via permanente. Sistemas de tração. Sinalização. Instalações complementares (pátios, estações, oficinas, etc). Planejamento de operação das vias e dos trens. Eficiência de uma ferrovia e de uma metrovia. Tarifas e custos ferroviários e metroviários. (Túneis) Sistemas de classificação geomecânica, túneis em rocha, túneis em solos, processos executivos, métodos de dimensionamento, influência em construções vizinhas.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5861","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5822":{"codigo":"EMB5822","nome":"Trabalho de Conclusão de Curso","ementa":"Consolidação dos conhecimentos obtidos no Curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações da área da mobilidade.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5045","prerequisito":"EMB5821","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5823":{"codigo":"EMB5823","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":396,"fase_sugestao":10,"equivalencia":"EMB5046","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3492,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5019":{"codigo":"EMB5019","nome":"Ética e Disciplina Consciente","ementa":"Ética, Moral, Valores, e Ética Profissional. O Código de Ética como ferramenta para o fortalecimento da Cultura Organizacional. Disciplina Consciente. Tutoria na Disciplina Consciente. A Responsabilidade dos Alunos na Disciplina Consciente. Responsabilidade Social.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5023":{"codigo":"EMB5023","nome":"Fundamentos em Engenharia da Mobilidade","ementa":"Conceito de engenharia da mobilidade: veicular e de transporte. Processo global da engenharia de transportes e de infraestrutura. O planejamento, projeto e operação de transportes. Caracterização dos sistemas veiculares: Sistemas motrizes; estruturas; sistemas de navegação; embarcados; acessórios; e de comunicação. Caracterização dos sistemas de transporte: armazenar, transportar, distribuir, operar, manter e gerenciar.  Fatores de integração dos modais de transporte: portos, aeroportos, ferrovias, hidrovias e vias terrestres, sistemas de controle, comunicação, e integração de pessoas e de cargas. Fatores ambientais: riscos e impactos decorrentes da presença do mobiliário na operação sistemas, para o meio ambiente e para as populações","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5024":{"codigo":"EMB5024","nome":"Sistemas Hidráulicos e Pneumáticos","ementa":"Definição de sistemas hidráulicos e pneumáticos. Campo de aplicação e características. SISTEMAS HIDRÁULICOS: Estrutura típica dos circuitos hidráulicos. Características construtivas e comportamentais dos principais componentes: bombas e atuadores lineares e rotativos, válvulas de controle direcional, de pressão e de vazão. Circuitos hidráulicos básicos. SISTEMAS PNEUMÁTICOS: Estrutura típica dos circuitos pneumáticos. Características construtivas e modelos comportamentais dos principais componentes: atuadores lineares e rotativos e ventosas, válvulas de controle direcional, de pressão e de vazão. Circuitos pneumáticos básicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5098","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5097","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5099":{"codigo":"EMB5099","nome":"Estágio Não Obrigatório","ementa":"Estágio Não Obrigatório","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5209":{"codigo":"EMB5209","nome":"Tecnologias Aplicadas a Transporte","ementa":"Princípio de funcionamento, aplicação, operação, exploração dos dados de equipamentos em: Contagem e pesagem de tráfego em baixa e alta velocidade (WIM); controle e gestão de tráfego; investigação e auscultação da estrutura das vias (FWD), das camadas das vias (Georradar), de maciços terrosos e pétreos; controle de qualidade do serviço e da superfície das vias (Barra laser, Griptester).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMB5809 ou EMB5831","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1602,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5213":{"codigo":"EMB5213","nome":"Logística","ementa":"Conceitos básicos. Gerenciamento de cadeia de suprimentos. Gerenciamento de cadeias de distribuição. Custos logísticos. Avaliação de desempenho logístico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5819":{"codigo":"EMB5819","nome":"Conservação e Restauração de Pavimentos","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1458,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"}}},"20161":{"id":"535","codigo":20161,"codigo_curso":607,"carga_horaria_ufsc":4392,"carga_horaria_mec":3600,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao Curriculo 20161","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5034":{"codigo":"EMB5034","nome":"Física I","ementa":"Unidades de medida e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação da quantidade de movimento. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5002 ou EMB5048 ou FSC5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5035":{"codigo":"EMB5035","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos, elementos básicos de construção reta, plano e ponto. Construção de objetos envolvendo intersecção, secção, planificação e modelagem. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5003 ou EMB5055","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5037":{"codigo":"EMB5037","nome":"Comunicação e Expressão","ementa":"Componentes da linguagem científica e elementos para pesquisa bibliográfica. Estrutura do trabalho técnico e de pesquisa segundo normas ABNT. Aspectos fundamentais para a construção de textos. Gêneros textuais acadêmicos. Leitura e interpretação de textos.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5028 ou EMB5062","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5038":{"codigo":"EMB5038","nome":"Ciência, Tecnologia e Sociedade","ementa":"Definições de ciência, tecnologia e técnica. Desenvolvimento tecnológico e social. Relações entre ciência, tecnologia e sociedade. Desafios para o perfil do engenheiro contemporâneo. Funções do engenheiro no contexto tecnológico e social. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. A igualdade étnico racial na engenharia. Direitos humanos.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5004 ou EMB5063","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5832":{"codigo":"EMB5832","nome":"Introdução à Engenharia Civil de Infraestrutura","ementa":"-Contextualização à vida acadêmica (a universidade, o curso de engenharia da mobilidade, o currículo, serviços de apoio, laboratórios). Contextualização à vida profissional. Funções do engenheiro no contexto tecnológico e social. O mercado de trabalho na engenharia. Métodos científicos na resolução de problemas de engenharia. Introdução à atividade profissional do engenheiro: especificação, projeto, implementação, construção de protótipos e testes para problemas, dispositivos e situações da engenharia da mobilidade. Gestão da inovação e da tecnologia.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5004","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5006":{"codigo":"EMB5006","nome":"Química Tecnológica","ementa":"Estrutura Atômica. Ligações Químicas. Mol. Estequiometria. Combustão e Combustíveis. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Corrosão metálica: Oxidação-redução. Equação de Nernst. Mecanismos de corrosão. Meios corrosivos. Métodos de controle e monitoramento da corrosão. Polímeros: Estrutura química de polímeros. Cristalinidade. Propriedades químicas. Propriedades mecânicas. Principais polímeros de uso geral. Tratamento de águas. Tratamento de efluentes industriais. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5036","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5039":{"codigo":"EMB5039","nome":"Física II","ementa":"Gravitação. Estática e dinâmica de fluidos. Oscilações. Ondas mecânicas e acústicas. Temperatura. Calor. Teoria cinética dos gases. Leis da termodinâmica. Máquinas térmicas. Refrigeradores. Entropia. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5009 e EMB5017 e EMB5103","prerequisito":"EMB5001 e EMB5034","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5600":{"codigo":"EMB5600","nome":"Programação I","ementa":"Introdução a arquitetura de computadores. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos) e fluxograma, tipos de dados, estruturas de seleção e repetição, fluxo de execução, modularização (funções e procedimentos), estruturas de dados homogêneas (vetores e matrizes). Introdução a apontadores. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5013 ou EMB5648","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5833":{"codigo":"EMB5833","nome":"Desenho Técnico Aplicado à Infraestrutura","ementa":"-Linguagem de projetos de edificações e estruturais. Desenho e interpretação com uso de CAD. Nomenclaturas e definições. Normas de desenho de plantas, cortes, elevações, coberturas e detalhes em geral.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5035","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5010":{"codigo":"EMB5010","nome":"Estatística e Probabilidade","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5057","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5011":{"codigo":"EMB5011","nome":"Estática","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Cálculo de centróides de áreas e de volumes de figuras simples e compostas. Análise de forças distribuídas como cargas concentradas. Cálculo de momento de inércia de superfície para áreas simples e compostas. Cálculo de momento de inércia de massa para sólidos simples e compostos. Análise de Treliças, Estruturas e Máquinas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5005 e EMB5034","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5600","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5006","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5007 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5120":{"codigo":"EMB5120","nome":"Gestão e Organização","ementa":"Histórico da teoria geral da administração. Abordagens básicas e evolução do pensamento administrativo. Conceito de Administração e funções administrativas. Gestão da Produção e Operações. Estratégia de Produção e Operações. Noções de Planejamento e Controle da Produção. Just in Time e Operações Enxutas. Gestão da Qualidade. Gestão de Pessoas. Noções de Empreendedorismo.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5109","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5825":{"codigo":"EMB5825","nome":"Topografia I","ementa":"Medidas diretas de distâncias. Medidas de ângulos horizontais. Instrumentos topográficos. Orientação: Norte Magnético, Geográfico e de quadricula. Métodos de levantamento planimétrico e classes de precisão. Planimetria: Poligonais aberta, fechada, enquadrada. Cálculos de área. Desenho topográfico.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EMB5866","prerequisito":"EMB5833","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5007 e EMB5016 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5040":{"codigo":"EMB5040","nome":"Fenômenos de Transporte","ementa":"Conceitos fundamentais em mecânica dos fluidos. Hidrostàtica. Análise Integral. Equacão de Bernoulli. Escoamento viscoso incompressível. Conceitos fundamentais em transmissão de calor: Condução unidimensional em regime permanente, Convecção e Radiação. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5017 e EMB5103","prerequisito":"EMB5030 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5041":{"codigo":"EMB5041","nome":"Dinâmica","ementa":"Cinemática dos corpos rígidos. Dinâmica dos corpos rígidos. Princípio do trabalho e energia, quantidade de movimento, impulso linear e angular para corpos rígidos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EMB5015","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5043":{"codigo":"EMB5043","nome":"Física III","ementa":"Lei de Coulomb. O Campo Elétrico e Potencial Eletrostático. Capacitância e Capacitores. Corrente Elétrica. Campo Magnético. A Lei de Ampere. A Lei da Indução. Circuitos. As Equações de Maxwell. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5031","prerequisito":"EMB5030 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5829":{"codigo":"EMB5829","nome":"Topografia II","ementa":"Altimetria. Nivelamento Geométrico, Trigonométrico e taqueométrico. Representações de relevo. Levantamento Planialtimétrico. Marcação e interpretação de curvas de nível. Locações de obra. Topografia automatizada. Noções de terraplenagem. Aplicação de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EMB5867","prerequisito":"EMB5825","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5834":{"codigo":"EMB5834","nome":"Geologia de Engenharia","ementa":"Estrutura e dinâmica interna da Terra. Sismos e Vulcanismo. Minerais e Rochas. Água subterrânea. Estruturas dos maciços rochosos. Processos da dinâmica superficial. Movimentos gravitacionais de massa e erosão. Investigação geológica de campo. Cartas de Geologia de Engenharia. Uso de rochas na construção civil. Geologia do Brasil. Geologia de Engenharia aplicada a túneis, barragens e obras lineares.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5201 ou EMB5869","prerequisito":"EMB5006 e EMB5829","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5835":{"codigo":"EMB5835","nome":"Materiais de Construção I","ementa":"-Emprego dos materiais de construção: metais, polímeros, cerâmicas, madeira e betuminosos. Agregados e aglomerantes hidráulicos. Aditivos químicos e adições minerais. Propriedades das argamassas e concretos. Ensaios de laboratório. Normas técnicas que regem os materiais de construção.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5805","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5836":{"codigo":"EMB5836","nome":"Estudos de Impactos Ambientais","ementa":"-Avaliação de Impacto Ambiental (AIA). Licenciamento Ambiental. Estudos de Impacto Ambiental (EIA\/RIMA, EAS, RAP) Estudo de Impacto de Vizinhança. Áreas Protegidas por Lei. Legislação Ambiental","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5837":{"codigo":"EMB5837","nome":"Projeto Arquitetônico","ementa":"Desenvolvimento de projeto arquitetônico. Estudo de tipologias: residencial, comercial, industrial, institucional e de transportes. Caracterização dos usuários. Arquitetura bioclimática e sustentabilidade: uso racional de energia e água. Desempenho e conforto luminotécnico, térmico e acústico. Ventilação natural e climatização artificial. Elementos prediais para a prevenção e combate a incêndio e pânico. Acessibilidade em edificações.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5871","prerequisito":"EMB5833","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5838":{"codigo":"EMB5838","nome":"Hidráulica Geral","ementa":"Conceito de hidrostática e hidrodinâmica. Escoamento em condutos forçado e condutos livres, Máquinas hidráulicas: bombas e turbinas. Orifícios, bocais, bueiros, tubos curtos e vertedores. Medição de vazão","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5804","prerequisito":"EMB5040","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5839":{"codigo":"EMB5839","nome":"Mecânica dos Sólidos II","ementa":"Estado plano e triaxial de tensões e aplicação do círculo de Mohr.  Análise tridimensional de tensões e deformações específicas. Diagramas de normal, cortante e momento de estruturas isostáticas (vigas, treliças, pórticos, grelhas, cabos e arcos). Deflexão de vigas isostáticas (Linha Elástica). Colunas e estabilidade das estruturas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5806 ou EMB5872","prerequisito":"EMB5021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5864":{"codigo":"EMB5864","nome":"Planejamento e Gestão do Espaço Urbano","ementa":"Urbanização e planejamento urbano: história e conceitos. Urbanização e meio ambiente. Engenharia urbana. Desenho urbano. Legislação urbana e políticas públicas para: uso do solo, mobilidade, parcelamento do solo, projeto de loteamentos urbanos e habitação popular. O planejamento e a gestão do espaço urbano na prevenção e combate a incêndios e desastres para locais de grande concentração e circulação de pessoas. Gestão de infraestrutura urbana: sistemas urbanos, equipamentos urbanos, organização administrativa urbana, fonte de recursos e orçamento municipal. Desenvolvimento urbano sustentável e cidades sustentáveis. Planejamento urbano e o mercado imobiliário.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"EMB5875","prerequisito":"EMB5829","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5927":{"codigo":"EMB5927","nome":"Engenharia de Tráfego I","ementa":"Introdução à Engenharia de Tráfego. Elementos da Engenharia de Tráfego. Modelagem de tráfego. Correntes de Tráfego. Capacidade e níveis de serviço de tráfego. Estacionamentos. Segurança viária.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"EMB5206 ou EMB5982","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5840":{"codigo":"EMB5840","nome":"Custos e Orçamentação","ementa":"Metodologia de implementação de custos. Análise de preços. Custos diretos e indiretos. Elaboração e análise de custos unitários. Elaboração de orçamentos. Uso de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5214 ou EMB5880","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5841":{"codigo":"EMB5841","nome":"Projeto Geométrico de Vias","ementa":"-Características e elementos técnicos gerais para o projeto de rodovias e vias urbanas. Estudos de traçado. Critérios para a escolha de diretrizes de rodovias. Concordância horizontal: circular simples e com transição. Locação de eixos. Superelevação. Superlargura. Distâncias de visibilidade. Concordância vertical. Cálculo do greide. Volumes de terraplenagem. Interseções.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5830","prerequisito":"EMB5829 e EMB5927","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5842":{"codigo":"EMB5842","nome":"Teoria das Estruturas","ementa":"Graus de Hiperestaticidade. Princípio dos Trabalhos Virtuais. Método das Forças. Método dos Deslocamentos (Método da Rigidez). Análise Matricial. Linhas de influência. Cálculo de deslocamentos devido a carregamentos, efeito de temperatura e deslocamentos de apoio.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5873","prerequisito":"EMB5839","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5843":{"codigo":"EMB5843","nome":"Hidrologia Aplicada","ementa":"Ciclo hidrológico e bacia hidrográfica. Noções de climatologia.  Precipitação. Intercepção, evaporação e evapotranspiração. Infiltração e Percolação. Águas subterrâneas. Escoamento superficial. Estimativa de vazões máximas e mínimas. Controle e previsão de enchentes Regularização de vazões. Desastres naturais ligados à hidrologia e climatologia (alagamentos, enxurradas, inundação, ciclones, furacões, tornados, tempestades e estiagem)","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5802 ou EMB5874","prerequisito":"EMB5838","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5844":{"codigo":"EMB5844","nome":"Mecânica dos Solos I","ementa":"-Origem e formação dos solos. Caracterização física. Estrutura. Classificação dos solos. Características e propriedades geotécnicas de horizontes lateríticos e saprolíticos de solos tropicais. Tensões no solo: geostáticas e induzidas. Percolação e permeabilidade. Compressibilidade dos solos. Ensaios de laboratório. Sondagens e amostragens.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5801","prerequisito":"EMB5834","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5845":{"codigo":"EMB5845","nome":"Materiais de Construção II","ementa":"Propriedades do concreto no estado fresco e endurecido. Preparo, transporte, lançamento e cura do concreto. Dosagem do concreto. Concretos especiais aplicados em obras de infraestrutura. Patologia do concreto. Normas que regem a qualidade do concreto. Ensaios de laboratório.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"ECV5302 ou EMB5870","prerequisito":"EMB5835","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5846":{"codigo":"EMB5846","nome":"Gerenciamento de Obras","ementa":"Os sistemas de gerenciamento e planejamento de construções. Programação na implantação de empreendimentos: metodologia, sistemática de programação e controle, técnicas correntes e estudo de casos. Gestão de recursos humanos, qualidade e sustentabilidade em construções. Caderno de encargos, memorial descritivo e cronograma físico-financeiro.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5211","prerequisito":"EMB5840","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5847":{"codigo":"EMB5847","nome":"Estruturas de Concreto Armado I","ementa":"Concreto armado. Estado limite último. Dimensionamento de vigas à flexão simples e cisalhamento. Cálculo e distribuição de armaduras e detalhamento.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5803","prerequisito":"EMB5842 e EMB5845","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5848":{"codigo":"EMB5848","nome":"Técnicas de Construção Civil","ementa":"Serviços preliminares. Instalações de canteiros de obras. Execução de fundações rasas e profundas. Escoramentos, cimbramentos, formas para concreto. Desformas. Alvenarias e demais estruturas de fechamento. Revestimento de paredes e pisos. Coberturas, impermeabilização, esquadrias, pavimentação, vidros, instalações, iluminação natural e artificial. Aquecimento e ventilação. Noções de desempenho das edificações. Normas técnicas.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"EMB5876","prerequisito":"EMB5835","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5849":{"codigo":"EMB5849","nome":"Instalaçoes Elétricas","ementa":"-Introdução sobre sistema elétrico. Concepção de um projeto elétrico. Previsão de carga. Características e dimensionamento de condutores, dutos e proteção. Tipos de tomadas, comandos e disjuntores. Cálculo de demanda. Padrão de entrada de energia. Segurança em eletricidade. Circuito elétrico e quadro de distribuição. Normas técnicas sobre instalações. Montagem de circuitos com proteção, iluminação e tomada. Luminotécnia. Projeto de uma instalação elétrica predial.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMB5813","prerequisito":"EMB5837","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5850":{"codigo":"EMB5850","nome":"Instalações Hidráulicas Prediais","ementa":"-Sistema Predial de Água Fria, Água Quente, de Proteção e Combate a Incêndio, Esgotamento Sanitário, Águas Pluviais, Gás Combustível (GLP e GN) e Condicionamento de Ar. Noções sobre construções bioclimáticas. Conservação e uso racional de água em edificações. Compatibilização entre projetos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMB5814","prerequisito":"EMB5837 e EMB5838","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5851":{"codigo":"EMB5851","nome":"Mecânica dos Solos II","ementa":"-Compactação dos solos. Índice de suporte Califórnia. Resistência ao cisalhamento dos solos. Estabilidade de Taludes. Empuxos de terra. Estruturas de contenção. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5808","prerequisito":"EMB5839 e EMB5844","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5852":{"codigo":"EMB5852","nome":"Elementos e Técnicas de Infraestrutura","ementa":"Modalidade de serviços. Equipamentos de terraplanagem. Execução da terraplanagem. Análise e composição de custos. Planejamento e controle de obras. Estudos de impacto ambiental. Aplicação de ferramentas computacionais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5810 ou EMB5878","prerequisito":"EMB5841 e EMB5844","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5044":{"codigo":"EMB5044","nome":"Planejamento do Trabalho de Conclusão de Curso","ementa":"A pesquisa e o método científico. Formulação do problema de pesquisa. Construção de hipóteses. Tipos e características de pesquisa. Elaboração de projetos de pesquisa. Elaboração de relatórios. Nesta etapa será proposto o projeto para o trabalho de conclusão do curso, tendo o seguinte conteúdo: Título, tema, problematização, hipóteses, objetivos, justificativa, metodologia, resultados esperados, cronograma, relação das principais referências.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5321 ou EMB5420 ou EMB5521 ou EMB5618 ou EMB5720 ou EMB5821 ou EMB5919","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2600,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5853":{"codigo":"EMB5853","nome":"Saneamento","ementa":"O Saneamento e a saúde pública. Poluição do ar, água e solo. A importância da qualidade da água.  Consumo e usos de água. Projeção populacional e etapas de elaboração de projetos. Sistema de abastecimento de água (captação, adução, recalque, tratamento, reservação). Sistema de distribuição de água. Níveis e processos de tratamento de água, água residuais e esgotos sanitários. Sistema de esgotamento sanitário (coletores, interceptor, emissário e disposição final de esgoto). Resíduos sólidos urbanos (acondicionamento, coleta e transporte e tratamento de resíduos sólidos). Limpeza pública.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5881","prerequisito":"EMB5843","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5854":{"codigo":"EMB5854","nome":"Estrutura de Concreto Armado II","ementa":"Lajes de concreto armado. Dimensionamento, disposições construtivas e detalhamento. Reservatórios. Pilares de concreto armado. Instabilidade local e global. Flexão simples, composta normal e composta oblíqua. Dimensionamento e detalhamento. Estruturas de concreto armado em situação de incêndio.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5812 ou EMB5882","prerequisito":"EMB5847","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5855":{"codigo":"EMB5855","nome":"Legislação Profissional e Fundamentos de Engenharia de Segurança","ementa":"Legislação Profissional: Fundamentação filosófica, social e política do trabalho. O Sistema profissional. Normas e legislação profissional. Remuneração profissional. Ética e disciplina profissional. Formas de exercício profissional. Campo de trabalho. Segurança do Trabalho: Conceituação de segurança na Engenharia. Controle do ambiente. Proteção coletiva e individual. Proteção contra incêndio. Riscos específicos nas várias habilitações da Engenharia. Controle de perdas e produtividade. Segurança no projeto. Análise e estatísticas de acidentes, seleção, treinamento, motivação do pessoal. Normalização e legislação específica. Organização da segurança do trabalho na empresa. Segurança em atividades extra empresa. Visitas.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5856":{"codigo":"EMB5856","nome":"Pavimentação de Vias","ementa":"-Conceitos e tipos de pavimentos. Comportamento mecânico das estruturas de pavimento. Projeto geotécnico. Comportamento dinâmico dos solos. Estudos de materiais para pavimentação: características e propriedades. Dosagem de misturas asfálticas. Usinas asfálticas. Estudo do Tráfego. Dimensionamento e execução de pavimentos asfálticos, poliédricos e concreto de cimento Portland. Conservação e Restauração de Vias. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5811","prerequisito":"EMB5851 e EMB5852","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5857":{"codigo":"EMB5857","nome":"Fundações","ementa":"-Investigação geotécnica: princípios e execução dos ensaios SPT, CPT, Vane Test, Pressiômetro, Dilatômetro, condutividade hidráulica. Parâmetros geotécnicos derivados dos ensaios. Fundações superficiais e profundas: métodos de capacidade de carga, dimensionamento geotécnico, estimativa de recalques, casos especiais, aspectos executivos. Dimensionamento estrutural de sapatas e blocos. Patologias e reforços de fundações","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5817","prerequisito":"EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5961":{"codigo":"EMB5961","nome":"Engenharia Econômica","ementa":"Fundamentos de economia. Princípios básicos de Engenharia Econômica. Matemática financeira. Investimento e modalidades de financiamento. Bases para comparação de alternativas de investimento. Impostos e depreciação. Análise da relação: custo x volume x lucro (ACVL). Análise de sensibilidade. Análise de substituição de equipamentos. Análise de alternativas sob condições de risco e incerteza. Tópicos de Finanças e investimentos. Utilização de simulação na Engenharia Econômica em estudo de caso.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS7019","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5045":{"codigo":"EMB5045","nome":"Trabalho de Conclusão de Curso","ementa":"Consolidação dos conhecimentos obtidos no curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações da área do respectivoo curso.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5822","prerequisito":"EMB5044","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5858":{"codigo":"EMB5858","nome":"Túneis e Obras de Terra","ementa":"Aterros sobre solos moles: projeto, construção e monitoramento. Barragens: projeto, construção e monitoramento. Geossintéticos. Túneis: conceitos básicos dos tuneis, fatores incidentes. Comportamento dos materiais. Sistemas de classificação geomecânica. Dimensionamento. Métodos construtivos. Exemplos práticos.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5859":{"codigo":"EMB5859","nome":"Portos e Vias Navegáveis","ementa":"Introdução e generalidades (embarcações, cargas, tipos de portos e vias navegáveis), hidrodinâmica e hidráulica fluvial e marítima, vias navegáveis (dimensionamento, obras de melhoramento, regularização, transposição de níveis, proteção e manutenção), problemas geotécnicos em obras portuárias, estruturas portuárias (ação de embarcações, amarração e estabilidade), estruturas de proteção (defensas, diques e molhes).","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5815","prerequisito":"EMB5838 e EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5860":{"codigo":"EMB5860","nome":"Pontes","ementa":"Definições. Elementos componentes de uma ponte. Tipos e classificação das pontes. Normas. Pontes em Concreto Armado. Formação do Trem Tipo. Cargas, solicitações, deformações, esforços horizontais, dimensionamento, detalhes construtivos.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5816 ou EMB5884","prerequisito":"EMB5854","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5861":{"codigo":"EMB5861","nome":"Ferrovias e Metrovias","ementa":"Generalidades. Conceitos básicos metro- ferroviários. Via permanente. Dimensionamento da superestrutura. Projeto geométrico da linha. Construção e manutenção da via permanente. Instalações complementares. Planejamento de operação.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5820","prerequisito":"EMB5841 e EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5862":{"codigo":"EMB5862","nome":"Estruturas Metálicas e de Madeira","ementa":"Características das estruturas de aço. Métodos de segurança e Método dos Estados Limites. Propriedades mecânicas do aço estrutural. Dimensionamento de elementos em aço. Peças tracionadas, comprimidas e fletidas. Ligações. Normas técnicas. Estruturas metálicas em situação de incêndio. A madeira como material estrutural; propriedades físicas e mecânicas; compressão simples; instabilidade de coluna; ligações tipo sambladura, por parafusos e por pregos; flexão normal simples e composta; coberturas convencionais e industriais; e projeto e execução de estruturas de madeira. Detalhes construtivos. Normas técnicas. Estruturas de madeira em situação de incêndio.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5842","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5865":{"codigo":"EMB5865","nome":"Aeroportos","ementa":"Conceitos e considerações gerais sobre aviação civil e terminais aeroviários. Tipos de terminais aeroviários. Plano diretor e localização de sítio. Orientação de pistas e meteorologia aeroportuária. Controle de tráfego aéreo. Obras de drenagem. Comportamento dos materiais. Capacidades de carga e de pista. Estudo do tráfego. Aeronave de projeto. Projeto Geométrico de Pistas e do Pátio de Taxiamento. Dimensionamento da estrutura de pavimento. Sinalização.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"EMB5815","prerequisito":"EMB5856","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1401":{"codigo":"ZZT1401","nome":"Disciplinas Optativas","ementa":"","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EMB5046":{"codigo":"EMB5046","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":396,"fase_sugestao":10,"equivalencia":"EMB5823","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3470,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5026":{"codigo":"EMB5026","nome":"Ergonomia e Segurança","ementa":"Conceitos básicos. Fisiologia do trabalho. Antropometria e Biomecânica. Variáveis ambientais: iluminação e cores, ruído, vibrações, temperatura. Introdução à análise ergonômica do trabalho. Cognição no trabalho. Ergonomia do produto. Segurança no trabalho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5032":{"codigo":"EMB5032","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5033":{"codigo":"EMB5033","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características de sistemas de medição; Calibração; Estimativa de incerteza de medição; Especificação geométrica; Medição de comprimento, ângulo, forma e rugosidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5042":{"codigo":"EMB5042","nome":"Metodologia de Projeto de Produto","ementa":"Introdução: A visão do projeto e do produto no contexto histórico, ambiental, e de custo. Importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos. Projeto preliminar: modelagem, análise e simulação de soluções de projeto; projeto detalhado. Construção e teste de protótipos. Aplicações: produtos em engenharia veicular; transporte, infraestrutura, sistemas embarcados em nível de software e hardware. Noções de Engenharia de Sistemas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5027","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5050":{"codigo":"EMB5050","nome":"Língua Inglesa: Prática de Redação e de Tradução","ementa":"Gramática Básica do Inglês. Conversação Simples. Redação em Língua Portuguesa e Inglesa. Tradução Português-Inglês.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5051":{"codigo":"EMB5051","nome":"Tradução de Textos Literários e Acadêmicos-Inglês-Português-Inglês","ementa":"Noções de Teoria da Tradução. Prática de Tradução de Textos Literários e Acadêmicos Inglês-Português-Inglês.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5052":{"codigo":"EMB5052","nome":"Tópicos Especiais em Língua Estrangeiras","ementa":"A disciplina não possui ementa pré-definida. O conteudo a ser abordado versará sobre assuntos visando ao aprofundamento de temas relacionados à área de línguas estrangeiras.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5053":{"codigo":"EMB5053","nome":"Aprimoramento da Escrita Acadêmica","ementa":"Norma culta e escrita acadêmica. Sintaxe e Gramática aplicadas à redação acadêmica. Análise de textos acadêmicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5115":{"codigo":"EMB5115","nome":"Vibrações","ementa":"Introdução aos problemas de vibração em engenharia. Terminologia. Princípios Básicos. Sistemas com um grau de liberdade: vibração livre, métodos de energia, amortecimento e vibração forçada. Sistemas com dois graus de liberdade: vibração livre e forçada. Sistemas com múltiplos graus de liberdade. Introdução aos sistemas contínuos. Introdução aos sistemas de medição de vibrações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014 e EMB5041","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5204":{"codigo":"EMB5204","nome":"Sistemas de Transportes","ementa":"Concepções da estrutura urbana e transporte urbano. Planejamento de transportes. Qualidade e Produtividade nos transportes. Aspectos técnicos e econômicos das modalidades de transportes. Coordenação das modalidades de transportes. Viabilidade econômica de projetos rodoviários. Transportes especializados. Os transportes no Brasil e novas perspectivas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5215":{"codigo":"EMB5215","nome":"Logística I","ementa":"Conceitos: Logística, Logística de Suprimentos, Logística de Distribuição e Logística Integrada. Cadeia de Suprimentos. Processos da Cadeia de Suprimentos. Gestão da Cadeia de Suprimentos. Nível de Serviço Logístico. Indicadores de Desempenho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5320":{"codigo":"EMB5320","nome":"Empreendedorismo e Inovação","ementa":"Conceito de inovação. Tipos de inovação. Estratégias de Inovação. A inovação como um processo organizacional. Mecanismos de fomento e cooperação em pesquisa e desenvolvimento. Empreendedorismo. Características, tipos e habilidades do empreendedor. Plano de Negócios: etapas, processos e elaboração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5630":{"codigo":"EMB5630","nome":"Programação II","ementa":"Apontadores, alocação dinâmica de memória. Arquivos. Recursividade. Algoritmos de ordenação e \nbusca. Tipos abstratos de dados. Listas, pilhas, filas, e árvores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5600","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5631":{"codigo":"EMB5631","nome":"Programação III","ementa":"Fundamentos da orientação a objetos: herança, herança múltipla, polimorfismo, encapsulamento, \nconstrutores e destrutores, associação. Sobrecarga de operadores. Programação genérica \n(metaprogramação estática).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5630","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5713":{"codigo":"EMB5713","nome":"Métodos Computacionais para Engenharia","ementa":"Introdução aos métodos de diferenças finitas e elementos finitos. Aspectos matemáticos das equações governantes. Método das diferenças finitas. Método dos elementos finitos. Método dos resíduos ponderados. Problemas unidimensionais. Problemas bidimensionais. Principais tipos de elementos utilizados em análise estrutural e suas aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1746,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5918":{"codigo":"EMB5918","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e \nOperacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5923":{"codigo":"EMB5923","nome":"Projeto e Operação de Terminais","ementa":"Conceituação geral e função dos terminais de transportes. Caracterização e especificidades dos terminais e estações de cargas e de passageiros dos modais rodoviário, ferroviário, metroviário, dutoviário, aquaviário e aéreo. Áreas de estacionamentos. Estudos de Localização. Componentes físicos: edificações e supraestrutura. Regulamentos e normas para o projeto de terminais. Relação entre o dimensionamento das instalações, o arranjo físico e as capacidades de armazenamento e de transporte. Tecnologias e equipamentos de movimentação de cargas e pessoas. Nível de serviço do transporte de cargas e de passageiros. Indicadores de desempenho de terminais. Terminais intermodais. Aspectos relacionados à expansão das instalações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5925":{"codigo":"EMB5925","nome":"Transportes não Motorizados","ementa":"Políticas de transporte não motorizado, dinâmica urbana à circulação não motorizada: circulação de pedestres e sistema cicloviário. Métodos de análise, instrumentos e indicadores para transportes não motorizados.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5928":{"codigo":"EMB5928","nome":"Engenharia de Tráfego III","ementa":"Modelos: filas, ondas de choque, modelos empíricos. Estudos de tráfego: técnicas de coletas de dados, redução de dados, veículos sonda. Tráfego rodoviário: classificação, características, fluxo interrompido e não interrompido, movimentos (entrelaçamento, inserção, divergência). Legislação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5927","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5936":{"codigo":"EMB5936","nome":"Engenharia de Tráfego II","ementa":"Sinalização horizontal e vertical; canalização do tráfego. Interseções: estrutura e hierarquia regras de conduta e controle. Princípios de sinalização semafórica; critérios para implantação; dispositivos de controle. Dimensionamento de semáforos: tempo fixo, atuado, seleção dinâmica e tempo real; softwares para dimensionamento; interseções isoladas, coordenação semafórica; congestionamentos; Controle de tráfego rodoviário: controle de acesso; limites de velocidade variáveis; faixas de alta ocupação (HOT\/HOV lanes), uso do acostamento, incidentes, gerenciamento de faixas. Simulação de tráfego: modelos microscópicos, macroscópicos e mesoscópicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5928","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5937":{"codigo":"EMB5937","nome":"Impactos Ambientais dos Transportes","ementa":"Transporte de Produtos Perigosos. Impactos Ambientais nos Diferentes Modais. Licenciamento Ambiental e Legislação Ambiental Aplicada ao Setor de transporte. Logística reversa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5950":{"codigo":"EMB5950","nome":"Pesquisa Operacional I","ementa":"Formulação de modelos. Solução gráfica. Solução algébrica. Método simplex. Dualidade. Análise de sensibilidade. Problema de transportes. Problema de atribuição. Problema de caminho mínimo. Problema de fluxo máximo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMB5905","prerequisito":"EMB5007","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5951":{"codigo":"EMB5951","nome":"Pesquisa Operacional II","ementa":"Formulação de modelos. Programação não linear: condições de otimalidade, otimização irrestrita, otimização restrita. Programação Quadrática. Programação Separável. Programação dinâmica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMB5912","prerequisito":"EMB5950","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5962":{"codigo":"EMB5962","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e Operacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5918","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6800":{"codigo":"EMB6800","nome":"Disciplina em Pós-graduação 1","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6801":{"codigo":"EMB6801","nome":"Disciplina em Pós-graduação 2","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6802":{"codigo":"EMB6802","nome":"Disciplina em Pós-graduação 3","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EMB5863":{"codigo":"EMB5863","nome":"Atividades Complementares","ementa":"","carga_horaria":180,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20251":{"id":"719","codigo":20251,"codigo_curso":607,"carga_horaria_ufsc":4464,"carga_horaria_mec":3600,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao Curriculo 20251","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5036":{"codigo":"EMB5036","nome":"Química para engenharia","ementa":"Sistema internacional de unidades. Átomos e moléculas. Ligações químicas e estrutura molecular. Equações químicas. Estequiometria. Soluções aquosas. Termoquímica. Eletroquímica: oxidaçãoredução, células eletroquímicas, equação de Nernst, eletrólise. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Polímeros: estrutura química, propriedades, aplicações. Cerâmicas: cerâmicas tradicionais e avançadas, propriedades, aplicações. Compósitos. Corrosão metálica: tipos e formas, meios corrosivos, mecanismos de proteção, monitoramento. Combustíveis e combustão. Química Ambiental. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5055":{"codigo":"EMB5055","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos. Fundamentos de Desenho Geométrico. Desenho Projetivo. Normas para desenho (ABNT). Cotagem. Escalas. Desenho de objetos no 1º e 3º diedros. Perspectiva Isométrica. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5035","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5062":{"codigo":"EMB5062","nome":"Comunicação e Expressão","ementa":"Leitura e interpretação de textos técnicos e científicos da área da Engenharia. Estudo teórico e prático de textos técnicos e científicos relevantes à execução de atividades acadêmicas, como: fichamento, resumo, resenha, artigo, seminário. Normas da ABNT relevantes à produção\/elaboração de textos acadêmicos. Linguagem técnica e científica. Normas gramaticais vigentes. Exercício de apropriação de textos da área da Engenharia.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5037","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5648":{"codigo":"EMB5648","nome":"Programação I","ementa":"Introdução a arquitetura de computadores. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos) e fluxograma, tipos de dados, estruturas de seleção e repetição, fluxo de execução, modularização (funções e procedimentos), estruturas de dados homogêneas (vetores e matrizes). Introdução a apontadores. Arquivos. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5600","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5832":{"codigo":"EMB5832","nome":"Introdução à Engenharia Civil de Infraestrutura","ementa":"-Contextualização à vida acadêmica (a universidade, o curso de engenharia da mobilidade, o currículo, serviços de apoio, laboratórios). Contextualização à vida profissional. Funções do engenheiro no contexto tecnológico e social. O mercado de trabalho na engenharia. Métodos científicos na resolução de problemas de engenharia. Introdução à atividade profissional do engenheiro: especificação, projeto, implementação, construção de protótipos e testes para problemas, dispositivos e situações da engenharia da mobilidade. Gestão da inovação e da tecnologia.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001 e EMB5036","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5048":{"codigo":"EMB5048","nome":"Física I","ementa":"Unidades de medidas e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação do momento linear e angular. Rotação de corpos rígidos e rolamento. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5034","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5063":{"codigo":"EMB5063","nome":"Ciência, Tecnologia e Sociedade","ementa":"Definições de ciência, tecnologia e técnica. Desenvolvimento tecnológico e social. Relações entre ciência, tecnologia e sociedade. Desafios para o perfil do engenheiro contemporâneo. Funções do engenheiro no contexto tecnológico e social. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. A igualdade étnico racial na engenharia.História e cultura Afro-Brasileira e Africana. Direitos humanos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EMB5038","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5833":{"codigo":"EMB5833","nome":"Desenho Técnico Aplicado à Infraestrutura","ementa":"-Linguagem de projetos de edificações e estruturais. Desenho e interpretação com uso de CAD. Nomenclaturas e definições. Normas de desenho de plantas, cortes, elevações, coberturas e detalhes em geral.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5055","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5011":{"codigo":"EMB5011","nome":"Estática","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Cálculo de centróides de áreas e de volumes de figuras simples e compostas. Análise de forças distribuídas como cargas concentradas. Cálculo de momento de inércia de superfície para áreas simples e compostas. Cálculo de momento de inércia de massa para sólidos simples e compostos. Análise de Treliças, Estruturas e Máquinas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5005 e EMB5048","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5648","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5007 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5039":{"codigo":"EMB5039","nome":"Física II","ementa":"Gravitação. Estática e dinâmica de fluidos. Oscilações. Ondas mecânicas e acústicas. Temperatura. Calor. Teoria cinética dos gases. Leis da termodinâmica. Máquinas térmicas. Refrigeradores. Entropia. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5048","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5057":{"codigo":"EMB5057","nome":"Estatística I","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5010","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5866":{"codigo":"EMB5866","nome":"Topografia I","ementa":"Geodésia. Sistemas Geodésicos de referência. Instrumentos topográficos. Cartografia. Medidas diretas de distâncias e de ângulos. Orientação. Sistemas de coordenadas. Sistema de posicionamento global. Aerofotogrametria e aplicações. LIDAR e aplicações. Exploração e apresentação de dados com a utilização de softwares. Métodos de levantamento planimétrico e classes de precisão. Planimetria: Poligonais aberta, fechada, enquadrada. Cálculos de área. Desenho topográfico. Atividade de extensão: Topografia aplicada à gestão e planejamento físico-territorial.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EMB5825","prerequisito":"EMB5833","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5007 e EMB5016 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5040":{"codigo":"EMB5040","nome":"Fenômenos de Transporte","ementa":"Conceitos fundamentais em mecânica dos fluidos. Hidrostàtica. Análise Integral. Equacão de Bernoulli. Escoamento viscoso incompressível. Conceitos fundamentais em transmissão de calor: Condução unidimensional em regime permanente, Convecção e Radiação. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5030 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5041":{"codigo":"EMB5041","nome":"Dinâmica","ementa":"Cinemática dos corpos rígidos. Dinâmica dos corpos rígidos. Princípio do trabalho e energia, quantidade de movimento, impulso linear e angular para corpos rígidos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5043":{"codigo":"EMB5043","nome":"Física III","ementa":"Lei de Coulomb. O Campo Elétrico e Potencial Eletrostático. Capacitância e Capacitores. Corrente Elétrica. Campo Magnético. A Lei de Ampere. A Lei da Indução. Circuitos. As Equações de Maxwell. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5030 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5835":{"codigo":"EMB5835","nome":"Materiais de Construção I","ementa":"-Emprego dos materiais de construção: metais, polímeros, cerâmicas, madeira e betuminosos. Agregados e aglomerantes hidráulicos. Aditivos químicos e adições minerais. Propriedades das argamassas e concretos. Ensaios de laboratório. Normas técnicas que regem os materiais de construção.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5867":{"codigo":"EMB5867","nome":"Topografia II","ementa":"Topografia aplicada. Levantamento Planialtimétrico. Aerofotogrametria. Nivelamento Geométrico, Trigonométrico e Taqueométrico. Marcação e interpretação de curvas de nível. Georreferenciamento de imóveis (rurais e urbanos). Sistemas de Informação Geográfica. Locação de obras. Controle e acompanhamento de recalque em edificações. Levantamentos para obras de infraestrutura (rodovias, ferrovias, redes hidrossanitárias, barragens etc.). Aplicação de ferramentas computacionais. Atividades de extensão em projetos de interesse da sociedade em geral.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EMB5829","prerequisito":"EMB5866","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5120":{"codigo":"EMB5120","nome":"Gestão e Organização","ementa":"Histórico da teoria geral da administração. Abordagens básicas e evolução do pensamento administrativo. Conceito de Administração e funções administrativas. Gestão da Produção e Operações. Estratégia de Produção e Operações. Noções de Planejamento e Controle da Produção. Just in Time e Operações Enxutas. Gestão da Qualidade. Gestão de Pessoas. Noções de Empreendedorismo.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5868":{"codigo":"EMB5868","nome":"Hidráulica Geral","ementa":"Conceito de hidrostática e hidrodinâmica. Escoamento em condutos forçados: fórmulas de perda de carga; perda de carga localizadas e no conduto, condutos equivalentes, condutos em série e paralelo; distribuição em marcha; problemas em dois e três reservatórios. Máquinas hidráulicas: bombas e turbinas. Condutos livres: tipos de seções; movimento uniforme e variados em canais. Orifícios, bocais, bueiros, tubos curtos e vertedores. Medição de vazão","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5838","prerequisito":"EMB5040","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5869":{"codigo":"EMB5869","nome":"Geologia da Engenharia","ementa":"Estrutura e dinâmica interna da Terra. Sismos e Vulcanismo. Minerais e Rochas. Água subterrânea. Estruturas dos maciços rochosos. Processos da dinâmica superficial. Movimentos gravitacionais de massa e erosão. Investigação geológica de campo. Cartas de Geologia de Engenharia. Uso de rochas na construção civil. Geologia do Brasil. Geologia de Engenharia aplicada a túneis, barragens e obras lineares. Atividade de extensão: A Geologia de Engenharia no desenvolvimento territorial sustentável.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5834","prerequisito":"EMB5036 e EMB5867","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5870":{"codigo":"EMB5870","nome":"Materiais de Construção II","ementa":"Propriedades do concreto no estado fresco e endurecido. Preparo, transporte, lançamento e cura do concreto. Controle Tecnológico de Concreto, Dosagem do concreto. Concretos especiais aplicados em obras de infraestrutura. Patologia do concreto. Normas que regem a qualidade do concreto. Ensaios de laboratório.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5845","prerequisito":"EMB5835","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5871":{"codigo":"EMB5871","nome":"Projeto Arquitetônico","ementa":"Desenvolvimento de projeto arquitetônico. Arquitetura modular. Desempenho da edificação: consumo energético e de água, conforto luminotécnico, térmico e acústico. Arquitetura e ventilação. Elementos prediais para a prevenção e combate a incêndio e pânico. Acessibilidade em edificações.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5837","prerequisito":"EMB5867","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5872":{"codigo":"EMB5872","nome":"Mecânica dos Sólidos III","ementa":"Estado plano e triaxial de tensões e aplicação do círculo de Mohr. Análise tridimensional de tensões e deformações específicas. Diagramas de normal, cortante e momento de estruturas isostáticas (vigas, treliças, pórticos, grelhas, cabos e arcos), Deflexão de vigas isostáticas (Linha Elástica). Colunas e estabilidade das estruturas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5839","prerequisito":"EMB5021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5982":{"codigo":"EMB5982","nome":"Engenharia de Tráfego I","ementa":"Conceito de Engenharia de Tráfego; Elementos da Engenharia de Tráfego (Usuários, Veículos, Vias); Características do Tráfego (Fluxo e volume, Velocidade, Densidade, Headway, Relações Fundamentais do Tráfego, Tempo de viagem e atrasos); Traffic Calming; Análise de Capacidade e Nível de Serviço.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"EMB5927","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5841":{"codigo":"EMB5841","nome":"Projeto Geométrico de Vias","ementa":"-Características e elementos técnicos gerais para o projeto de rodovias e vias urbanas. Estudos de traçado. Critérios para a escolha de diretrizes de rodovias. Concordância horizontal: circular simples e com transição. Locação de eixos. Superelevação. Superlargura. Distâncias de visibilidade. Concordância vertical. Cálculo do greide. Volumes de terraplenagem. Interseções.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5867 e EMB5982","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5844":{"codigo":"EMB5844","nome":"Mecânica dos Solos I","ementa":"-Origem e formação dos solos. Caracterização física. Estrutura. Classificação dos solos. Características e propriedades geotécnicas de horizontes lateríticos e saprolíticos de solos tropicais. Tensões no solo: geostáticas e induzidas. Percolação e permeabilidade. Compressibilidade dos solos. Ensaios de laboratório. Sondagens e amostragens.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5869","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5873":{"codigo":"EMB5873","nome":"Teoria das Estruturas","ementa":"Graus de Hiperestaticidade. Princípio dos Trabalhos Virtuais. Método das Forças. Método das Equações dos Três Momentos. Método dos Deslocamentos (Método da Rigidez). Análise Matricial. Linhas de influência. Cálculo de deslocamentos devido a carregamentos, efeito de temperatura e deslocamentos de apoio.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5842","prerequisito":"EMB5872","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5874":{"codigo":"EMB5874","nome":"Hidrologia Aplicada","ementa":"Ciclo hidrológico e bacia hidrográfica. Noções de climatologia. Precipitação. Intercepção, evaporação e evapotranspiração. Infiltração e Percolação. Águas subterrâneas. Escoamento superficial. Estimativa de vazões máximas e mínimas. Controle e previsão de enchentes Regularização de vazões. Sistema de drenagem urbana. Modelos Hidrológicos. Desastres naturais ligados à hidrologia e climatologia (alagamentos, enxurradas, inundação, ciclones, furacões, tornados, tempestades e estiagem). Atividades de extensão.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5843","prerequisito":"EMB5868","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5875":{"codigo":"EMB5875","nome":"Planejamento e Gestão do Espaço Urbano","ementa":"Urbanização e planejamento urbano: história, e conceitos e tendências. Urbanização, meio ambiente e sustentabilidade. Engenharia urbana e gestão da infraestrutura. Legislação urbana para o uso do solo. Políticas públicas para o parcelamento do solo e habitação popular. Projeto extensionista: desenvolvimento de projeto urbano e de diagnóstico urbano. Planejamento Urbano e o mercado imobiliário.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"EMB5864","prerequisito":"EMB5871","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5876":{"codigo":"EMB5876","nome":"Técnicas de Construção Civil","ementa":"Serviços preliminares. Instalações de canteiros de obras. Execução de fundações rasas e profundas. Execução de Sistemas de formas para concretos. Sistemas de fechamento (Alvenarias e demais). Sistemas de revestimento de paredes e pisos. Coberturas, impermeabilização, esquadrias, vidros, instalações, iluminação natural e artificial. Noções de desempenho das edificações. Normas técnicas. Como atividades de extensão serão realizados trabalhos de especificação de sistemas construtivos em projetos de caráter social desenvolvidos, desenvolvidos por empresas parceiras e acompanhamento e visitas técnicas nas obras em questão.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5835","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5961":{"codigo":"EMB5961","nome":"Engenharia Econômica","ementa":"Fundamentos de economia. Princípios básicos de Engenharia Econômica. Matemática financeira. Investimento e modalidades de financiamento. Bases para comparação de alternativas de investimento. Impostos e depreciação. Análise da relação: custo x volume x lucro (ACVL). Análise de sensibilidade. Análise de substituição de equipamentos. Análise de alternativas sob condições de risco e incerteza. Tópicos de Finanças e investimentos. Utilização de simulação na Engenharia Econômica em estudo de caso.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5836":{"codigo":"EMB5836","nome":"Estudos de Impactos Ambientais","ementa":"-Avaliação de Impacto Ambiental (AIA). Licenciamento Ambiental. Estudos de Impacto Ambiental (EIA\/RIMA, EAS, RAP) Estudo de Impacto de Vizinhança. Áreas Protegidas por Lei. Legislação Ambiental","carga_horaria":36,"fase_sugestao":7,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5847":{"codigo":"EMB5847","nome":"Estruturas de Concreto Armado I","ementa":"Concreto armado. Estado limite último. Dimensionamento de vigas à flexão simples e cisalhamento. Cálculo e distribuição de armaduras e detalhamento.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5870 e EMB5873","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5849":{"codigo":"EMB5849","nome":"Instalaçoes Elétricas","ementa":"-Introdução sobre sistema elétrico. Concepção de um projeto elétrico. Previsão de carga. Características e dimensionamento de condutores, dutos e proteção. Tipos de tomadas, comandos e disjuntores. Cálculo de demanda. Padrão de entrada de energia. Segurança em eletricidade. Circuito elétrico e quadro de distribuição. Normas técnicas sobre instalações. Montagem de circuitos com proteção, iluminação e tomada. Luminotécnia. Projeto de uma instalação elétrica predial.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5871","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5850":{"codigo":"EMB5850","nome":"Instalações Hidráulicas Prediais","ementa":"-Sistema Predial de Água Fria, Água Quente, de Proteção e Combate a Incêndio, Esgotamento Sanitário, Águas Pluviais, Gás Combustível (GLP e GN) e Condicionamento de Ar. Noções sobre construções bioclimáticas. Conservação e uso racional de água em edificações. Compatibilização entre projetos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5868 e EMB5871","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5851":{"codigo":"EMB5851","nome":"Mecânica dos Solos II","ementa":"-Compactação dos solos. Índice de suporte Califórnia. Resistência ao cisalhamento dos solos. Estabilidade de Taludes. Empuxos de terra. Estruturas de contenção. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5844 e EMB5872","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5877":{"codigo":"EMB5877","nome":"Gerenciamento e Planejamento de Obras","ementa":"Os sistemas de gerenciamento e planejamento de construções. Programação na implantação de empreendimentos: metodologia, sistemática de programação e controle, técnicas correntes e estudo de casos. Gestão de recursos físicos e humanos (materiais, mão de obra e equipamentos). Qualidade e sustentabilidade em construções. Caderno de encargos, memorial descritivo e cronograma físicofinanceiro. Indicadores usados em gestão.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMB5846","prerequisito":"EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5878":{"codigo":"EMB5878","nome":"Elementos e Técnicas de Infraestrutura","ementa":"Equipamentos de terraplenagem. Execução da terraplanagem. Análise e composição de custos. Modalidade de serviços. Drenagem urbana e rodoviária, Obras de fixação e proteção das rodovias, Loteamentos, Planejamento e controle de obras. Aplicação de ferramentas computacionais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5852","prerequisito":"EMB5841 e EMB5844","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5044":{"codigo":"EMB5044","nome":"Planejamento do Trabalho de Conclusão de Curso","ementa":"A pesquisa e o método científico. Formulação do problema de pesquisa. Construção de hipóteses. Tipos e características de pesquisa. Elaboração de projetos de pesquisa. Elaboração de relatórios. Nesta etapa será proposto o projeto para o trabalho de conclusão do curso, tendo o seguinte conteúdo: Título, tema, problematização, hipóteses, objetivos, justificativa, metodologia, resultados esperados, cronograma, relação das principais referências.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2679,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5856":{"codigo":"EMB5856","nome":"Pavimentação de Vias","ementa":"-Conceitos e tipos de pavimentos. Comportamento mecânico das estruturas de pavimento. Projeto geotécnico. Comportamento dinâmico dos solos. Estudos de materiais para pavimentação: características e propriedades. Dosagem de misturas asfálticas. Usinas asfálticas. Estudo do Tráfego. Dimensionamento e execução de pavimentos asfálticos, poliédricos e concreto de cimento Portland. Conservação e Restauração de Vias. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5851 e EMB5878","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5857":{"codigo":"EMB5857","nome":"Fundações","ementa":"-Investigação geotécnica: princípios e execução dos ensaios SPT, CPT, Vane Test, Pressiômetro, Dilatômetro, condutividade hidráulica. Parâmetros geotécnicos derivados dos ensaios. Fundações superficiais e profundas: métodos de capacidade de carga, dimensionamento geotécnico, estimativa de recalques, casos especiais, aspectos executivos. Dimensionamento estrutural de sapatas e blocos. Patologias e reforços de fundações","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5880":{"codigo":"EMB5880","nome":"Custos e Orçamentação","ementa":"Metodologia de implementação de custos. Análise de preços. Custos diretos e indiretos. Elaboração e análise de custos unitários. Estimativa de custo. Elaboração de orçamentos. Uso de ferramentas computacionais.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5840","prerequisito":"EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5881":{"codigo":"EMB5881","nome":"Saneamento","ementa":"O Saneamento e a saúde pública. Poluição do ar, água e solo. A importância da qualidade da água. Consumo e usos de água. Projeção populacional e etapas de elaboração de projetos. Sistema de abastecimento de água (captação, adução, recalque, tratamento, reservação). Sistema de distribuição de água. Sistemas de Drenagem Urbana. Níveis e processos de tratamento de água, água residuais e esgotos sanitários. Sistema de esgotamento sanitário (coletores, interceptor, emissário e disposição final de esgoto). Resíduos sólidos urbanos (acondicionamento, coleta e transporte e tratamento de resíduos sólidos). Limpeza pública.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5853","prerequisito":"EMB5874","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5882":{"codigo":"EMB5882","nome":"Estruturas de Concreto Armado II","ementa":"Lajes de concreto armado. Dimensionamento, disposições construtivas e detalhamento. Escadas. Reservatórios. Pilares de concreto armado. Instabilidade local e global. Flexão simples, composta normal e composta oblíqua. Dimensionamento e detalhamento. Estruturas de concreto armado em situação de incêndio","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5854","prerequisito":"EMB5847","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5045":{"codigo":"EMB5045","nome":"Trabalho de Conclusão de Curso","ementa":"Consolidação dos conhecimentos obtidos no curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações da área do respectivoo curso.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5044","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5855":{"codigo":"EMB5855","nome":"Legislação Profissional e Fundamentos de Engenharia de Segurança","ementa":"Legislação Profissional: Fundamentação filosófica, social e política do trabalho. O Sistema profissional. Normas e legislação profissional. Remuneração profissional. Ética e disciplina profissional. Formas de exercício profissional. Campo de trabalho. Segurança do Trabalho: Conceituação de segurança na Engenharia. Controle do ambiente. Proteção coletiva e individual. Proteção contra incêndio. Riscos específicos nas várias habilitações da Engenharia. Controle de perdas e produtividade. Segurança no projeto. Análise e estatísticas de acidentes, seleção, treinamento, motivação do pessoal. Normalização e legislação específica. Organização da segurança do trabalho na empresa. Segurança em atividades extra empresa. Visitas.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5858":{"codigo":"EMB5858","nome":"Túneis e Obras de Terra","ementa":"Aterros sobre solos moles: projeto, construção e monitoramento. Barragens: projeto, construção e monitoramento. Geossintéticos. Túneis: conceitos básicos dos tuneis, fatores incidentes. Comportamento dos materiais. Sistemas de classificação geomecânica. Dimensionamento. Métodos construtivos. Exemplos práticos.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5859":{"codigo":"EMB5859","nome":"Portos e Vias Navegáveis","ementa":"Introdução e generalidades (embarcações, cargas, tipos de portos e vias navegáveis), hidrodinâmica e hidráulica fluvial e marítima, vias navegáveis (dimensionamento, obras de melhoramento, regularização, transposição de níveis, proteção e manutenção), problemas geotécnicos em obras portuárias, estruturas portuárias (ação de embarcações, amarração e estabilidade), estruturas de proteção (defensas, diques e molhes).","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5851 e EMB5868","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5862":{"codigo":"EMB5862","nome":"Estruturas Metálicas e de Madeira","ementa":"Características das estruturas de aço. Métodos de segurança e Método dos Estados Limites. Propriedades mecânicas do aço estrutural. Dimensionamento de elementos em aço. Peças tracionadas, comprimidas e fletidas. Ligações. Normas técnicas. Estruturas metálicas em situação de incêndio. A madeira como material estrutural; propriedades físicas e mecânicas; compressão simples; instabilidade de coluna; ligações tipo sambladura, por parafusos e por pregos; flexão normal simples e composta; coberturas convencionais e industriais; e projeto e execução de estruturas de madeira. Detalhes construtivos. Normas técnicas. Estruturas de madeira em situação de incêndio.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5873","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5883":{"codigo":"EMB5883","nome":"Aeroportos","ementa":"Conceitos e considerações gerais sobre aviação civil e terminais aeroviários. Tipos de terminais aeroviários. Planejamento do aeroporto. Plano diretor. Localização. Orientação de pistas. Controle de tráfego aéreo. Drenagem. Comportamento dos materiais. Características das aeronaves. Estudo do tráfego. Aeronave de projeto. Projeto Geométrico. Dimensionamento da estrutura de pavimento. Sinalização. Legislação. Softwares aplicados","carga_horaria":36,"fase_sugestao":9,"equivalencia":"EMB5865","prerequisito":"EMB5856","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5884":{"codigo":"EMB5884","nome":"Pontes","ementa":"Definições. Elementos componentes de uma ponte. Tipos e classificação das pontes. Normas. Pontes em Concreto Armado. Formação do Trem Tipo. Cargas, solicitações, deformações, esforços horizontais, dimensionamento, detalhes construtivos. Noções de pontes mistas de aço e concreto.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5860","prerequisito":"EMB5882","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5885":{"codigo":"EMB5885","nome":"Ferrovias e Metrovias","ementa":"Generalidades. Conceitos básicos metro- ferroviários. Via permanente. Dimensionamento da superestrutura. Projeto geométrico da linha. Construção e manutenção da via permanente. Instalações complementares. Planejamento de operação. Veículos ferroviários. Sistemas de controle de tráfego ferroviário. Sinalização. Softwares aplicados. Planejamento de operação.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5861","prerequisito":"EMB5841 e EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5899":{"codigo":"EMB5899","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso. Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":252,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3572,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5049":{"codigo":"EMB5049","nome":"Física Experimental","ementa":"Realização e análise de experimentos compreendendo os seguintes tópicos: Mecânica, ondas, oscilações, termodinâmica, eletricidade e magnetismo.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5048","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5050":{"codigo":"EMB5050","nome":"Língua Inglesa: Prática de Redação e de Tradução","ementa":"Gramática Básica do Inglês. Conversação Simples. Redação em Língua Portuguesa e Inglesa. Tradução Português-Inglês.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5051":{"codigo":"EMB5051","nome":"Tradução de Textos Literários e Acadêmicos-Inglês-Português-Inglês","ementa":"Noções de Teoria da Tradução. Prática de Tradução de Textos Literários e Acadêmicos Inglês-Português-Inglês.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5052":{"codigo":"EMB5052","nome":"Tópicos Especiais em Língua Estrangeiras","ementa":"A disciplina não possui ementa pré-definida. O conteudo a ser abordado versará sobre assuntos visando ao aprofundamento de temas relacionados à área de línguas estrangeiras.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5053":{"codigo":"EMB5053","nome":"Aprimoramento da Escrita Acadêmica","ementa":"Norma culta e escrita acadêmica. Sintaxe e Gramática aplicadas à redação acadêmica. Análise de textos acadêmicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5054":{"codigo":"EMB5054","nome":"Relações Interpessoais nas Organizações","ementa":"Formação da personalidade e dos papéis organizacionais. A importância do autoconhecimento na \ndinâmica cognitiva e emocional das relações interpessoais. Inteligência emocional. Historicidade, \ncontemporaneidade e características sociais na construção do eu. As atividades laborais e os papéis \nsociais. A importância da comunicação na constituição dos indivíduos e dentro das organizações. \nRelações interpessoais e dinâmica organizacional. Ética e Moralidade. Líderes e Liderança.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5056":{"codigo":"EMB5056","nome":"Ergonomia e Segurança","ementa":"Conceitos básicos. Fisiologia do trabalho. Antropometria e Biomecânica. Processos Cognitivos. Dispositivos de informação. Percepção e processamento da informação. Manejo e controles. Metodologias de análise ergonômica. Ergonomia do produto. Variáveis ambientais: iluminação, ruído, vibrações, temperatura. Análise ergonômica do trabalho. Segurança do trabalho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5058":{"codigo":"EMB5058","nome":"Estatística II","ementa":"Estimação de parâmetros pelo método da máxima verossimilhança. Regressão linear simples e múltipla: estimação de parâmetros e teste de hipóteses, predição para novas observações, analise da adequação do modelo, correlação. Introdução a Modelos Lineares Generalizados (MLG): família exponencial de distribuições, elementos básicos, principais MLGs para dados discretos, Estimação de parâmetros e teste de hipóteses, avaliação do ajuste do modelo. Aplicações com uso de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5059":{"codigo":"EMB5059","nome":"Metodologia de Projeto","ementa":"Introdução: contexto e importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos\/serviços. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos\/serviços. Projeto preliminar: modelagem, análise e simulação de soluções de projeto. Projeto detalhado. Técnicas de prototipagem. Desenvolvimento de projetos com a Comunidade. Técnicas e conceitos de Desenho Universal em projetos de engenharia.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":800,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5061":{"codigo":"EMB5061","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características dos sistemas de medição; Calibração e rastreabilidade metrológica;Estimativa de incerteza de medição; Comprovação metrológica;Práticas em laboratório (grandezas mecânicas e elétricas).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5064":{"codigo":"EMB5064","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5067":{"codigo":"EMB5067","nome":"Gestão da Qualidade","ementa":"A Evolução do conceito e as dimensões da qualidade; Fundamentos e princípios da gestão da qualidade; Abordagem de risco no planejamento estratégico e operacional; Normas de Sistemas de Gestão da Qualidade e o processo de certificação; Auditorias de sistema, de processo e de produto; Manutenção e Melhoria Contínua na gestão da qualidade; Normas setoriais de sistemas de gestão da qualidade.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5100":{"codigo":"EMB5100","nome":"Projeto Empreender e Inovar","ementa":"Processo de concepção de produtos, serviços e negócios. Aplicação de conceitos e ferramentas de gestão. Aplicação de modelos para desenvolvimento de novos negócios","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5115":{"codigo":"EMB5115","nome":"Vibrações","ementa":"Introdução aos problemas de vibração em engenharia. Terminologia. Princípios Básicos. Sistemas com um grau de liberdade: vibração livre, métodos de energia, amortecimento e vibração forçada. Sistemas com dois graus de liberdade: vibração livre e forçada. Sistemas com múltiplos graus de liberdade. Introdução aos sistemas contínuos. Introdução aos sistemas de medição de vibrações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014 e EMB5041","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5117":{"codigo":"EMB5117","nome":"Introdução ao Método de Elementos Finitos","ementa":"Sistemas CAE (Computer Aided Engineering). Matriz de rigidez e montagem do sistema de equações. Problemas lineares unidimensionais e bidimensionais. Graus de liberdade e funções de interpolação dos elementos. Modelo constitutivo do material. Análise de tensões e curva de convergência. Elementos isoparamétricos. Integração numérica. Aplicação em softwares comerciais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5872","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5320":{"codigo":"EMB5320","nome":"Empreendedorismo e Inovação","ementa":"Conceito de inovação. Tipos de inovação. Estratégias de Inovação. A inovação como um processo organizacional. Mecanismos de fomento e cooperação em pesquisa e desenvolvimento. Empreendedorismo. Características, tipos e habilidades do empreendedor. Plano de Negócios: etapas, processos e elaboração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5059 e EMB5120 e EMB5961","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5631":{"codigo":"EMB5631","nome":"Programação III","ementa":"Fundamentos da orientação a objetos: herança, herança múltipla, polimorfismo, encapsulamento, \nconstrutores e destrutores, associação. Sobrecarga de operadores. Programação genérica \n(metaprogramação estática).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5649","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5649":{"codigo":"EMB5649","nome":"Programação II","ementa":"Apontadores, alocação dinâmica de memória. Recursividade. Algoritmos de ordenação e busca. Tipos abstratos de dados. Listas, pilhas, filas e árvores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5648","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5663":{"codigo":"EMB5663","nome":"Aprendizado de máquina","ementa":"Visão geral acerca de Aprendizado de Máquina. Principais paradigmas de aprendizado: aprendizado supervisionado, aprendizado não supervisionado e aprendizado por reforço. Qualidade e pré-processamento de dados. Métricas e estratégias para avaliação experimental de modelos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5631","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5889":{"codigo":"EMB5889","nome":"Geotecnia Ambiental","ementa":"Projetos de aterros de resíduos. Remediação de áreas contaminadas. Processos erosivos. Reutilização de resíduos e rejeitos em aplicações geotécnicas: viabilidade técnica, logística e ambiental.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5851","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5890":{"codigo":"EMB5890","nome":"Patologia das Construções","ementa":"Conceitos. Agentes causadores de manifestações patológicas em obras de infraestrutura. Patologias em construções de concreto armado, Sistemas de revestimento, impermeabilizações, Sistemas de vedação vertical; de fundações e de pavimentos.; via permanente ferroviária; pistas aeroportuárias Diagnóstico e prognóstico. Prevenção.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5891":{"codigo":"EMB5891","nome":"Tópicos de Modelagem de Informações de Construção (BIM) - Edificações","ementa":"Conceitos do BIM (Building Information Modeling  Modelagem de Informações de Construção) aplicado a obras de edificações, Recursos, Softwares utilizados, Modelos nD (Modelagem, Planejamento, Custos), Compatibilização de projetos, Simuladores, Recursos, Interoperabilidade, Trabalho colaborativo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5871 e EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5892":{"codigo":"EMB5892","nome":"Tópicos de Modelagem de Informações de Construção (BIM) Infraestrutura","ementa":"Conceitos do BIM (Building Information Modeling Modelagem de Informações de Construção) aplicado a obras de infraestrutura, Recursos,Softwares utilizados, Modelos nD (Modelagem;, Planejamento, Custos), Compatibilização de projetos, Simuladores, Recursos, Interoperabilidade, Trabalho colaborativo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5893":{"codigo":"EMB5893","nome":"Estabilização de solos e metodologias de dosagem","ementa":"Princípios de estabilização de solos. Estabilização mecânica. Estabilização granulométrica. Estabilização físico-química. Metodologias de dosagem. Tratamento de solos com cimento, cal e resíduos industriais. Propriedades mecânicas de solos estabilizados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5835 e EMB5844","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5894":{"codigo":"EMB5894","nome":"Ensaios não destrutivos","ementa":"Introdução. Histórico. Ensaios não-destrutivos e parcialmente destrutivos. Princípios de funcionamento. Teoria básica. Vantagens e desvantagens. Aplicações práticas. Áreas de pesquisa.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5882","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5895":{"codigo":"EMB5895","nome":"Inovação na construção","ementa":"Novos materiais e tecnologias utilizadas na construção civil (Materiais Novos materiais e tecnologias utilizadas na construção civil; Requisitos para seleção dos materiais e técnicas da construção civil e implantação de tecnologias construtivas racionalizadas em obras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5896":{"codigo":"EMB5896","nome":"Construções Sustentáveis","ementa":"Introdução à sustentabilidade, Impacto ambiental da indústria da construção, Materiais e Sistemas construtivos e a sustentabilidade. Uso e ocupação do solo. Eficiência energética, uso racional de água, uso de recursos renováveis, gerenciamento de resíduos. Métodos de avaliação de sustentabilidade de edifícios. Métodos de avaliação de sustentabilidade de edifícios (sistemas de certificação). Uso e ocupação do solo (escolha do local de projeto de acordo com critérios de sustentabilidade). Materiais e Sistemas construtivos e a sustentabilidade (conceito de energia embutida e ciclo de vida útil, materiais de acabamento). Eficiência energética, uso racional de água, uso de recursos renováveis, gerenciamento de resíduos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5876","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5897":{"codigo":"EMB5897","nome":"Concepção Estrutural","ementa":"Conceito de concepção estrutural aliado à arquitetura. Sistemas estruturais disponíveis e suas aplicações. Exemplos de concepção e estudos de caso. Utilização de modelos estruturais físicos qualitativos para pré-avaliação do comportamento estrutural. Avaliação quantitativa dos modelos físicos em plataformas computacionais de análise estrutural.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5882","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5898":{"codigo":"EMB5898","nome":"Obras de drenagem urbana e rodoviária","ementa":"Introdução. Conceitos de drenagem. Hidrologia para fins de dimensionamento. Noções básicas de hidráulica. Obras de drenagem superficial e profunda. Controle de inundações. Projetos de drenagem. Estudos de caso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5874 e EMB5878","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5960":{"codigo":"EMB5960","nome":"Transportes Não Motorizados","ementa":"Políticas de transportes não motorizado, dinâmica urbana à circulação não motorizada: circulação de pedestres e sistema cicloviário. Métodos de análise, instrumentos e indicadores para transportes não motorizados.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5962":{"codigo":"EMB5962","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e Operacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5968":{"codigo":"EMB5968","nome":"Projeto e Operação de Terminais","ementa":"Conceituação geral e função dos terminais de transportes: rodoviárias, estações de metrô e de trem de curta e de longa distância, portos e aeroportos. Dimensionamento físico das instalações para a operação de transportes. Capacidades de transporte. Nível de serviço em terminais de transportes. Indicadores de desempenho de terminais de transportes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5971":{"codigo":"EMB5971","nome":"Sistemas de Transportes","ementa":"O transporte no contexto urbano. Introdução ao Planejamento de transportes. Aspectos técnicos e econômicos das modalidades de transportes. Coordenação das modalidades de transportes. Operações de transporte de cargas perigosas. Concessões e Contratos. Transportes especializados. Os transportes no Brasil e novas perspectivas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5972":{"codigo":"EMB5972","nome":"Impactos Ambientais dos Transportes","ementa":"Impactos Ambientais dos Transportes de Produtos Perigosos. Impactos Ambientais dos diferentes modos. Licenciamento Ambiental e Legislação Ambiental Aplicada ao Setor de Transportes. Metodologias de Avaliação dos Impactos Ambientais dos Transportes. Medidas Mitigadoras e Compensatórias dos Impactos Ambientais dos Transportes. Análise de Ciclo de Vida em Transportes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5973":{"codigo":"EMB5973","nome":"Sistemas de Informações Geográficas","ementa":"Elementos essenciais. Dados espaciais: estrutura (matricial e vetorial) e geometria (pontos, linhas e polígonos). Possibilidades e importância de aplicação em problemas de mobilidade. Ferramentas básicas: análise, geoprocessamento, visualização e aquisição de dados. Gerência de bancos de dados. Ferramentas específicas de análise estatística espacial. Resoluções de problemas e desenvolvimento de aplicações para planejamento de mobilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1200,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5974":{"codigo":"EMB5974","nome":"Pesquisa Operacional I","ementa":"Introdução: histórico, objetivos, restrições e modelos. Formulação de modelos de programação linear. Solução gráfica. Solução algébrica. Método simplex. Dualidade. Análise de sensibilidade. Problemas lineares especiais: Problema de transportes; Problema de atribuição; Problema de caminho mínimo; Problema de fluxo máximo. Ferramentas computacionais para solução de problemas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5975":{"codigo":"EMB5975","nome":"Pesquisa Operacional II","ementa":"Programação dinâmica. Formulação de modelos não lineares. Condições de otimalidade para problemas irrestritos e restritos. Métodos de otimização para problemas irrestritos e para problemas restritos. Programação quadrática. Programação separável. Programação convexa. Ferramentas computacionais para solução de problemas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5974","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5977":{"codigo":"EMB5977","nome":"Logística I","ementa":"Conceitos: Logística, Logística de Suprimentos, Logística de Distribuição e Logística Integrada. Logística reversa. Cadeia de Suprimentos. Processos da Cadeia de Suprimentos. Gestão da Cadeia de Suprimentos. Nível de Serviço Logístico. Indicadores de Desempenho. Tecnologias e Processos da Cadeia de Suprimentos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5978":{"codigo":"EMB5978","nome":"Logística II","ementa":"Gestão de materiais. Previsão de Demanda. Introdução ao Planejamento de Vendas e operações. Planejamento e controle da produção. Noções de Teoria das restrições. Dimensionamento e controle de estoques. Custos relacionados aos Estoques. Desenvolvimento e avaliação de fornecedores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5058 e EMB5977","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5979":{"codigo":"EMB5979","nome":"Logística III","ementa":"Armazenagem. Custos de Armazenagem. Unidades de estocagem e movimentação de armazéns. Distribuição física. Custos de distribuição. Canais de distribuição. Modalidades de entrega. A inter-relação entre o marketing e a distribuição física. Cadeia de suprimentos e o relacionamento com o cliente. Tópicos em logística urbana. Noções de logística internacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5977","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5983":{"codigo":"EMB5983","nome":"Engenharia de Tráfego II","ementa":"Engenharia de Tráfego Aeroviário: Definições e Estrutura do Espaço Aéreo; Sistemas de Controle de Tráfego Aéreo. Engenharia de Tráfego Ferroviário: Mecânica de Locomoção de Veículos Ferroviários; Capacidade Ferroviária; Sistemas de Controle de Tráfego Ferroviário. Engenharia de Tráfego Rodoviário: Mecânica de Locomoção de Veículos Rodoviários; Modelos de Fluxo de Tráfego (filas, shockwaves, veículos probe); Rotatórias e Canalizações; Dimensionamento de Semáforos; Modelos de Simulação; Segurança Viária: Fundamentos de Acidentes, Fatores Associados à Severidade, Fatores Associados à Frequência, Avaliação de Conflitos, Modelagem, Pontos Críticos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5982","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5992":{"codigo":"EMB5992","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e Operacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6800":{"codigo":"EMB6800","nome":"Disciplina em Pós-graduação 1","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6801":{"codigo":"EMB6801","nome":"Disciplina em Pós-graduação 2","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB6802":{"codigo":"EMB6802","nome":"Disciplina em Pós-graduação 3","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado é dado pelas disciplinas oferecidas em programa de pós-graduação da UFSC, com as quais esta disciplina tem equivalência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EMB5879":{"codigo":"EMB5879","nome":"Atividades Complementares","ementa":"Atividades Complementares","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5886":{"codigo":"EMB5886","nome":"Projetos de Extensão","ementa":"Projetos de Extensão","carga_horaria":270,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5887":{"codigo":"EMB5887","nome":"Cursos de Extensão","ementa":"Cursos de Extensão","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5888":{"codigo":"EMB5888","nome":"Eventos de Extensão","ementa":"Eventos de Extensão","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"}}}}}