{"codigo":555,"nome":"AGRONOMIA [Campus Curitibanos]","sigla_centro":"CBS","sigla_departamento":"CRC","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20122":20122,"20141":20141,"20212":20212},"situacao":0,"situacao_descricao":"regular","num_vagas_total":500,"num_vagas_primeiro_semestre":50,"num_vagas_segundo_semestre":50,"presencial":true,"curriculos":{"20122":{"id":"505","codigo":20122,"codigo_curso":555,"carga_horaria_ufsc":5292,"carga_horaria_mec":4800,"aulas_semana_min":18,"aulas_semana_esperado":25,"aulas_semana_max":31,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":14,"descricao":"Referente ao curriculo 20122","ucs":{"CRC7110":{"codigo":"CRC7110","nome":"Introdução as Ciências Rurais","ementa":"Consciência crítica a respeito da escolha profissional e institucional, da formação acadêmica e dos compromissos na sociedade.  Conhecimento da vida acadêmica, da trajetória histórica da agricultura e da ciência agronômica, do desenvolvimento rural e sobre as problemáticas sociais e científicas mais importantes para a formação e o exercício profissional.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"AGC7100 ou CRC7100","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7111":{"codigo":"CRC7111","nome":"Ecologia geral","ementa":"Conceitos fundamentais em Ecologia. Níveis hierárquicos de organização. Biomas. Conceito de ecossistema, principais componentes e dinâmica. Fatores Bióticos e Abióticos. Ciclos biogeoquímicos. Ecologia trófica, cadeias e teias alimentares. Fluxo de energia e Ciclagem de materiais. Fatores ecológicos. Dinâmica de populações. Estrutura de comunidades. Sucessão ecológica. Diversidade das comunidades biológicas. Evolução e dinâmica. Biodiversidade e Usos de Recursos Naturais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CBV7103 ou CRC7101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7113":{"codigo":"CRC7113","nome":"Cálculo Diferencial e Integral","ementa":"Funções. Limites. Continuidade. Derivadas. Estudo de funções. Aplicações das derivadas. Integral Definida. Integral Indefinida. Cálculo de Área e Volume.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"CNS7113 ou CRC7103","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7114":{"codigo":"CRC7114","nome":"Química Orgânica","ementa":"Elemento químico e classificação periódica. Ligações químicas. Polaridade e forças intermoleculares. Geometria molecular. Estudo das soluções. Funções, nomenclatura, propriedades físico-químicas e reatividade dos principais compostos orgânicos: alcanos, alcenos, compostos aromáticos, fenóis, éteres, epóxidos, haletos de alquila, aldeídos, cetonas, ácidos carboxílicos e seus derivados. Noções básicas sobre compostos de interesse biológico, agroquímicos e poluentes ambientais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CNS7114 ou CRC7104","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7115":{"codigo":"CRC7115","nome":"Produção textual","ementa":"O estudo da estrutura e da tipologia de textos, destacando-se tópicos da gramática da língua portuguesa; estudo e produção de textos técnicos e científicos com vistas à formação do pesquisador.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"CNS7115 ou CRC7105","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7116":{"codigo":"CRC7116","nome":"Zoologia Geral","ementa":"Conceito e divisão da Zoologia; Sistemática zoológica: Classificação Lineana, Fenética e sistemática filogenética; Características gerais dos protozoários e importância evolutiva, agropecuária e médico-veterinária; Características gerais dos invertebrados (morfologia, anatomia e reprodução), importância evolutiva, agropecuária e médico-veterinária de platelmintos, blastocelomados (nematóides, rotíferas e acantocéfalos), moluscos, artrópodes; Características gerais dos vertebrados (morfologia, anatomia e reprodução); características gerais, importância evolutiva, pecuária e médico-veterinária dos  peixes, anfíbios, répteis, aves e mamíferos.  Domesticação de vertebrados. Diversidade de vertebrados silvestres.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CBV7102 ou CRC7106","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7200":{"codigo":"CRC7200","nome":"Ética e Filosofia da Ciência","ementa":"Ética e filosofia da ciência, definições conceituais. Relação Indivíduo, sociedade e cultura: processo de desenvolvimento e constituição do ser humano (cultura, linguagem, humanização). Filosofia da ciência: construção do conhecimento cientifico; diversidade de saberes, correlações entre ciência e sociedade. Ética e Ciência. Os múltiplos usos da Ética: na profissão, nas organizações e na sociedade. O interrelacionamento entre Filosofia e Ética.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"CNS7200","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7209":{"codigo":"CRC7209","nome":"Biologia Celular","ementa":"Níveis de organização das estruturas biológicas. Diversidade celular. Organização da célula procariota e eucariota animal e vegetal. Evolução celular. A Teoria Celular: as células e as funções celulares. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Métodos de estudo em biologia celular.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"AGC7101 ou CRC7300","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7211":{"codigo":"CRC7211","nome":"Física","ementa":"Vetores. Deslocamento. Velocidade. Condições gerais de equilíbrio. Trabalho. Energia. Conservação de Energia. Termodinâmica. Fluidos. Gases. Eletrostática. Fenômenos ondulatórios. Óptica Geométrica. Óptica Física. Introdução à Física Nuclear e a Física Atômica.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CNS7211 ou CRC7201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7212":{"codigo":"CRC7212","nome":"Botânica e Sistemática","ementa":"Introdução à Botânica. Noções de plantas avasculares. Conceitos e métodos taxonômicos. Sistemas de classificação. Nomenclatura botânica. Morfologia e sistemática de plantas vasculares. Principais táxons de interesse agronômico e florestal.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CBV7105 ou CRC7404","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7213":{"codigo":"CRC7213","nome":"Bioquímica","ementa":"Introdução à Bioquímica; Química e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos, enzimas, coenzimas, vitaminas, nucleotídeos e ácidos nucléicos; Bioenergética; Metabolismo de carboidratos, lipídeos e aminoácidos; Integração e regulação do metabolismo.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CBV7104 ou CRC7301","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7214":{"codigo":"CRC7214","nome":"Química Analítica","ementa":"Introdução à análise química quantitativa e qualitativa. Erro e tratamento de dados analíticos. Estudo do pH. Precipitação e solubilidade. Métodos titulométricos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CNS7214 ou CRC7204","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7215":{"codigo":"CRC7215","nome":"Sociologia Rural","ementa":"Campo da Sociologia Rural. Estrutura fundiária e ações de ordenamento territorial e fundiário; formação sócio-econômica rural e relação com os modelos de desenvolvimento do Brasil. Desigualdade e diversidade sócio cultural da população rural. Relação campo-cidade, perspectivas de territorialidade e sustentabilidade.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"CNS7215 ou CRC7205","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7216":{"codigo":"CRC7216","nome":"Geologia e Mineralogia","ementa":"Introdução a Geologia; A Terra e a litosfera; Minerais e Rochas; Geologia do Brasil e da Região Sul; Intemperismo; Produtos do Intemperismo (Solos e Mineralogia da Fração Argila).","carga_horaria":36,"fase_sugestao":2,"equivalencia":"CNS7216 ou CRC7305","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7309":{"codigo":"CRC7309","nome":"Embriologia e Histologia","ementa":"Fundamentos de divisão celular (mitose e meiose); Processos de gametogênese. Tipos de fecundação.  Tipos de ovos.  Mecanismos celulares e moleculares inerentes ao desenvolvimento embrionário. Diferenciação dos folhetos embrionários. Etapas do desenvolvimento (segmentação à gastrulação) com ênfase em insetos e vertebrados. Desenvolvimento, importância evolutiva e fisiológica dos Anexos embrionários com ênfase em insetos.   Origem dos tecidos animais. Características dos tecidos: epitelial e Anexos, conjuntivo, adiposo, cartilaginoso, ósseo, nervoso e órgãos dos sentidos, muscular, sanguíneo e hemocitopoese.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"CRC7320","prerequisito":"CRC7209","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7311":{"codigo":"CRC7311","nome":"Genética","ementa":"Material genético, estrutura, função, e expressão gênica. Segregação meiótica e permuta. Leis básicas da Genética. Mutação. Interação genética. Determinação do sexo e herança ligada ao sexo. Linkagem e mapas cromossômicos. Herança citoplasmática. Variação genética. Evolução. Genômica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"AGC7102 ou CRC7603","prerequisito":"CRC7209","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7312":{"codigo":"CRC7312","nome":"Desenho Técnico","ementa":"Normas para o desenho técnico (ABNT). Caligrafia e traçado. Instrumentos e material de desenho. Noções de Geometria Descritiva: projeções do ponto, da reta e do plano. Projeções: cilíndrica ortogonal e oblíqua. Projeção em vistas ortográficas e perspectiva isométrica. Noções de desenho arquitetônico aplicado a edificações rurais. Noções de desenho topográfico e projeções cotadas. Noções de desenho cartográfico.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"CBV7201 ou CRC7102","prerequisito":"CRC7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7313":{"codigo":"CRC7313","nome":"Hidrologia","ementa":"Conceito e escopo da hidrologia. Ciclo hidrológico. Bacia hidrográfica. Componentes do ciclo hidrológico. Qualidade da água. Obtenção e análise de registros hidrológicos. Comportamento de bacias hidrográficas.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"AGC7107 ou CRC7303","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7314":{"codigo":"CRC7314","nome":"Estatística Básica","ementa":"Análise estatística na área de ciências agrárias. Estatística descritiva: Tabelas, gráficos, medidas de tendência central. Medidas de dispersão: amplitude total, variância, desvio padrão, coeficiente de variação e erro padrão da média. Distribuições de probabilidade; Amostragem. Testes de hipótese; Intervalo de confiança, t-teste. Utilização de programas de computador para análise e realização de trabalhos estatísticos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"CNS7314 ou CRC7304","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7316":{"codigo":"CRC7316","nome":"Morfofisiologia animal","ementa":"Fisiologia celular e bioeletrogênese, Morfologia e fisiologia do sistema endócrino, Morfologia e fisiologia do sistema respiratório, Morfologia e fisiologia do sistema reprodutor masculino, Morfologia e fisiologia do sistema reprodutor feminino, Morfologia e fisiologia da gestação e do parto e puerpério, Fisiologia da lactação, Fisiologia dos líquidos orgânicos, Termorregulação, Morfologia e fisiologia do sistema digestório, Morfologia e fisiologia do sistema muscular.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"CBV7118 ou CRC7202","prerequisito":"CRC7209 e CRC7213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7317":{"codigo":"CRC7317","nome":"Climatologia e Meteorologia","ementa":"Natureza e campo da climatologia agrícola. Elementos e fatores climáticos. Instrumentos e dispositivos para medição de variáveis meteorológicas. Interpretação de dados meteorológicos e climatológicos. Evapotranspiração. Balanço hídrico. Princípios de classificação climática. Clima e agricultura.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"AGC7103 ou CRC7303","prerequisito":"CRC7211","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7417":{"codigo":"CRC7417","nome":"Propriedades físicas e químicas dos solos","ementa":"Introdução à Ciência do Solo; Fase sólida mineral do solo (fenômenos de superfície); Composição da fase sólida orgânica do solo; Solos ácidos e solos afetados por sais; Oxidação e redução do solo; Densidade de partículas e do solo; Porosidade do solo; Textura do solo; Estrutura do solo; Consistência do solo; Água no solo; Temperatura do solo.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"AGC7105","prerequisito":"CRC7211 e CRC7214 e CRC7216","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7315":{"codigo":"CRC7315","nome":"Morfologia e Classificação dos Solos","ementa":"Introdução a Pedologia; Fatores e processos de formação do solo; Morfologia dos solos; Classificação dos solos; Sistemas de Classificação de Solos; Solos do Brasil e de Santa Catarina.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CNS7315 ou CRC7305","prerequisito":"CRC7216 e CRC7417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7409":{"codigo":"CRC7409","nome":"Desenvolvimento Rural","ementa":"Transformações recentes no mundo rural e concepção sistêmica da realidade; Padrões e modelos de desenvolvimento: critérios de análise. Mundo rural, ecologia e desenvolvimento sustentável. Desenvolvimento, Pluriatividade e Multifuncionalidade. Territorialidade e políticas públicas. Planejamento territorial regional\/municipal: Organização, poder local e participação política.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CNS7409 ou CRC7224","prerequisito":"CRC7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7411":{"codigo":"CRC7411","nome":"Microbiologia Geral","ementa":"Introdução a Microbiologia. Variabilidade em microorganismos. Caracterização, e Classificação dos microorganismos (Bactérias, Fungos, Algas, Protozoários e Vírus). Fisiologia dos microorganismos: produção, biossíntese, nutrição e reprodução. Técnicas de isolamento e observação de microorganismos. Influência dos fatores ambientais sobre os microorganismos. Microrganismos de interesse ecológico e econômico. Mecanismos de ação e interação entre os microrganismos e o hospedeiro. Controle dos microorganismos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"AGC7106 ou CRC7401","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7412":{"codigo":"CRC7412","nome":"Legislação e Gestão Ambiental","ementa":"Agronegócio e meio ambiente. Sistemas de gestão ambiental públicos e privados. Legislação ambiental. Código Florestal. Licenciamento ambiental: EIA\/RIMA. Marketing ambiental. Certificação ambiental.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"CNS7412 ou CRC7402","prerequisito":"CRC7114 e CRC7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7413":{"codigo":"CRC7413","nome":"Zootecnia","ementa":"Aspectos da criação de suínos e ovinos para o estado de Santa Catarina; principais raças; melhoramento genético e reprodução; nutrição, manejo nas diferentes fases de criação; instalações; controle sanitário; planejamento da criação.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7403","prerequisito":"CRC7316","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7414":{"codigo":"CRC7414","nome":"Morfofisiologia vegetal","ementa":"Meristemas, Parênquimas, tecidos de revestimento, de sustentação, de secreção e vasculares: aspectos estruturais. Raiz, caule e folha: aspectos anatômicos e fisiológicos (metabolismo: absorção e transporte de água, nutrição mineral, absorção de sais minerais, transporte no floema, fotossíntese, respiração. assimilação do nitrogênio). Flor, fruto, semente e plântula: aspectos anatômicos, ecológicos e fisiológicos (crescimento e desenvolvimento: hormônios e reguladores de crescimento, divisão e diferenciação celular, fotomorfogênese, respostas de crescimento à temperatura, fotoperiodismo, floração). Adaptações anatômicas e fisiológicas a diferentes ambientes.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"AGC7104 ou CRC7404","prerequisito":"CRC7209 e CRC7212 e CRC7213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7415":{"codigo":"CRC7415","nome":"Entomologia","ementa":"Noções de morfologia dos insetos das famílias de importância agrícola. Desenvolvimento e metamorfose das principais famílias de importância agrícola. Identificação das ordens e famílias com espécies de importância agrícola. Importância econômica dos insetos.  Métodos de manejo e controle de insetos pragas. Pragas dos produtos armazenados. Insetos associados às principais culturas: reconhecimento das espécies, aspectos biológicos, prejuízos causados em métodos de controle específicos por cultura.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"CBV7107","prerequisito":"CRC7114 e CRC7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7416":{"codigo":"CRC7416","nome":"Estatística experimental","ementa":"Princípios básicos de experimentação, planejamento e implantação de experimentos. Delineamento inteiramente casualizado e em blocos casualizados. Experimentos fatoriais. Correlação e regressão linear. Testes paramétricos e não paramétricos. Testes de aderência. Tabelas de contingência.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CNS7416","prerequisito":"CRC7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7509":{"codigo":"CRC7509","nome":"Agroecologia","ementa":"Formas de agricultura, convencional e agroecológica, princípios, evolução, práticas adotadas, resultados, problemas. Princípios ecológicos na agricultura: dinâmica de nutrientes, da água e da energia, biologia do solo, biodiversidade. Base ecológica do manejo de pragas e doenças. Ecologia do manejo de ervas daninhas. A ciclagem de nutrientes no agroecossistema através de adubação verde e da compostagem. Tecnologias agroecológicas. Manejo sustentável do solo: cultivo em faixas, cordões de contorno, cultivo mínimo, plantio direto, \"mulching\". Modelos alternativos de agricultura: orgânica, biodinâmica, natural. Introdução a produção agroecológica específica em olerícolas, frutíferas, cereais e pastagens e sistemas agroflorestais.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"AGC7128 ou CRC7220","prerequisito":"CRC7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7511":{"codigo":"CRC7511","nome":"Silvicultura","ementa":"Caracterização e histórico da exploração das florestas regionais. Fitogeografia. Dendrometria e Inventário Florestal. Implantação e manejo econômico de florestas plantadas de essências nativas e exóticas. Manejo de florestas para produção de madeira e produtos florestais não-madeireiros. Elaboração de projetos de manejo de espécies e ecossistemas florestais. Legislação Florestal.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CBV7309 ou CRC7501","prerequisito":"CRC7414","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7512":{"codigo":"CRC7512","nome":"Conservação e Uso da Biodivesidade","ementa":"Qualificação, funções, valoração e perda da biodiversidade. Glossário e conceitos sobre recursos biológicos e recursos genéticos. A convenção sobre a diversidade biológica (CDB) e outros acordos e convenções e seus impactos sobre os recursos genéticos (RGs). Uso, conservação e manejo de Recursos Genéticos. Mudanças climáticas e biodiversidade. Biodiversidade, agricultura e sustentabilidade. Agrobiodiversidade e conhecimento tradicional.  Abordagens baseadas na legislação sobre a conservação e uso dos RGs. Coleta e caracterização de RGs.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"AGC7118","prerequisito":"CRC7414","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7513":{"codigo":"CRC7513","nome":"Topografia e georreferenciamento","ementa":"Limites e divisão da topografia. Sistemas de Referência; Projeções Cartográficas. Métodos e Medidas de Posicionamento Geodésico; Planimetria. Altimetria. Equipamentos topográficos. Desenho Topográfico; Introdução e conceitos da Topografia aplicada ao Georreferenciamento; Normas técnicas aplicadas ao Georreferenciamento; Coleta de dados e Levantamento de campo: por técnicas convencionais e por GNSS; Tratamento de dados: noções sobre Ajustamentos Estatísticos; Elaboração de peças técnicas; Relatório técnico; Monografia do marco geodésico.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"CBV7203 ou CRC7503","prerequisito":"CRC7312","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7514":{"codigo":"CRC7514","nome":"Poluição ambiental","ementa":"Energia, desenvolvimento e poluição; aspectos físicos e químicos da poluição dos ambientes aquáticos e terrestres; poluição atmosférica; quimiodinâmica dos poluentes no ambiente; variáveis de interesse na avaliação e monitoramento do ambiente; critérios e padrões de qualidade da água e do ar; introdução aos sistemas convencionais e alternativos de tratamento e controle da poluição.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CNS7514","prerequisito":"CRC7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7515":{"codigo":"CRC7515","nome":"Reprodução vegetal","ementa":"Reprodução sexuada e assexuada de plantas: Formação, maturação e composição das sementes. Dormência e Germinação. Princípios de conservação e armazenamento de sementes.  Propagação assexuada: Metodologias e Instalações para reprodução de plantas hortícolas e arbóreas. Composição de Substratos e Acondicionamento das mudas.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"CRC7414","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7516":{"codigo":"CRC7516","nome":"Biologia e fertilidade dos solos","ementa":"Bases conceituais úteis para a Fertilidade do Solo. Acidez do solo e calagem. Biogeoquímica do fósforo, potássio, nitrogênio e enxofre. Dinâmica dos micronutrientes, do cálcio e do magnésio. Adubação orgânica. Introdução ao estudo da biologia do solo. Artrópodes do solo. Aracnídeos e Miriápodos. Nematóides não fitogênicos. Moluscos, Crustáceos e outros organismos do solo. Oligoquetas e Biodiversidade.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"AGC7109","prerequisito":"CRC7411 e CRC7417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7517":{"codigo":"CRC7517","nome":"Fitopatologia","ementa":"Histórico e importância, conceitos e diagnose de doenças de plantas. Sintomatologia. Etiologia. Micologia. Bacteriologia. Virologia. Nematologia. Variedades dos agentes Fitopatológicos. Resistência das plantas a doenças. Epidemiologia. Doenças típicas causadas por Fungos, Bactérias, Vírus e Nematóides. Métodos de controle de doenças de plantas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"AGC7110","prerequisito":"CRC7114 e CRC7411","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7609":{"codigo":"CRC7609","nome":"Aquicultura","ementa":"Introdução à aquicultura; Ecossistemas aquáticos; Características Químicas e Físicas da água; princípios básicos de carcinicultura, mitilicultura e ranicultura.  Introdução à Piscicultura; Anatomia e Fisiologia de peixes; Espécies de peixes próprias para o cultivo; Construção de tanques para a piscicultura; Adubação e calagem de tanques; Alimentação e nutrição de peixes de cultivo; Noções de enfermidades em peixes.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7611":{"codigo":"CRC7611","nome":"Biotecnologia","ementa":"Histórico, importância e uso da biotecnologia. Totipotência celular e aspectos comparativos em plantas e animais. Cultura de células, tecidos e órgãos. Linhagens e fusões celulares e hibridomas. Manipulação de embriões e Sementes sintéticas. Biorreatores. Criopreservação. Produção de metabolitos secundários \"in vitro\". Conceito e implicações dos Organismos Geneticamente Modificados, Bioética, Biossegurança e Meio Ambiente.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7112","prerequisito":"CRC7311","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7612":{"codigo":"CRC7612","nome":"Construções rurais","ementa":"Resistência dos materiais; estudo dos materiais, dos elementos estruturais e partes complementares de uma edificação; montagem de projetos de edificações.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"CBV7204","prerequisito":"CRC7513","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7613":{"codigo":"CRC7613","nome":"Economia e administração rural","ementa":"Conhecimentos de economia para discutir; leis de oferta e da procura; Recursos e tendências do meio rural. Demanda e procura dos produtos agropecuários e florestais; Fatores que afetam a produção; Mercado; Comercialização e; Política de preços. Juros. Crédito e Financiamento. Análise da rentabilidade econômica. Administração e Gestão Rural Simplificada. Teoria de produção. Tipologia dos Custos. Contabilidade. Principais controles: Caixa e Estoques. Depreciação e Exaustão. Comercialização; Crédito e seguro agrícola.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"CNS7613 ou CRC7302 ou CRC7400","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7614":{"codigo":"CRC7614","nome":"Restauração Ambiental","ementa":"Diagnóstico da degradação ambiental em ecossistemas naturais, com enfoque para as atividades agrícolas e florestais. Princípios ecológicos para a restauração: solo, interações ecológicas e sucessão. Práticas de restauração de áreas degradadas. Legislação aplicada a recuperação e restauração ambiental.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"CBV7315","prerequisito":"CRC7512","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7615":{"codigo":"CRC7615","nome":"Tecnologia Agroalimentar","ementa":"Proporcionar conhecimentos sobre a agroindústria e sua importância   no desenvolvimento regional, sobre as características dos  alimentos  e matérias primas agropecuárias, as alterações a que  estão sujeitas  e os métodos de conservação, bem como, as maneiras  de produção de  alimentos seguros.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"CRC7405","prerequisito":"CRC7411","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7616":{"codigo":"CRC7616","nome":"Saneamento ambiental","ementa":"Conhecimento e conceituação das propriedades físicas, químicas e biológicas dos resíduos; conhecimentos básicos sobre operações e processos unitários; conceituação e tecnologias utilizadas para o tratamento de águas naturais e residuárias; discussão de propostas para controle e disposição de resíduos sólidos; alternativas para reciclagem de resíduos e reuso da água.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"CNS7615 ou CRC7402 e CRC7421","prerequisito":"CRC7514","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CRC7617":{"codigo":"CRC7617","nome":"Projetos em ciências rurais","ementa":"Introdução, concepção e delineamento de um projeto em ciências rurais.  Especificações do projeto. Elaboração e apresentação do projeto.","carga_horaria":144,"fase_sugestao":6,"equivalencia":"","prerequisito":"CRC7110 e CRC7111 e CRC7113 e CRC7114 e CRC7115 e CRC7116 e CRC7200 e CRC7209 e CRC7211 e CRC7212 e CRC7213 e CRC7214 e CRC7215 e CRC7216 e CRC7309 e CRC7311 e CRC7312 e CRC7313 e CRC7314 e CRC7315 e CRC7316 e CRC7317 e CRC7409 e CRC7411 e CRC7412 e CRC7413 e CRC7414 e CRC7415 e CRC7416 e CRC7417 e CRC7509 e CRC7511 e CRC7512 e CRC7513 e CRC7514 e CRC7515 e CRC7516 e CRC7517","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7701":{"codigo":"AGC7701","nome":"Agrostologia","ementa":"Morfofisiologia e taxonomia das plantas forrageiras. Características agronômicas das principais espécies forrageiras. Pastagens nativas de Santa Catarina. Implantação, melhoramento, conservação e manejo das pastagens. Adaptação climática e de condições de solo; composição química e valor nutritivo das forrageiras; caracterização e manejo das gramíneas e leguminosas anuais e perenes, hibernais e estivais. Conservação de forragens.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7123","prerequisito":"CRC7212 e CRC7316","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7702":{"codigo":"AGC7702","nome":"Hidráulica","ementa":"Introdução. Princípios de Hidrostática e Hidrodinâmica. Condutos forçados. Perdas de carga. Instalações de recalque. Noções sobre golpe de ariete. Condutos livres. Canais fechados e abertos. Energia específica. Bombas e Adutoras por recalque. Remanso. Ressalto hidráulico. Medidores de velocidade e vazão.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"AGC7117","prerequisito":"CRC7113 e CRC7313","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7703":{"codigo":"AGC7703","nome":"Horticultura","ementa":"Fundamentos da Ciência da Horticultura. Métodos de Propagação de plantas hortícolas, viveiros de produção e conservação de plantas matrizes, básicas e  certificadas. Dormência. Floração e Frutificação. Poda e sistemas de condução.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"AGC7116","prerequisito":"CRC7515","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7704":{"codigo":"AGC7704","nome":"Manejo e Conservação do Solo e da Água","ementa":"Introdução ao planejamento do uso das terras e ao planejamento conservacionista. Sustentabilidade e uso sustentável em agricultura. Princípios e conceitos de degradação do solo. Princípios e conceitos de manejo e conservação do solo e da água. Histórico do manejo e da conservação do solo e da água em Santa Catarina e no Brasil. Plantas de cobertura, rotação e consorciação de culturas. Erosão do solo e seu controle. Mecanismos e fatores que afetam a erosão hídrica. Práticas de controle da erosão hídrica do solo. Predição da erosão hídrica do solo. Manejo do solo em diferentes sistemas de preparo. Legislação em conservação do solo e da água.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"AGC7120","prerequisito":"CRC7417 e CRC7516","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7705":{"codigo":"AGC7705","nome":"Mecanização Agrícola","ementa":"Aspectos gerais sobre fontes de potência: força humana de trabalho, tração animal e motores. Tratores agrícolas, constituição, manutenção, operação e ensaios. Máquinas e implementos agrícolas: função, constituição e regulagens. Máquinas de colheita de grãos e forragens: regulagens e estudo de perdas de colheita. Aspectos de segurança na operação de máquinas e implementos: equilíbrio e transferência de peso. Planejamento, seleção e desempenho operacional da mecanização agrícola. Estudo econômico de conjuntos motomecanizados.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7108","prerequisito":"CRC7417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7706":{"codigo":"AGC7706","nome":"Melhoramento Vegetal","ementa":"Objetivos e conceitos. Origem e Evolução de Plantas Cultivadas. Conservação de germoplasma. Sistemas de Reprodução de Plantas Cultivadas. Estrutura Genética de Populações. Bases Genéticas dos Caracteres Qualitativos e Quantitativos. Métodos de Seleção de Plantas Autógamas e Alógamas (anuais e perenes). Interação Genótipo e Ambiente. Genética da resistência a pragas e moléstias.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7111","prerequisito":"CRC7311 e CRC7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7707":{"codigo":"AGC7707","nome":"Fitofisionomia Paisagística","ementa":"Importância econômica e social, origem, botânica, cultivares, exigências climáticas,  propagação, nutrição, tratos culturais, elaboração e execução de projetos, colheita e comercialização das principais espécies ornamentais. Plantas nativas com potencial ornamental.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"AGC7130","prerequisito":"CRC7515","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7708":{"codigo":"AGC7708","nome":"Tecnologia e Produção de Sementes","ementa":"Fisiologia, bioquímica e formação da semente. Germinação, dormência, composição química, deterioração e vigor das sementes. Princípios da produção das sementes com alta qualidade genética, física e fisiológica. Maturação. Colheita, secagem, beneficiamento, armazenamento, análises de sementes. Pragas e doenças de sementes.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7119","prerequisito":"CRC7515","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MVC7304":{"codigo":"MVC7304","nome":"Melhoramento Animal","ementa":"Noções básicas de genética e estatística; covariância genética entre parentes; parâmetros genéticos; seleção e ganho genético; métodos de seleção; interação genótipo ambiente; endogamia e cruzamento; manipulação cromossômica.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"CBV7817","prerequisito":"CRC7311 e CRC7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7709":{"codigo":"AGC7709","nome":"Bioenergia","ementa":"Leis da Termodinâmica e unidades de medida de energia. Fontes de energia renováveis e não renováveis. Matriz energética Brasileira. Agrocombustíveis. Análise e planejamento de sistemas eficientes de produção agrícola para a produção de Agrocombustíveis. Energia de biomassa, dejetos, algas, outros. Propriedades da madeira para energia. Processos de pirólise e carbonização. Briquetagem de biomassa  para energia. Marco Regulatório e Políticas públicas. Impactos ambientais e sócio-econômicos.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7132","prerequisito":"CRC7114 e CRC7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7710":{"codigo":"AGC7710","nome":"Fruticultura","ementa":"Importância econômica e social, origem, botânica, cultivares, exigências climáticas, propagação, nutrição, tratos culturais, colheita e comercialização das principais fruteiras de clima temperado, sub-tropical e tropical, com ênfase à videira, citricultura, frutas de caroço, macieira, pereira e pequenos frutos. Planejamento, elaboração e execução de projetos associados à cadeia produtiva em fruticultura.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7122","prerequisito":"AGC7703","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7711":{"codigo":"AGC7711","nome":"Irrigação e Drenagem","ementa":"Conceitos Básicos da Relação Solo-Água-Planta. Métodos de Manejo da Irrigação. Hidráulica de Linhas de Irrigação Pressurizadas. Métodos de Irrigação. Pressurizados (Aspersão e localizada). Irrigação por Superfície: (Inundação e Sulcos). Drenagem.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7126","prerequisito":"AGC7702","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7712":{"codigo":"AGC7712","nome":"Manejo Integrado de Pragas e Doenças","ementa":"Métodos e estratégias de controle de populações de pragas. Princípios de controle de  doenças de plantas, ciclo de relações patógeno-hospedeiro, epidemiologia, sistemas de previsão de doenças. Controle de doenças pós-colheita. Manejo integrado de pragas e doenças. Controle biológico. Agrotóxicos. Características dos principais fungicidas e inseticidas. Toxicologia humana e do ambiente. Legislação fitossanitária. Receituário agronômico. Tecnologia de aplicação de agroquímicos e produtos naturais.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"AGC7121","prerequisito":"CRC7415 e CRC7517","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7713":{"codigo":"AGC7713","nome":"Nutrição Animal","ementa":"Importância da Nutrição Animal, conceitos Básicos, Análise dos Princípios Nutritivos dos Alimentos, a Água e seu Metabolismo, Glicídios, Lipídios e Proteínas e seus Metabolismos, Vitaminas e Minerais na Nutrição Animal. Planejamento nutricional: exigências nutricionais dos animais domésticos monogástricos e poligástricos, composição e analise de alimentos.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7115","prerequisito":"AGC7701 e CRC7413","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7714":{"codigo":"AGC7714","nome":"Olericultura","ementa":"Importância econômica, alimentar e social, origem, botânica, cultivares, exigências climáticas, propagação, nutrição, tratos culturais, elaboração de projetos, colheita e comercialização das principais espécies olerícolas cultivadas em Santa Catarina.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7125","prerequisito":"CRC7515","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7715":{"codigo":"AGC7715","nome":"Planejamento TCC","ementa":"Planejamento e organização das ações; elaboração de projetos de pesquisa, extensão e estágio; definição de metas e objetivos; revisão da produção científica; técnicas de elaboração de monografia e apresentação pública.","carga_horaria":18,"fase_sugestao":8,"equivalencia":"AGC7133","prerequisito":"CRC7617","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EFL7616":{"codigo":"EFL7616","nome":"Sistemas Agroflorestais","ementa":"Histórico e classificação de Sistemas Agroflorestais (SAF). Ecologia dos sistemas agroflorestais. Dinâmica temporal e espacial de SAFs. Implantação e manejo de SAFs. Dimensões sociais e econômicas dos SAFs. Legislação aplicada aos SAFs.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"CBV7319","prerequisito":"CRC7111 e CRC7512","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MVC7603":{"codigo":"MVC7603","nome":"Bovinocultura de Corte e de leite","ementa":"Sistema operacional da Bovinocultura de Corte e sua cadeia produtiva: introdução - histórico e perspectivas; fase de cria - estação de monta, manejo mãe\/cria, manejo de  bezerros e nutrição; fase de recria - raças e cruzamentos; moderno novilho de corte; fase de terminação - pasto, confinamento, semi- confinamento, suplementação a pasto. Planejamento e evolução de rebanho. Introdução à bovinocultura de leite no Brasil, no mundo. Sistemas de produção. Custo de produção. Fatores determinantes da produção de leite. Instalações. Registro e controle leiteiro. Exterior e longevidade. Mastite e ordenha. Eficiência reprodutiva. Raças e cruzamentos. Teste de touros por avaliação da progênie. Conceitos básicos em fisiologia digestiva de ruminantes. Criação de bezerros e novilhas. Agrupamento e cálculo de exigência nutricional de rebanho. Parâmetros de balanceamento para dietas de vacas lactantes.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"CBV7801","prerequisito":"AGC7701","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7716":{"codigo":"AGC7716","nome":"Extensão Rural","ementa":"Extensão rural no Brasil: história e bases teóricas. Perfil e prática extensionistas. Extensão rural: prática dialógica, comunicação e metodologia. Métodos e técnicas sociais em extensão rural. Planejamento da ação extensionista, novas instancias participativas. Política Nacional de Assistência técnica e Extensão Rural.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"CNS7716","prerequisito":"CRC7409","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7717":{"codigo":"AGC7717","nome":"Fisiologia e Manejo Pós-colheita","ementa":"Abordagens bioquímicas e fisiológicas do desenvolvimento de frutos e outros órgãos de plantas submetidos a práticas de pós-colheita. Produtos vegetais climatéricos e não climatéricos. Padrões de maturação e qualidade. Fatores internos e externos relacionados com a senescência e causadores de perdas em pós-colheita. Avaliar perdas de massa e ocorrência de distúrbios fisiológicos no manejo após a colheita. Manejo, instalações e controle de qualidade de produtos vegetais.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7127","prerequisito":"AGC7710 e AGC7714","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7718":{"codigo":"AGC7718","nome":"Gestão e Marketing Agrário","ementa":"Conceitos básicos de marketing. Marketing estratégico aplicado a sistemas agroindustriais. Organização, comercialização e marketing de produtos. Cooperativas e outras organizações. Certificação de produtos. Identificação dos tipos e oportunidades de mercado. Empreendedorismo. Políticas públicas. Identificação e denominação de origem geográfica.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"CNS7718","prerequisito":"CRC7613","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7719":{"codigo":"AGC7719","nome":"Manejo Agroecológico de Animais","ementa":"Importância econômica, social e cultural da criação de animais domésticos com base em princípios e processos agroecológicos. Princípios e processos agroecológicos utilizados na alimentação, reprodução, sanidade e manejo criatório de frango, suínos, bovinos, ovinos, javali, caprinos, coelho e demais espécies de interesse zootécnico. Bem estar animal e qualidade da carne. Cadeia produtiva. Legislação. Ambiência, instalações. Projetos técnicos.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"AGC7713 e CRC7509","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7720":{"codigo":"AGC7720","nome":"Planejamento Integrado da Propriedade Rural","ementa":"Análise e avaliação da propriedade rural no contexto da segurança alimentar e inserção no mercado. Levantamento utilitário do meio físico e avaliação da capacidade de uso das terras e do(s) sistema(s) de produção da propriedade. Mapeamento temático digital da propriedade rural. Planejamento integrado e conservacionista de uso da propriedade rural. Estimativa dos custos e das receitas e da viabilidade da execução do planejamento. Projeto de uso de uma propriedade agrícola dentro de um enfoque sistêmico e integrado de produção.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7000","prerequisito":"AGC7704 e AGC7705 e AGC7706 e AGC7707 e AGC7708 e AGC7709 e AGC7710 e AGC7711 e AGC7712 e AGC7713 e AGC7714 e AGC7715 e EFL7616 e MVC7304 e MVC7603","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7721":{"codigo":"AGC7721","nome":"Plantas de Lavoura","ementa":"Cereais e leguminosas. Importância sócio-econômica. Origem. Usos. Taxonomia, Morfologia e estádios de desenvolvimento. Clima e zoneamento agroclimático. Ecofisiologia. Nutrição mineral e adubação. Manejo da área. Cultivares. Estabelecimento da cultura. Manejo da cultura. Doenças, Pragas, Plantas daninhas e controle. Colheita.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"AGC7124","prerequisito":"AGC7708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7722":{"codigo":"AGC7722","nome":"Tecnologia de Produtos Agropecuários","ementa":"Tecnologia de transformação e conservação de produtos agropecuários de uso alimentar com ênfase para carnes e lacticínios. Classificação, terminologia, composição, microbiologia, bioquímica e fermentações. Padronização. Beneficiamento, equipamentos, processos industriais, subprodutos, higiene, controle de qualidade, conservação e armazenamento.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7129","prerequisito":"CRC7213 e CRC7411","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EFL7613":{"codigo":"EFL7613","nome":"Avaliação e Perícia","ementa":"Perícia e avaliação agroflorestal. O papel do Perito. Impactos ambientais por atividades agrícolas e florestais. Avaliação de bens rurais. Avaliação da cobertura florística natural. Elaboração de laudo pericial. Códigos: Florestas; Fauna; Pesca e Água. Leis, Decretos e Portarias que envolvem direta ou indiretamente o uso de recursos naturais. Técnicas de geoprocessamento e cartografia digital aplicados aos trabalhos de perícias e avaliações agrícolas e florestais. Responsabilidade social e ambiental.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"CBV7318","prerequisito":"AGC7704 e CRC7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MVC7605":{"codigo":"MVC7605","nome":"Suinocultura e Avinocultura","ementa":"Características básicas da indústria suína. Problemas específicos relacionados com reprodução. Criação de leitões, Crescimento e Terminação. Particularidade de manejo nas várias fases de produção. Planejamento de criação. Raças: exterior e julgamento. Profilaxia das principais doenças. Método de avaliação de suínos. Visitas a empresas suinícolas. A avicultura como produtora de alimentos de alto valor biológico para o consumo humano. Situação e perspectivas da avicultura de corte e postura no Brasil e no mundo. O frango de corte moderno, sua formação, características das linhagens,  sistemas de produção, desempenho, manejo e características das suas carcaças. As poedeiras comerciais modernas em seus aspectos de formação, evolução genética, produção, desempenho e características das granjas e seu manejo. Produção de pintos comerciais.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"CBV7806","prerequisito":"CRC7413","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7723":{"codigo":"AGC7723","nome":"Estágio Obrigatório Supervisionado","ementa":"","carga_horaria":198,"fase_sugestao":10,"equivalencia":"AGC7134","prerequisito":"AGC7715","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7724":{"codigo":"AGC7724","nome":"Trabalho de Conclusão de Curso - TCC","ementa":"","carga_horaria":36,"fase_sugestao":10,"equivalencia":"AGC7135","prerequisito":"AGC7715","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"AGC7001":{"codigo":"AGC7001","nome":"Sistema Integrado de Produção Agropecuária","ementa":"Caracterização dos sistemas agropastoris, agroflorestais, agrosilvipastoris e lavoura\/pecuária. Critérios para a implantação dos sistemas integrados em áreas agrícolas, pecuárias e florestais. Princípios da interação solo x planta x animal. Fundamentos da ciclagem de nutrientes. Espécies vegetais para múltiplo uso. Integração e regeneração de sistemas. Sistemas consorciados. Planejamento da rotação e sucessão de culturas. Sustentabilidade ambiental e gestão de sistemas integrados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"AGC7120 e AGC7123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7002":{"codigo":"AGC7002","nome":"Fruticultura II","ementa":"Abordagens teórico-práticas sobre aspectos gerais e específicos de culturas frutíferas de importância econômica para o Estado de Santa Catarina e Sul do Brasil, com ênfase ao Goiaba serrana, kiwizeiro, caquizeiro, abacateiro, maracujazeiro, abacaxizeiro, pequenos frutos (morango, framboesa, mirtilo, amora) e mirtáceas nativas. Abordagens de produção integrada de frutas e fruticultura de base agroecológica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7010":{"codigo":"AGC7010","nome":"Matologia II","ementa":"Identificação e ecologia das plantas daninhas. Mecanismo de ação dos herbicidas. Resistência de plantas daninhas aos herbicidas. Fitorremediação de solos contaminados com herbicidas. Manejo Integrado de Plantas Daninhas. Sistemas de manejo de plantas daninhas em culturas geneticamente modificadas. Tecnologia de aplicação de herbicidas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7113":{"codigo":"AGC7113","nome":"Matologia I","ementa":"Biologia das plantas daninhas. Classificação e identificação de plantas daninhas. Banco de sementes e dormência.  Interferência de plantas daninhas. Alelopatia. Métodos de manejo e controle. Controle químico. Absorção, translocação e metabolismo de herbicidas. Resistência de plantas daninhas à herbicidas. Comportamento de herbicidas no ambiente. Recomendações técnicas para manejo de plantas daninhas em áreas agrícolas e não agrícolas. Aulas de campo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7725":{"codigo":"AGC7725","nome":"Apicultura","ementa":"Biologia e evolução das abelhas. Interação abelhas e o ambiente. Formação e manejo  de apiários para produção e extração de produtos apícolas. A polinização de culturas  de interesse. Instalações, equipamentos, e indumentárias usadas na apicultura. Cuidados, higiene e profilaxia apícola. Planejamento do agronegócio apícola. Comercialização de produtos apícolas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7415","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7726":{"codigo":"AGC7726","nome":"Patologia das Sementes","ementa":"Histórico, definições básicas e importância da Patologia de Sementes. Patógenos associados a sementes de culturas de importância. Pontos de entrada e localização de Patógenos em sementes. Transmissão e Epidemiologia. Testes de sanidade. Métodos de controle. Fungos de armazenamento. Situação atual e perspectivas da Patologia de Sementes. Equipamentos e Instalações. Métodos em Patologia de Sementes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7517","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7727":{"codigo":"AGC7727","nome":"Plantas de Lavoura II","ementa":"Importância sócio-econômica. Origem. Usos. Taxonomia, Morfologia e estádios de desenvolvimento. Clima e zoneamento agroclimático. Ecofisiologia. Nutrição mineral e adubação. Manejo da área. Cultivares. Estabelecimento da cultura. Manejo da cultura. Doenças, Pragas, Plantas daninhas e controle. Colheita do Trigo, aveia branca, cevada, centeio, triticale, mandioca, café, linhaça, Colza (canola), tremoço, linho e lentilha.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"AGC7708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7728":{"codigo":"AGC7728","nome":"Fruticultura II","ementa":"Abordagens teórico-práticas sobre aspectos gerais e específicos de culturas frutíferas de importância econômica para o Estado de Santa Catarina e Sul do Brasil, com ênfase ao Goiaba serrana, kiwizeiro, caquizeiro, abacateiro, maracujazeiro, abacaxizeiro, pequenos frutos (morango, framboesa, mirtilo, amora) e mirtáceas nativas. Abordagens de produção integrada de frutas e fruticultura de base agroecológica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"AGC7703","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7729":{"codigo":"AGC7729","nome":"Plantas Medicinais, Condimentares e Aromáticas","ementa":"Origem, histórico, produção in vivo e in vitro de espécies medicinais, aromáticas e condimentares. Importância econômica, social e aspectos de mercado, quimiotaxonomia, classes de metabólitos secundários, vias biossintéticas e ensaios de atividade biológica. Sistemas de cultivo e desenvolvimento de produtos a partir de espécies medicinais, aromáticas e condimentares.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7730":{"codigo":"AGC7730","nome":"Cultivo Protegido","ementa":"Conceitos e Introdução. Materiais, equipamentos e estruturas. Manejo dos materiais, equipamentos e estruturas. Manejo do ambiente de cultivo. Cultivo e manejo  em ambiente protegido. Manejo da Fertirrigação. Cultivo hidropônico.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7515","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7731":{"codigo":"AGC7731","nome":"Gestão de Recursos Hídricos","ementa":"Introdução; Sistemas de gestão de recursos hídricos no mundo; O Sistema Nacional de Recursos Hídricos; Comitês de Bacias Hidrográficas, constituição e composição; A importância da gestão de forma descentralizada, participativa, e integrada em relação aos demais recursos naturais, sem dissociação dos aspectos quantitativos e qualitativos e das peculiaridades das bacias hidrográficas; Aspectos técnicos discutidos nas diferentes câmaras; Cobrança pelo uso água; Gestão dos recursos obtidos; Agência de Bacias Hidrográficas; Principais Comitês de Bacias Hidrográficas no Brasil; Potencial de prestação de serviços pelos diferentes profissionais das áreas de ciências agrárias, florestais, ambientais e biológicas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CRC7323","prerequisito":"CRC7317 e CRC7417","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7732":{"codigo":"AGC7732","nome":"Geoprocessamento","ementa":"Conceitos sobre sistemas de informações geográficas, cartografia digital e tecnologias de sensoriamento remoto aplicados no contexto da engenharia florestal. Princípios físicos. Técnicas de extração de informações por análise visual e processamento digital. Principais sensores em órbita e suas características e aplicabilidade na engenharia florestal. Extração de atributos das imagens digitais para geração de produtos. Operação e análise de dados e informações. Geração de dados temáticos. Operações de análises geográficas. Saída de dados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7513","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7733":{"codigo":"AGC7733","nome":"Tópicos Especiais em Agronomia I","ementa":"Desenvolvimento de atividades de interesse do curso, em áreas relevantes da Agronomia.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7734":{"codigo":"AGC7734","nome":"Tópicos Especiais em Agronomia II","ementa":"Desenvolvimento de atividades de interesse do curso, em áreas relevantes da Agronomia.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7735":{"codigo":"AGC7735","nome":"Programa de Intercâmbio I","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7736":{"codigo":"AGC7736","nome":"Programa de Intercâmbio II","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7737":{"codigo":"AGC7737","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7741":{"codigo":"AGC7741","nome":"Atividades Técnico-Científicas ou Culturais I","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7742":{"codigo":"AGC7742","nome":"Atividades Técnico-Científicas ou Culturais II","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7743":{"codigo":"AGC7743","nome":"Atividades Técnico-Científicas ou Culturais III","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"AGC7744":{"codigo":"AGC7744","nome":"Atividades Técnico-Científicas ou Culturais IV","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7000":{"codigo":"CRC7000","nome":"Agricultura Familiar","ementa":"Definição de agricultura familiar. História do campesinato no Brasil. Auto consumo e segurança alimentar. Agricultura familiar e Políticas Públicas. Movimentos campesinos. Agricultura familiar e mercado. Multifuncionalidade. Agricultura Familiar e sustentabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CNS7000 ou CRC7224","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7001":{"codigo":"CRC7001","nome":"Ecologia Florestal","ementa":"Conceitos básicos. A importância das Florestas. Formações florestais do Brasil. O ecossistema florestal - Estrutura vertical e horizontal da floresta. Fitossociologia. Sucessão florestal. Conservação dos recursos naturais. Bases para o manejo racional de florestas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CRC7222","prerequisito":"CRC7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7002":{"codigo":"CRC7002","nome":"Manejo Reprodutivo em Ovinos e Bovinos","ementa":"Curso teórico pratico que visa a avaliação dos índices reprodutivos, Nutrição e reprodução, fisiologia da reprodução em ovino e bovinos, síndrome anestro estacional e estação de monta. Programas de inseminação artificial, super-ovulação e transferência de embriões em ovino e bovinos. Manejo reprodutivo em gado de corte, manejo reprodutivo de ovinos. O ensino prático da disciplina constará de visitas a estabelecimentos agropecuários para avaliação do manejo reprodutivo.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7003":{"codigo":"CRC7003","nome":"Tópicos Especiais em Ciências Rurais I","ementa":"Crescimento e desenvolvimento vegetal e sua relação com a produtividade. Elementos meteorológicos que afetam o desenvolvimento das plantas. Descrição e análise de escalas de desenvolvimento ou escalas fenológicas e da taxa de desenvolvimento de plantas agrícolas e florestais. Relação da fenologia de cada espécie aos principais fatores ecológicos que governam a taxa de desenvolvimento.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7004":{"codigo":"CRC7004","nome":"Tópicos Especiais em Ciências Rurais II","ementa":"Ementa variável que pode compreender tópicos específicos de Ciências Rurais, Agronomia e Engenharia Florestal.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7005":{"codigo":"CRC7005","nome":"Práticas Laboratoriais de Bioquímica","ementa":"Caracterização de aminoácidos, proteínas, enzimas, carboidratos, lipídeos, ácidos  nucléicos e vitaminas em material biológico.","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7213","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7006":{"codigo":"CRC7006","nome":"Introdução à Eletricidade e à Física Nuclear","ementa":"Modelo atômico. Desintegração Nuclear. Radiação: conceitos, aplicações, efeitos, proteção. Eletrostática: carga elétrica, campo elétrico, potencial elétrico e circuitos elétricos simples.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CRC7211","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7007":{"codigo":"CRC7007","nome":"Cultivo in vitro de plantas","ementa":"Conteúdos práticos de cultivo in vitro visando a micropropagação de plantas: Equipamentos básicos, \norganização e biossegurança laboratorial; Elaboração de soluções estoque; Composição de meios de cultura, Técnicas de extração e inoculação dos diferentes tipos de explantes; Indução por diferentes rotas da morfogêsese in vitro; Biologia celular: Indução, manipulação e avaliações citoquímicas e de crescimento de linhagens celulares; Obtenção de sementes sintéticas e de unidades encapsuláveis; Biorreatores de Imersão temporária e Conservação in vitro.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7008":{"codigo":"CRC7008","nome":"Gestão de Impactos Ambientais","ementa":"Conceituação de impactos ambientais. Estrutura do EIA\/RIMA. Caracterização dos impactos ambientais nos meios físico, biótico e sócio-econômico. Valoração e qualificação dos impactos. Medidas mitigadoras e compensatórias. Elaboração e análise dos EIA\/RIMA e RAP. Política e legislação dos EIA\/RIMA e RAP. Audiências Públicas. Estudos de casos de EIA\/RIMA e RAP.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CNS8008 ou CRC7421","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7009":{"codigo":"CRC7009","nome":"Biologia do Parasitismo","ementa":"Relações simbióticas. Evolução do parasitismo. Estudo das relações históricas entre parasito e hospedeiro. Métodos de estudo da evolução e relações históricas entre parasito-hospedeiro. Ciclos biológicos dos parasitos. Ecologia do parasitismo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7400":{"codigo":"CRC7400","nome":"Formação Empreendedorial","ementa":"O planejamento de um projeto de negócios. Gestão de projetos: técnicas eficazes; Métodos e medidas dos trabalhos; Implantação e implementação de projetos de negócios. Administração de custos e dos prazos de implantação em projetos; Gestão da qualidade em projetos. Identificação de oportunidades de investimentos. Analise de mercado. Desenvolvimento e implementação de negócios. Teoria da localização e escala do empreendimento. Finanças de um projeto de Investimentos. Análise de sensibilidade. Empreendedorismo e inovação: liderança estratégica.","carga_horaria":51,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9211":{"codigo":"LLE9211","nome":"Língua Espanhola I","ementa":"Introdução aos estudos da língua espanhola. Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender e produzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9212":{"codigo":"LLE9212","nome":"Língua Espanhola II","ementa":"Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender, produzir e traduzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"CRC7107":{"codigo":"CRC7107","nome":"Disciplina Relacional","ementa":"","carga_horaria":17,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7203":{"codigo":"CRC7203","nome":"Qualidade da Água**","ementa":"Características químicas e físicas das águas naturais e residuárias. Técnicas de amostragem e métodos de exames físico-químicos das águas naturais e residuárias. Características biológicas das águas naturais e residuárias. Práticas de laboratório.","carga_horaria":51,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7206":{"codigo":"CRC7206","nome":"Disciplina Relacional","ementa":"","carga_horaria":17,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7210":{"codigo":"CRC7210","nome":"Atividade complementar","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7221":{"codigo":"CRC7221","nome":"Ecologia de populações","ementa":"Interações envolvendo Ecologia, Genética, Evolução e Agricultura. Estrutura de população. Sistemas reprodutivos. Mutação, deriva genética e fluxo gênico. Seleção natural e adaptação. Ecologia Molecular e Filogenética. Hibridologia. Biogeografia. Demografia: estrutura e dinâmica populacionais. Competição, predação e parasitismo. Domesticação de plantas e animais. Origens da agricultura","carga_horaria":51,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7306":{"codigo":"CRC7306","nome":"Disciplina Relacional","ementa":"Construção de contextos nos quais especificidades do conhecimento adquirem significados complementares.","carga_horaria":17,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7310":{"codigo":"CRC7310","nome":"Atividade Complementar","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7321":{"codigo":"CRC7321","nome":"Projetos de Educação Ambiental","ementa":"Análise de Projetos de Educação Ambiental; Identificação de todas etapas para elaboração de um projeto; Elaboração de um projeto de educação ambiental; Leitura de textos, conferências e debates sobre diferentes propostas de educação ambiental; Pesquisa-intervenção e educação ambiental; Proposição de um programa de educação ambiental para uma instituição.","carga_horaria":34,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7322":{"codigo":"CRC7322","nome":"Tecnologia da Madeira","ementa":"Importância do reflorestamento. Propriedades anatômicas, físicas, químicas e mecânicas da madeira. Preservação. Secagem. Madeira transformada.","carga_horaria":34,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7323":{"codigo":"CRC7323","nome":"Gestão dos Recursos Hídricos na Bacia Hidrográfica","ementa":"Introdução; Sistemas de gestão de recursos hídricos no mundo; O Sistema Nacional de Recursos Hídricos; Comitês de Bacias Hidrográficas, constituição e composição; A importância da gestão de forma descentralizada, participativa, e integrada em relação aos demais recursos naturais, sem dissociação dos aspectos quantitativos e qualitativos e das peculiaridades das bacias hidrográficas; Aspectos técnicos discutidos nas diferentes câmaras; Cobrança pelo uso água; Gestão dos recursos obtidos; Agência de Bacias Hidrográficas; Principais Comitês de Bacias Hidrográficas no Brasil; Potencial de prestação de serviços pelos diferentes profissionais das áreas de ciências agrárias, florestais, ambientais e biológicas.","carga_horaria":34,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7406":{"codigo":"CRC7406","nome":"Disciplina Relacional","ementa":"Construção de contextos nos quais especificidades do conhecimento adquirem significados complementares.","carga_horaria":17,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7410":{"codigo":"CRC7410","nome":"Atividade Complementar","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CRC7510":{"codigo":"CRC7510","nome":"Atividade Complementar","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20141":{"id":"414","codigo":20141,"codigo_curso":555,"carga_horaria_ufsc":4410,"carga_horaria_mec":3630,"aulas_semana_min":15,"aulas_semana_esperado":25,"aulas_semana_max":32,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20141","ucs":{"ABF7102":{"codigo":"ABF7102","nome":"Zoologia Geral","ementa":"Conceito e divisão da Zoologia; Sistemática zoológica: Classificação Lineana, Fenética e sistemática filogenética; Características gerais dos protozoários e importância evolutiva e agropecuária; Características gerais dos invertebrados (morfologia, anatomia e reprodução), importância evolutiva e agropecuária de platelmintos, blastocelomados (nematóides, rotíferas e acantocéfalos), moluscos, artrópodes; Características gerais dos vertebrados (morfologia, anatomia e reprodução); características gerais, importância evolutiva e pecuária dos peixes, anfíbios, répteis, aves e mamíferos. Domesticação de vertebrados. Diversidade de vertebrados silvestres.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"CBV7102 ou CRC7106 ou CRC7116","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7103":{"codigo":"ABF7103","nome":"Ecologia Geral","ementa":"Conceitos fundamentais em Ecologia. Níveis hierárquicos de organização. Biomas. Conceito de ecossistema, principais componentes e dinâmica. Fatores Bióticos e Abióticos. Ciclos biogeoquímicos. Ecologia trófica, cadeias e teias alimentares. Fluxo de energia e Ciclagem de materiais. Fatores ecológicos. Dinâmica de populações. Estrutura de comunidades. Sucessão ecológica. Diversidade das comunidades biológicas. Evolução e dinâmica. Biodiversidade e Usos de Recursos Naturais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CBV7103 ou CRC7101 ou CRC7111","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7101":{"codigo":"CBA7101","nome":"Biologia Celular","ementa":"Níveis de organização das estruturas biológicas. Diversidade celular. Organização da célula procariota e eucariota animal e vegetal. Evolução celular. A Teoria Celular: as células e as funções celulares. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Divisão celular. Processos de morte celular. Métodos de estudo em biologia celular.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"AGC7101 ou CRC7209 ou CRC7300","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7100":{"codigo":"CNS7100","nome":"Introdução  à  Agronomia","ementa":"Consciência crítica a respeito da escolha profissional e institucional, da formação acadêmica e dos compromissos na sociedade. Estrutura do curso de Agronomia. Conhecimento da vida acadêmica, da trajetória histórica da agricultura e da ciência agronômica. A agricultura brasileira e catarinense. Legislação, ética e perfil profissional.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"AGC7100 ou CRC7100 ou CRC7110","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7101":{"codigo":"CNS7101","nome":"Anatomia e Morfologia Vegetal","ementa":"Célula Vegetal. Histologia das plantas vasculares: Meristemas, tecidos de revestimento, tecidos de produção e reserva, tecidos de sustentação, tecidos de condução, estruturas secretoras. Anatomia e Morfologia externa de raiz, caule, folha, flor, fruto, semente e plântula. Embriologia de Gimnospermas e de Angiospermas. Adaptações anatômicas e morfológicas a diferentes ambientes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CBV7101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7112":{"codigo":"CNS7112","nome":"Pré-cálculo","ementa":"Álgebra. Geometria Elementar. Funções.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"CRC7103 ou CRC7113","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7114":{"codigo":"CNS7114","nome":"Química Geral e Orgânica","ementa":"Elemento químico e classificação periódica. Estequiometria. Ligações químicas. Polaridade e forças intermoleculares. Ácidos, bases, sais e óxidos. Funções, nomenclatura, propriedades físico-químicas e reatividade de alcanos, alcenos, compostos aromáticos, fenóis, éteres, aldeídos, cetonas, ácidos carboxílicos e seus derivados. Noções básicas sobre compostos de interesse biológico, agroquímicos e poluentes ambientais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"CRC7104 ou CRC7114","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7200":{"codigo":"CNS7200","nome":"Ética e Filosofia da Ciência","ementa":"Ética e Filosofia definições conceituais. Relação individuo, sociedade e cultura: Processo de desenvolvimento e constituição do ser humano e sociedade (cultura, linguagem, humanização). Filosofia da ciência: construção do conhecimento cientifico; diversidade de saberes, correlações entre ciência e sociedade. Ética e Ciência. Os múltiplos usos da Ética: na profissão, nas organizações e na sociedade. O interrelacionamento entre Filosofia e Ética.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"CRC7200","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7104":{"codigo":"ABF7104","nome":"Bioquímica","ementa":"Introdução à Bioquímica; Química e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos, enzimas, coenzimas, vitaminas, nucleotídeos e ácidos nucléicos; Bioenergética; Metabolismo de carboidratos, lipídeos e aminoácidos; Integração e regulação do metabolismo.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CBV7104 ou CRC7213 ou CRC7301","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7105":{"codigo":"CNS7105","nome":"Sistemática Vegetal","ementa":"Introdução à Botânica. Conceitos e métodos taxonômicos. Sistemas de classificação. Nomenclatura botânica. Noções de plantas avasculares. Sistemática de plantas vasculares. Principais táxons de interesse agronômico e florestal.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CBV7105 ou CRC7212 ou CRC7404","prerequisito":"CBV7101 ou CNS7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7113":{"codigo":"CNS7113","nome":"Cálculo Diferencial e Integral","ementa":"Revisão de Funções. Limites. Continuidade. Derivadas. Estudo de funções. Aplicações das derivadas. Integral Definida. Integral Indefinida. Cálculo de Área e Volume.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CRC7103 ou CRC7113","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7211":{"codigo":"CNS7211","nome":"Física","ementa":"Vetores. Deslocamento. Velocidade. Condições gerais de equilíbrio. Trabalho. Energia. Conservação de Energia. Termodinâmica. Fluidos. Gases. Eletrostática. Fenômenos ondulatórios. Óptica Geométrica. Óptica Física. Introdução à Física Nuclear e a Física Atômica.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CRC7201 ou CRC7211","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7214":{"codigo":"CNS7214","nome":"Química Analítica","ementa":"Introdução à análise química quantitativa e qualitativa. Erro e tratamento de dados analíticos. Estudo do pH. Precipitação e solubilidade. Métodos titulométricos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CRC7204 ou CRC7214","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7215":{"codigo":"CNS7215","nome":"Sociologia Rural","ementa":"Definição de Sociologia Rural e campo temático. Estrutura fundiária e políticas de reforma agrária; formação sócio-econômica rural e relação com os modelos de desenvolvimento do Brasil. Agricultura familiar e agricultura patronal no Brasil. Estratificação e desigualdade rural. Comunidades tradicionais e ancestrais (origens africanas e ameríndias); diversidade sócio cultural da população rural, história e relações étnico-raciais. Relação campo-cidade,  políticas de desenvolvimento territorial e sustentabilidade.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"CRC7205 ou CRC7215","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7216":{"codigo":"CNS7216","nome":"Geologia e Mineralogia","ementa":"Introdução à Geologia. A Terra e a litosfera. Rochas e minerais constituintes. Geologia do Brasil e da região Sul. Intemperismo físico, químico e biológico. Produtos do intemperismo: Solos e mineralogia da fração argila (caulinita, gibbsita, illita, montmorilonita, esmectitas, vermiculita, óxidos de ferro, óxidos de alumínio). Criação de cargas elétricas em solos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"CRC7216 ou CRC7305","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7101":{"codigo":"ABF7101","nome":"Meteorologia e Climatologia","ementa":"METEOROLOGIA BÁSICA: Relações terra-sol. Atmosfera. Radiação solar e terrestre. Balanço de radiação e de energia na superfície. Temperatura do ar e do solo. Pressão atmosférica e vento. Evaporação e evapotranspiração. Umidade do ar. Processos de condensação na atmosfera (nuvens, nevoeiro, orvalho e geada). Precipitação (chuva, granizo e neve). Balanço hídrico. Elementos de dinâmica da atmosfera (forças que governam os movimentos atmosféricos, circulação geral e secundária da atmosfera, massas de ar e frentes, El Niño e La Niña). Estrutura meteorológica. CLIMATOLOGIA: elementos e fatores do clima. Macro, meso e microclimas. Classificações climáticas. Climas da Terra. Climas do Brasil. Oscilações e variações climáticas.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"AGC7103 ou CRC7303 ou CRC7317","prerequisito":"CNS7211","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7105":{"codigo":"ABF7105","nome":"Propriedades Físicas e Químicas do Solo","ementa":"Introdução à Ciência do Solo; Composição do solo: Fases sólida, liquida e gasosa; Densidade de partículas e do solo; Porosidade do solo; Textura do solo; Estrutura e agregação do solo; Consistência do solo; Água no solo (dinâmica da água no solo, infiltração, avaliação, etc...); Temperatura do solo; Oxidação e redução do solo; Fenômenos de superfície; Origem das cargas negativas e positivas; complexos orgânicos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"AGC7105 ou CRC7417","prerequisito":"CNS7211 e CNS7214 e CNS7216","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7119":{"codigo":"ABF7119","nome":"Morfofisiologia Animal","ementa":"Fisiologia celular e bioeletrogênese. Morfofisiologia dos sistemas endócrino, respiratório, digestório, reprodutor masculino, reprodutor feminino, gestação, parto e puerpério. Fisiologia da lactação e dos líquidos orgânicos. Termorregulação.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"CBV7118 ou CRC7202 ou CRC7316","prerequisito":"(AGC7101 ou CBA7101) e (ABF7104 ou CBV7104)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7201":{"codigo":"ABF7201","nome":"Desenho Técnico","ementa":"Normas para o desenho técnico (ABNT). Caligrafia e traçado. Instrumentos e material de desenho. Sistemas de coordenadas. Escalas. Noções de geometria descritiva: projeções do ponto, da reta e do plano. Projeções: cilíndrica, ortogonal e oblíqua. Projeção em vistas ortográficas e perspectiva isométrica. Noções de desenho arquitetônico aplicado a edificações rurais. Desenho assistido por computador.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"CBV7201 ou CRC7102 ou CRC7312","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7104":{"codigo":"CBA7104","nome":"Fisiologia Vegetal","ementa":"Água e componentes do potencial hídrico; Relações hídricas; Absorção e transporte de nutrientes; Fotossíntese; translocação de solutos orgânicos; Hormônios vegetais; Fotomorfogênese; Controle do florescimento; Fisiologia do estresse.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"AGC7104 ou CRC7404 ou CRC7414","prerequisito":"(AGC7101 ou CBA7101) e (ABF7104 ou CBA7104)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7102":{"codigo":"CNS7102","nome":"Genética","ementa":"Material genético, estrutura, função, e expressão gênica. Mutação. Segregação meiótica e permuta. Leis básicas da genética. Interação genética. Determinação do sexo e herança ligada ao sexo. Linhagem e mapas cromossômicos. Herança citoplasmática. Evolução. Genética de Populações. Genômica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"AGC7102 ou CRC7311 ou CRC7603","prerequisito":"AGC7101 ou CBA7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7115":{"codigo":"CNS7115","nome":"Metodologia da Pesquisa","ementa":"Introdução à produção de textos acadêmicos. Metodologia da pesquisa, definição do objetivo, hipóteses, problema, contextualização teórica e elaboração de uma proposta de trabalho. Compreensão e produção de textos e análise de gêneros discursivos acadêmicos (projeto de pesquisa, monografia, artigo científico, relatórios de pesquisa).","carga_horaria":36,"fase_sugestao":3,"equivalencia":"CRC7105 ou CRC7115","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7314":{"codigo":"CNS7314","nome":"Estatística Básica","ementa":"Análise estatística na área de ciências agrárias.  Estatística descritiva: Organização, resumo e apresentação de dados estatísticos. Técnicas de amostragem. Noções de probabilidade. Inferência estatística. Tabelas de contigência. A informática na Estatística.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"CRC7304 ou CRC7314","prerequisito":"CNS7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7108":{"codigo":"ABF7108","nome":"Entomologia Agrícola","ementa":"Principais ordens e famílias de interesse agrícola, ciclo evolutivo e o desenvolvimento dos principais insetos de interesse agrícola, as características e identificação a nível de ordem e família destes insetos de interesse agrícola. Importância econômica dos insetos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"CBV7107 ou CRC7415","prerequisito":"ABF7102 ou CBV7102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7106":{"codigo":"CBA7106","nome":"Microbiologia Agrícola","ementa":"Introdução à microbiologia e grupos de bactérias, fungos, arquéias, vírus, algas e protozoários. Crescimento e metabolismo microbiano. Classificação e identificação de microrganismos. Estimativas de atividade e diversidade microbiana. Genética microbiana e biotecnologia. Técnicas de isolamento, observação e quantificação de microrganismos. Microbiologia do solo, do ar, da água e do leite.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"AGC7106 ou CRC7401 ou CRC7411","prerequisito":"(AGC7101 ou CBA7101) e (ABF7104 ou CBV7104)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBV7202":{"codigo":"CBV7202","nome":"Elementos de Geodesia","ementa":"Fundamentos da geodésia. Elipsoide, Geoide e Plano. Sistemas geodésicos de referência. Sistemas de coordenadas cartesianas e elipsoidais. Transformação de coordenadas. Orientação do sistema cartesiano. Cálculo do azimute geodésico pelo problema geodésico inverso. Conceitos de cartografia. Escalas. Formas de representação do espaço: mapas, cartas, mosaicos e ortoimagens. Mapeamento sistemático brasileiro. Estudo do sistema de projeção cartográfica Universal Transverso de Mercator (UTM). Precisão e exatidão. Ajustamento de observações geodésicas.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7202":{"codigo":"CNS7202","nome":"Elementos de Geodésia","ementa":"Fundamentos da geodésia. Elipsóide, Geóide e Plano. Sistemas geodésicos de referência. Sistemas de coordenadas cartesianas e elipsoidais. Transformação de coordenadas. Orientação do sistema cartesiano. Cálculo do azimute geodésico pelo problema geodésico inverso. Conceitos de cartografia. Escalas. Formas de representação do espaço: mapas, cartas, mosaicos e ortoimagens. Mapeamento sistemático brasileiro. Estudo do sistema de projeção cartográfica Universal Transverso de Mercator (UTM). Precisão e exatidão. Ajustamento de observações geodésicas.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CBV7202","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7315":{"codigo":"CNS7315","nome":"Gênese, Morfologia e Classificação do Solo","ementa":"Introdução à Pedologia; Fatores e processos de formação do solo; Morfologia dos solos; Classificação dos solos; Sistemas de Classificação de Solos; Solos do Brasil e de Santa Catarina.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7305 ou CRC7315","prerequisito":"ABF7105 ou AGC7105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7412":{"codigo":"CNS7412","nome":"Legislação e Gestão Ambiental","ementa":"Agronegócio e meio ambiente. Gases poluentes, efeito estufa, depleção da camada de ozônio. Código florestal brasileiro. Política nacional do meio ambiente. Lei de crimes ambientais. Política nacional de recursos hídricos. Política nacional de resíduos sólidos. Licenciamento ambiental. Código Estadual do Meio Ambiente de Santa Catarina. Sistemas de gestão ambiental.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7402 ou CRC7412","prerequisito":"(ABF7103 ou CBV7103) e (CNS7114 e CNS7214)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7416":{"codigo":"CNS7416","nome":"Estatística Experimental","ementa":"Planejamento e implantação de experimentos. Princípios básicos de experimentação. Procedimentos para comparações múltiplas. Delineamentos experimentais. Modelos de regressão Apresentação e interpretação de resultados experimentais.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7416","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7514":{"codigo":"CNS7514","nome":"Poluição Ambiental","ementa":"Energia, desenvolvimento e poluição; aspectos físicos e químicos da poluição dos ambientes aquáticos e terrestres; poluição atmosférica; quimiodinâmica dos poluentes no ambiente; variáveis de interesse na avaliação e monitoramento do ambiente; critérios e padrões de qualidade da água e do ar; introdução aos sistemas convencionais e alternativos de tratamento e controle da poluição.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7514","prerequisito":"CNS7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7613":{"codigo":"CNS7613","nome":"Fundamentos de Economia Rural","ementa":"Importância dos Setores Agropecuário e Florestal para o Desenvolvimento Econômico. Tópicos de Microeconomia: A demanda do Consumidor; A curva de Oferta; Equilíbrio de Mercado; Teoria da Produção.  Tópicos de Macroeconomia: Noções de Medidas de Atividade Econômica e os Instrumentos de Política Econômica; Inflação; Comercio Internacional. Políticas Agrícolas e Agrárias. Conjuntura da Economia Rural Brasileira.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CRC7302 ou CRC7400 ou CRC7613","prerequisito":"CNS7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7107":{"codigo":"ABF7107","nome":"Hidrologia","ementa":"Propriedades e características da água. Água como elemento da paisagem. Ciclo hidrológico e sua interação no contexto solo-água-planta-atmosfera. Dados hidrológicos básicos (precipitação, interceptação, escoamento superficial, infiltração, evaporação e transpiração). Obtenção e análise de registros hidrológicos. Medição e regularização de vazões. Noções de transporte de sedimentos. Águas subterrâneas. Bacias hidrográficas: definição, importância e caracterização. Noções básicas de manejo de Bacias hidrográficas.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"AGC7107 ou CRC7303 ou CRC7313","prerequisito":"ABF7101 ou AGC7103 ou CRC7317","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7110":{"codigo":"ABF7110","nome":"Fitopatologia Agrícola","ementa":"Histórico da Fitopatologia. Conceito de doenças de plantas. Agentes causadores de doenças em plantas. Sintomatologia e diagnose. Ciclo das relações patógenos hospedeiro. Resistência de plantas a doenças. Fisiologia do parasitismo. Epidemiologia. Controle de doenças de plantas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"AGC7110 ou CRC7517","prerequisito":"AGC7106 ou CBA7106 e CNS7114","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7309":{"codigo":"ABF7309","nome":"Silvicultura","ementa":"Introdução à silvicultura. Produção de mudas de espécies florestais. Implantação de povoamentos florestais. Condução de povoamentos florestais. Sistemas silviculturais. Silvicultura das principais espécies florestais nativas e exóticas.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CBV7309 ou CRC7501 ou CRC7511","prerequisito":"CNS7105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BSU7817":{"codigo":"BSU7817","nome":"Fundamentos de Melhoramento Animal","ementa":"Modos de ação gênica; fundamentos de herança e meio; noções de correlações genética, fenotípica e ambiental e interação genótipo ambiente; seleção e ganho genético; endogamia e cruzamento.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"CBV7817 ou MVC7304","prerequisito":"AGC7102 ou CNS7102 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7108":{"codigo":"CBA7108","nome":"Mecanização Agrícola","ementa":"Conceitos gerais de mecânica: Força, Potência, Trabalho e Torque. Motores de combustão interna. Tratores agrícolas, constituição, manutenção, operação e ensaios. Máquinas e implementos agrícolas: função, constituição e regulagens. Máquinas de colheita de grãos e forragens: regulagens e estudo de perdas de colheita. Aspectos de segurança na operação de máquinas e implementos: equilíbrio e transferência de peso. Planejamento, seleção e desempenho operacional da mecanização agrícola. Estudo econômico de conjuntos motomecanizados.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"AGC7108 ou AGC7705","prerequisito":"ABF7105 ou AGC7105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7109":{"codigo":"CBA7109","nome":"Fertilidade do Solo e Adubação","ementa":"Reação do solo e propriedades químicas do solo. Bases conceituais úteis para a Fertilidade do Solo. Acidez do solo e calagem. Ciclos biogeoquímicos de nutrientes. Dinâmica da matéria orgânica do solo. Dinâmica dos macronutrientes no solo. Dinâmica dos Micronutrientes no solo. Avaliação integrada da fertilidade do solo. Interpretação de análises de solo e recomendação de adubos e corretivos para espécies de interesse agrícola. Uso eficiente de adubos e corretivos. Fontes e classificação dos adubos para espécies agrícolas. Determinação da necessidade de adubação química e orgânica. Adubação de sistemas. Aulas de Campo","carga_horaria":72,"fase_sugestao":5,"equivalencia":"AGC7109 ou CRC7516","prerequisito":"CNS7315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7111":{"codigo":"CBA7111","nome":"Melhoramento Genético de Plantas","ementa":"Origem e Evolução de Plantas Cultivadas. Conservação de germoplasma. Sistemas de Reprodução de Plantas Cultivadas. Estrutura Genética de Populações. Bases Genéticas dos Caracteres Qualitativos e Quantitativos. Base Genética e Métodos de Melhoramento Plantas Autógamas e Alógamas. Interação Genótipo e Ambiente. Genética da resistência a pragas e doenças.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"AGC7111 ou AGC7706","prerequisito":"AGC7102 ou CNS7102 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7410":{"codigo":"CNS7410","nome":"Desenvolvimento Rural","ementa":"Crise paradigmática e emergência da dimensão ambiental; Conceito sistêmico de meio ambiente e transformações no mundo rural; crescimento e desenvolvimento econômico; modelos de desenvolvimento rural e agrícola; Do ecodesenvolvimento ao desenvolvimento territorial sustentável; Desenvolvimento, multifuncionalidade e pluriatividade; Territorialidade e políticas públicas; planejamento territorial, regional e municipal; organização, poder local, participação política e ética ambiental.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"CNS7409 ou CRC7224 ou CRC7409","prerequisito":"CNS7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7114":{"codigo":"ABF7114","nome":"Agrometeorologia","ementa":"Crescimento e desenvolvimento vegetal; Fatores ecológicos que afetam o crescimento e desenvolvimento dos vegetais e a produtividade das culturas agrícolas: Radiação solar, balanço de radiação e de energia em comunidades vegetais, utilização da radiação pelas culturas. Fotoperiodismo e suas aplicações; Temperatura do ar e comportamento vegetal, termoperiodismo e vernalização; competição em comunidades vegetais; Água no sistema planta-atmosfera e seu efeito na produção agrícola; Zoneamentos agrícolas e ecológicos; Aplicações da Agrometeorologia a ambientes protegidos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7114","prerequisito":"(ABF7103 ou AGC7106) e (AGC7104 ou CBA7104) e (ABF7101 ou CBV7103)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7117":{"codigo":"ABF7117","nome":"Hidráulica","ementa":"Propriedades físicas dos fluidos; Princípios da hidrostática e da hidrodinâmica; Condutos forçados; Perda de carga; Instalações de recalque; Bombas e adutoras; Condutos Livres. Hidrometria.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7117 ou AGC7702","prerequisito":"ABF7107 ou AGC7107 e CNS7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7118":{"codigo":"ABF7118","nome":"Conservação e Uso da Biodiversidade","ementa":"Qualificação, funções, valoração e perda da biodiversidade. Mudanças climáticas e biodiversidade. Biodiversidade, agricultura e sustentabilidade. Uso, conservação e manejo de Recursos Genéticos. Coleta e caracterização de RGs. Agrobiodiversidade e conhecimento tradicional. A convenção sobre a diversidade biológica (CDB) e outros acordos\/convenções e seus impactos sobre os recursos genéticos (RGs). Abordagens baseadas na legislação sobre a conservação e uso dos RGs. Aulas de campo.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7118 ou CRC7512","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BSU7115":{"codigo":"BSU7115","nome":"Nutrição Animal","ementa":"Importância da Nutrição Animal. Princípios fisiológicos ligados aos processos de digestão e absorção. Metabolismo dos nutrientes na nutrição de animais ruminantes e não ruminantes.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7115 ou AGC7713","prerequisito":"(ABF7104 ou CBV7104) e (ABF7119 ou CBV7118)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7113":{"codigo":"CBA7113","nome":"Matologia I","ementa":"Biologia das plantas daninhas. Classificação e identificação de plantas daninhas. Banco de sementes e dormência.  Interferência de plantas daninhas. Alelopatia. Métodos de manejo e controle. Controle químico. Absorção, translocação e metabolismo de herbicidas. Resistência de plantas daninhas à herbicidas. Comportamento de herbicidas no ambiente. Recomendações técnicas para manejo de plantas daninhas em áreas agrícolas e não agrícolas. Aulas de campo.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7113","prerequisito":"AGC7104 ou CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7116":{"codigo":"CBA7116","nome":"Horticultura","ementa":"Fundamentos da Ciência da Horticultura. Métodos de Propagação de plantas hortícolas, sementeiras, viveiros de produção e conservação de plantas matrizes, básicas e certificadas. Dormência. Floração e Frutificação. Poda e sistemas de condução. Cultivo em ambiente protegido.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7116 ou AGC7703","prerequisito":"AGC7104 ou CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBV7203":{"codigo":"CBV7203","nome":"Topografia","ementa":"Limite e divisão da topografia. Planimetria. Altimetria. Instrumentação topográfica. Posicionamento por satélites artificiais. Georreferenciamento de imóveis rurais. Cadastro ambiental rural. Perícias. Elaboração de peças técnicas em topografia: relatórios, monografias de marcos e registro de imóveis. Desenho topográfico.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"CBV7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7111":{"codigo":"CNS7111","nome":"Biotecnologia Vegetal","ementa":"Histórico, importância e uso da biotecnologia. Totipotência celular e aspectos comparativos em plantas e animais. Cultura de células, tecidos e órgãos. Linhagens e fusões celulares e hibridomas. Manipulação de embriões e Sementes sintéticas. Biorreatores. Criopreservação. Produção de metabólitos secundários \"in vitro\". Dogma central da biologia molecular. Genômica, transcriptômica, proteômica e metabolômica. Marcadores Moleculares: tipos, base genética e aplicações. Tecnologias do ADN recombinante. Conceito, produtos e implicações dos Organismos Geneticamente Modificados. Bioética, Biossegurança e Meio Ambiente.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"AGC7112 ou CRC7611","prerequisito":"AGC7111 ou CBA7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7203":{"codigo":"CNS7203","nome":"Topografia","ementa":"Limite e divisão da topografia. Planimetria. Altimetria. Instrumentação topográfica. Posicionamento por satélites artificiais. Georreferenciamento de imóveis rurais. Cadastro ambiental rural. Perícias. Elaboração de peças técnicas em topografia: relatórios, monografias de marcos e registro de imóveis. Desenho topográfico.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"CBV7203","prerequisito":"CBV7202 ou CNS7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7121":{"codigo":"ABF7121","nome":"Manejo Integrado de Pragas e Doenças Agrícolas","ementa":"Introdução ao Manejo Integrado de Pragas e Doenças. Conceitos em Manejo Integrado de Pragas e Doenças. Sistemas de previsão. Métodos e estratégias de controle de populações de pragas. Características dos principais fungicidas e inseticidas. Tecnologia de aplicação de defensivos agrícolas. Toxicologia humana e do ambiente. Manejo integrado de pragas e doenças das principais culturas.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7121 ou AGC7712","prerequisito":"(ABF7110 ou AGC7110) e (ABF7108 ou CBV7107)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7204":{"codigo":"ABF7204","nome":"Construções Rurais","ementa":"Noções sobre a resistência dos materiais, estudo dos materiais, dos elementos estruturais e partes complementares de uma edificação; montagem de projetos de edificações.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"CBV7204 ou CRC7612","prerequisito":"(ABF7201 ou CBV7201) e (CBV7203 ou CNS7203)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7205":{"codigo":"ABF7205","nome":"Geoprocessamento","ementa":"Fundamentos de sensoriamento remoto. Princípios físicos do sensoriamento remoto. Processamento digital de imagens. Aerofotogrametria e fotointerpretação. Conceito de sistema de informações geográficas. Modelo de dados matriz e vetor. Modelagem de dados geográficos. Banco de dados geográficos. Produção de mapas. Programas aplicados ao geoprocessamento. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"CBV7205","prerequisito":"CBV7203 ou CNS7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7119":{"codigo":"CBA7119","nome":"Tecnologia e Produção de Sementes","ementa":"Importância da semente e panorama atual da produção de semente no Brasil. Estrutura e composição química das sementes. Formação e maturação da semente. Germinação e dormência. Vigor e deterioração de sementes.  Legislação para a produção e comércio de sementes. Estabelecimento e condução de campo de produção de sementes. Sistemas de certificação e fiscalização de sementes. Colheita e secagem de sementes. Beneficiamento e armazenamento de sementes. Tratamento de sementes. Análises de sementes. Aulas de campo.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"AGC7119 ou AGC7708","prerequisito":"(AGC7104 ou CBA7104) e (AGC7111 ou CBA7111)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7120":{"codigo":"CBA7120","nome":"Manejo e Conservação do Solo e da  Água","ementa":"Introdução ao planejamento do uso das terras e ao planejamento conservacionista. Princípios e conceitos de degradação do solo. Erosão do solo e seu controle. Mecanismos e fatores que afetam a erosão hídrica. Práticas de controle da erosão hídrica do solo. Predição da erosão hídrica do solo. Princípios e conceitos de manejo e conservação do solo e da água. Histórico do manejo e da conservação do solo e da água em Santa Catarina e no Brasil. Sustentabilidade e uso sustentável em agricultura. Manejo do solo em diferentes sistemas de preparo. Plantas de cobertura, rotação e consorciação de culturas. Legislação em conservação do solo e da água. Sistemas de Uso e de culturas do solo (ILP, ILPF). Qualidade do solo. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"AGC7120 ou AGC7704","prerequisito":"AGC7109 ou CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7122":{"codigo":"CBA7122","nome":"Fruticultura I","ementa":"Importância socioeconômica e organização da atividade frutícola. Caracterização dos sistemas de produção. Origem, botânica, cultivares, exigências climáticas, instalação, manejo e tratos culturais, colheita e comercialização de fruteiras de clima temperado, subtropical e tropical, dando-se ênfase à videira, bananeira, citricultura, frutas de caroço, macieira e pereira.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"AGC7122 ou AGC7710","prerequisito":"AGC7116 ou CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7123":{"codigo":"CBA7123","nome":"Forragicultura","ementa":"Morfologia e taxonomia das plantas forrageiras. Características agronômicas das principais espécies forrageiras. Pastagens nativas e cultivadas. Fisiologia de plantas forrageiras. Implantação de pastagens. Manejo do campo nativo. Manejo de pastagens. Avaliação e quantificação de forragem. Conservação de forragens. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"AGC7123 ou AGC7701","prerequisito":"(AGC7115 ou BSU7115) e (AGC7104 ou CBA7104 ou CRC7404 ou CRC7414)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7133":{"codigo":"CNS7133","nome":"Planejamento de TCC","ementa":"Planejamento, organização e elaboração de  projetos de pesquisa, extensão e estágio; definição de metas e objetivos; revisão da produção científica; técnicas de elaboração de monografia e apresentação pública. Noções sobre SIARE\/DIP\/PROGRAD e Repositório Institucional.","carga_horaria":18,"fase_sugestao":7,"equivalencia":"AGC7133 ou AGC7715","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7125":{"codigo":"ABF7125","nome":"Olericultura","ementa":"Importância econômica, alimentar e social, origem, botânica e fisiologia, cultivares, exigências climáticas, propagação, nutrição, tratos culturais das principais espécies olerícolas.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7125 ou AGC7714","prerequisito":"AGC7116 ou CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7126":{"codigo":"ABF7126","nome":"Irrigação e Drenagem","ementa":"A água no sistema solo-planta-atmosfera; Manejo da irrigação; Métodos de irrigação pressurizada; Métodos de irrigação por superfície; Drenagem agrícola.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7126 ou AGC7711","prerequisito":"(ABF7114 ou AGC7114) e (ABF7117 ou AGC7117)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7128":{"codigo":"ABF7128","nome":"Agroecologia","ementa":"Agricultura de base agroecológica: conceitos, princípios, processos e histórico. Princípios ecológicos na agricultura: dinâmica de nutrientes, da água e da energia, biodiversidade e trofobiose. Base ecológica do manejo de pragas, doenças e espécies ruderais. Tecnologias agroecológicas. Correntes da agricultura de base agroecológica: orgânica, biodinâmica, natural, permacultura. Conhecimento tradicional\/local e conservação da agrobiodiversidade. Legislação associada à produção de base agroecológica.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7128 ou CRC7220 ou CRC7509","prerequisito":"(ABF7118 ou AGC7118) e (CNS7409 ou CNS7410)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BSU7818":{"codigo":"BSU7818","nome":"Bovinocultura de Corte e Leite","ementa":"Contextualização da cadeia produtiva de bovinos de corte e de leite. Raças, cruzamentos e morfologia de bovinos de corte e de leite. Sistemas de produção intensiva e extensiva de bovinos de corte e de leite. Manejo reprodutivo, alimentar e sanitário do rebanho de bovinos de corte nas fases de cria, recria e terminação. Manejo reprodutivo, alimentar e sanitário de vacas em lactação e fêmeas leiteiras nas fases de cria e recria. Estudo da lactação e manejo da ordenha. Qualidade do leite. Gestão da produção de bovinos de corte e de leite. Bem-estar animal. Aulas de campo.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"CBV7801 ou CBV7818 ou MVC7603","prerequisito":"(AGC7123 ou CBA7123) e (AGC7115 ou BSU7115)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7124":{"codigo":"CBA7124","nome":"Plantas de Lavoura I","ementa":"Trigo, Cevada, Arroz, Soja, Feijão e Milho; Importância socioeconômica; Origem; Usos; Taxonomia, Morfologia e estádios de desenvolvimento; Clima e zoneamento agroclimático; Ecofisiologia; Nutrição mineral e adubação; Manejo da área; Cultivares; Estabelecimento e manejo da cultura; Doenças, Pragas, Plantas daninhas e controle; Colheita; Aulas de campo.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"AGC7124 ou AGC7721","prerequisito":"(ABF7101 ou AGC7103) e (AGC7104 ou CBA7104) e (AGC7109 ou CBA7109)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7127":{"codigo":"CBA7127","nome":"Fisiologia e Manejo Pós Colheita","ementa":"Abordagens bioquímicas e fisiológicas dos principais eventos que ocorrem durante o amadurecimento e senescência de órgãos vegetais. Padrões de amadurecimento e atributos de qualidade. Fatores que afetam a qualidade de frutos e que contribuem para a ocorrência de perdas durante o manuseio pós-colheita. Sistemas de armazenamento e técnicas complementares disponíveis para a manutenção da qualidade de frutos, hortaliças e flores ao longo da cadeia de comercialização.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7127 ou AGC7717","prerequisito":"(AGC7116 ou CBA7116) e (AGC7122 ou CBA7122)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7129":{"codigo":"CBA7129","nome":"Tecnologia de Produtos Agropecuários","ementa":"Tecnologia de transformação e conservação de produtos agropecuários de uso alimentar com ênfase para carnes e lacticínios. Classificação, terminologia, composição, microbiologia, bioquímica e fermentações. Padronização. Beneficiamento, equipamentos, processos industriais, subprodutos, higiene, controle de qualidade, conservação e armazenamento.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"AGC7129 ou AGC7722","prerequisito":"(AGC7106 ou CBA7106) e (ABF7104 ou CBV7104)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7718":{"codigo":"CNS7718","nome":"Gestão dos Negócios Agroindustriais","ementa":"Introdução ao Pensamento Administrativo. A Organização vista como um Sistema.  Processo Empresarial. Especificidades da Administração Rural. Noções de Gestão de Pessoas. Noções de Finanças. Fundamentos de Logística. Ferramentas de Gestão Rural Simplificada. Critérios de Desempenho Econômico.  Marketing e Planejamento Estratégico Aplicado a Sistemas Agroindustriais. Empreendedorismo e Plano de Negócios.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"AGC7718","prerequisito":"CNS7409 ou CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7130":{"codigo":"ABF7130","nome":"Floricultura e Paisagismo","ementa":"Floricultura: Importância econômica e social, origem, botânica, cultivares, exigências climáticas, propagação, nutrição, tratos culturais, colheita, embalagem, armazenamento, transporte, e comercialização das principais espécies floríferas e ornamentais. Plantas nativas com potencial ornamental. Paisagismo: Introdução e histórico. Estilos de jardins. Os elementos e suas características. Elaboração de projetos paisagísticos. Arborização urbana e rodoviária.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7130 ou AGC7707","prerequisito":"AGC7116 ou CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7318":{"codigo":"ABF7318","nome":"Avaliação e Perícia","ementa":"Introdução a Avaliação e Perícia agroflorestal. O papel do Perito. Impactos ambientais por atividades agrícolas e florestais. Avaliação de bens rurais. Avaliação da cobertura florística natural. Elaboração de laudo pericial. Códigos, Leis, Decretos e Portarias que envolvem direta ou indiretamente o uso de recursos naturais. Técnicas de geoprocessamento e cartografia digital aplicados aos trabalhos de perícias e avaliações florestais. Responsabilidade social e ambiental.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"CBV7318 ou EFL7613","prerequisito":"AGC7120 ou CBA7120 e CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BSU7806":{"codigo":"BSU7806","nome":"Suinocultura e Avicultura","ementa":"Importância e estatísticas da criação de suínos. Perspectivas na suinocultura mundial. Raças e linhagens suínas. Instalações, equipamentos, manejo, sanidade, profilaxia em suinocultura. Mane o zootécnico de suínos. Mane o reprodutivo de suínos. Mane o dejetos e carcaças na suinocultura. Situação e perspectivas da avicultura de corte e postura no Brasil e no mundo. O frango de corte moderno, sua formação, características das linhagens, sistemas de produção, desempenho, manejo e características das suas carcaças. As poedeiras comerciais modernas em seus aspectos de formação, evolução genética, produção, desempenho e características das granjas e seu manejo. Produção de pintos comerciais.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"CBV7806 ou MVC7605","prerequisito":"AGC7115 ou BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7131":{"codigo":"CBA7131","nome":"Plantas de Lavoura II","ementa":"Café, Cana-de-açúcar, Algodão, Mandioca, Girassol e Canola. Importância socioeconômica; Origem; Usos; Taxonomia, Morfologia e estádios de desenvolvimento; Clima e zoneamento agroclimático; Ecofisiologia; Nutrição mineral e adubação; Manejo da área; Cultivares; Estabelecimento e manejo da cultura; Doenças, Pragas, Plantas daninhas e controle; Colheita; Aulas de Campo.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"AGC7131 ou AGC7727","prerequisito":"(ABF7101 ou AGC7103) e (AGC7104 ou AGC7109) ou (CBA7104 e CBA7109)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7132":{"codigo":"CBA7132","nome":"Bioenergia","ementa":"Fontes de energia renováveis e não renováveis. Matriz energética brasileira. Agrocombustíveis. Análise e planejamento de sistemas eficientes de produção agrícola para a produção de Agrocombustíveis. Energia de biomassa, dejetos, algas, outros. Propriedades da madeira para energia. Processos de pirólise e carbonização. Briquetagem de biomassa para energia. Marco Regulatório e Políticas públicas. Impactos ambientais e socioeconômicos.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7132 ou AGC7709","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7135":{"codigo":"CNS7135","nome":"Trabalho de Conclusão de  Curso","ementa":"Elaboração e organização do TCC realizados a partir de atividades de pesquisa e ou extensão. Estas atividades, objeto de estudo do TCC, também poderão ser aquelas realizadas durante o estágio supervisionado.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"AGC7135 ou AGC7724","prerequisito":"CNS7133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7555":{"codigo":"CNS7555","nome":"Cooperativismo e Comercialização","ementa":"Aspectos teóricos da comercialização. Descrição do processo da comercialização. O enfoque de Cadeias Produtivas. Identificação e denominação de origem geográfica. Certificação de produtos. Fundamentos do cooperativismo como doutrina. O cooperativismo no Brasil. Criação e administração de uma cooperativa. Legislação cooperativa brasileira. Autogestão e educação cooperativa.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"CNS7718","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7716":{"codigo":"CNS7716","nome":"Extensão Rural","ementa":"Caracterização do meio rural e da Extensão rural no Brasil: história e bases teóricas sob uma visão crítica. Revolução verde e modernização da agricultura. Perfil e prática extensionistas. Extensão rural e sistemas locais de conhecimento e inovação: prática dialógica, comunicação e metodologia. Modelos pedagógicos, métodos e técnicas sociais em extensão rural. Planejamento da ação extensionista. Estado, centralização e descentralização: extensão e pesquisa agropecuária. Política Nacional de Assistência técnica e Extensão Rural, novas instâncias participativas, desafios e perspectivas.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"AGC7716","prerequisito":"CNS7409 ou CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS8010":{"codigo":"CNS8010","nome":"Extensão Rural","ementa":"História da Extensão rural no Brasil; Revolução Verde e modernização da agricultura; Extensão Rural e a pluralidade da agricultura: paradigmas pós revolução verde; Reflexões teóricas para orientar as ações de extensão; extensão e comunicação na era da informação: ética profissional, perfil e práticas extensionistas; Extensão rural e tecnologia: inovação e tecnologias sociais; Modelos pedagógicos de extensão rural; Metodologias de extensão rural; Diagnósticos e planejamento das ações de extensão; Políticas públicas, extensão rural e agricultura familiar.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"CNS7716","prerequisito":"CNS7409 ou CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7134":{"codigo":"CNS7134","nome":"Estágio Obrigatório Supervisionado","ementa":"Elaboração e organização do TCC realizados a partir de atividades de pesquisa e ou extensão. Estas atividades, objeto de estudo do TCC, também poderão ser aquelas realizadas durante o estágio supervisionado.","carga_horaria":198,"fase_sugestao":10,"equivalencia":"AGC7134 ou AGC7723","prerequisito":"ABF7101 e ABF7102 e ABF7103 e ABF7104 e ABF7105 e ABF7107 e ABF7108 e ABF7110 e ABF7114 e ABF7117 e ABF7118 e ABF7119 e ABF7121 e ABF7125 e ABF7126 e ABF7128 e ABF7130 e ABF7201 e ABF7204 e ABF7205 e ABF7309 e ABF7318 e BSU7115 e BSU7806 e BSU7817 e BSU7818 e CBA7101 e CBA7104 e CBA7106 e CBA7108 e CBA7109 e CBA7111 e CBA7113 e CBA7116 e CBA7119 e CBA7120 e CBA7122 e CBA7123 e CBA7124 e CBA7127 e CBA7129 e CBA7131 e CBA7132 e CNS7100 e CNS7101 e CNS7102 e CNS7105 e CNS7111 e CNS7112 e CNS7113 e CNS7114 e CNS7115 e CNS7133 e CNS7200 e CNS7202 e CNS7203 e CNS7211 e CNS7215 e CNS7216 e CNS7314 e CNS7315 e CNS7410 e CNS7412 e CNS7416 e CNS7514 e CNS7555 e CNS7613 e CNS7716 e CNS7718","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7014":{"codigo":"CNS7014","nome":"Atividades  Complementares","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"AGC7014","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF5051":{"codigo":"ABF5051","nome":"Nutrição Mineral de Plantas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7001":{"codigo":"ABF7001","nome":"Agricultura Digital","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ABF7008 ou AGC7008","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7004":{"codigo":"ABF7004","nome":"Patologia de Sementes","ementa":"Histórico, definições básicas e importância da Patologia de Sementes. Patógenos associados a sementes de culturas de importância. Pontos de entrada e localização de Patógenos em sementes. Transmissão e Epidemiologia. Testes de sanidade. Métodos de controle. Fungos de armazenamento. Situação atual e perspectivas da Patologia de Sementes. Equipamentos e Instalações. Métodos em Patologia de Sementes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7004 ou AGC7726","prerequisito":"ABF7110 ou AGC7110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7009":{"codigo":"ABF7009","nome":"Introdução a Etnobotânica","ementa":"Introdução. Desenvolvimento histórico da Etnobotânica, abordagens teóricas. Populações tradicionais e conservação biológica. Estudos etnobotânicos aplicados à conservação da biodiversidade. Métodos de coleta e análise de dados. Legislação sobre a utilização do patrimônio genético. Aspectos éticos associados ao acesso da informação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7009","prerequisito":"AGC7118 ou CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7206":{"codigo":"ABF7206","nome":"Manejo de Bacias Hidrográficas","ementa":"A floresta e o ciclo hidrológico. Dinâmica da água em solos florestados. Definição e caracterização de \nbacias hidrográficas. Conceito e importância do Manejo de Bacias Hidrográficas. Política e legislação para \nmanejo dos recursos da bacia hidrográfica. Uso racional dos recursos da bacia hidrográfica. Proteção de \nnascentes. Importância e função das matas ciliares. Efeito do reflorestamento, desflorestamento e da \nexploração florestal sobre os recursos hídricos. Controle e produção de água em microbacias hidrográficas \nflorestadas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CBV7206 ou EFL7615","prerequisito":"(ABF7107 ou AGC7107) e (AGC7120 ou CBA7120) e (ABF7205 ou CBV7205)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7311":{"codigo":"ABF7311","nome":"Ecologia Florestal","ementa":"Introdução à ecologia florestal: conceitos e importância. Ecologia das diferentes formações florestais naturais e povoamentos florestais. Fatores ambientais e climáticos. Produtividade florestal. Ciclagem de nutrientes.  Biomassa vegetal. Processos biológicos: competição, sucessão vegetal, polinização, dispersão de sementes, ecologia de população e comunidades. Distúrbios antrópicos e ambientais. Relação solo-vegetação. Fragmentação florestal. Ecologia da paisagem.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CBV7311","prerequisito":"CBA7209 e CNS7108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7315":{"codigo":"ABF7315","nome":"Restauração Ambiental","ementa":"Diagnóstico da degradação ambiental em ecossistemas naturais, com enfoque para as atividades agropecuárias e florestais. Princípios ecológicos para a restauração: solo, interações ecológicas e sucessão. Práticas de restauração de áreas degradadas. Projeto de Recuperação de Áreas Degradadas - PRAD. Legislação aplicada a recuperação e restauração ambiental.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CBV7315 ou CRC7614","prerequisito":"ABF7118 ou AGC7118","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7319":{"codigo":"ABF7319","nome":"Sistemas Agroflorestais","ementa":"Histórico e classificação de Sistemas Agroflorestais (SAF). Ecologia dos sistemas agroflorestais. Dinâmica temporal e espacial de SAFs. Implantação e manejo de SAFs. Dimensões sociais e econômicas dos SAFs. Legislação aplicada aos SAFs.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CBV7319 ou EFL7616","prerequisito":"ABF7309","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7328":{"codigo":"ABF7328","nome":"Unidade de Conservação","ementa":"A conservação da diversidade biológica no Brasil e no mundo - Sistema Nacional de Unidades de Conservação (SNUC- Brasil), sistemas de conservação de biodiversidade de outros países do mundo - análise comparativa. Critérios para estabelecimento de áreas protegidas para manejo e conservação de espécies, populações, comunidades e ecossistemas. Estratégias mundiais para proteção de biodiversidade.  Planejamento e Manejo de Unidades de Conservação de Proteção Integral e de Uso Sustentável. Gestão do entorno de unidades e criação de corredores ecológicos. Integração entre UCPI, UCUS e outras áreas protegidas como APP (áreas de proteção permanentes) e RL (reservas legais) com vistas à gestão biorregional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7729":{"codigo":"ABF7729","nome":"Plantas Medicinais, condimentares e aromáticas","ementa":"Origem, histórico, produção in vivo e in vitro de espécies medicinais, aromáticas e condimentares. Importância econômica, social e aspectos de mercado, quimiotaxonomia, classes de metabólitos secundários, vias biossintéticas e ensaios de atividade biológica. Sistemas de cultivo e desenvolvimento de produtos a partir de espécies medicinais, aromáticas e condimentares.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7729","prerequisito":"CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7730":{"codigo":"ABF7730","nome":"Plantas Medicinais, Condimentares e Aromáticas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7803":{"codigo":"ABF7803","nome":"Instalações e  Ambiência Animal","ementa":"Elementos e fatores climáticos que afetam os animais: temperatura do ar, umidade relativa do ar, vento, precipitação pluviométrica, radiação e altitude; Os animais e o ambiente: formas de dissipação e produção de calor; Efeitos do ambiente na produção, reprodução e saúde dos animais; Projeto e dimensionamento de instalações para suínos, bovinos de leite, aves de corte e postura, ovinos e caprinos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7819":{"codigo":"ABF7819","nome":"Biologia e Ecotoxicologia do Solo","ementa":"Biologia dos principais grupos de invertebrados edáficos em sistemas agrícolas e naturais. Papel da fauna do solo nos serviços do ecossistema e na conservação do solo. Métodos para coleta e monitoramento de fauna do solo. Fundamentos de Ecotoxicologia. Cultivo de organismos-teste em laboratório. Ensaios de Ecotoxicidade na regulamentação e avaliação de risco de agroquímicos e resíduos. Diagnóstico e monitoramento de áreas contaminadas. Normas brasileiras para caracterização Ecotoxicológica de solos e resíduos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CBV7819","prerequisito":"(ABF7102 ou CBV7102) e (ABF7103 ou CBV7103)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7823":{"codigo":"ABF7823","nome":"Cultivo Protegido","ementa":"Conceitos e Introdução. Materiais, equipamentos e estruturas. Manejo dos materiais, equipamentos e estruturas. Manejo do ambiente de cultivo. Cultivo e manejo em ambiente protegido. Manejo da Fertirrigação. Cultivo hidropônico.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7730","prerequisito":"ABF7101 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7824":{"codigo":"ABF7824","nome":"Cultivo Protegido","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7101 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7003":{"codigo":"BSU7003","nome":"Apicultura","ementa":"Contextualização, histórico e conceitos básicos em apicultura e meliponicultura. Biologia e classificação das abelhas. Equipamentos, indumentária e instalações apícolas. Manejo de colmeias e apiários. Alimentação das abelhas. Produtos apícolas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7004":{"codigo":"BSU7004","nome":"Endocanabinologia","ementa":"O Sistema Endocanabinoide: Endocanabinoides e seus receptores. Farmacologia dos endocanabinoides. Papel  fisiológico do sistema endocanabinoide. Os terpenofenóis: fitocanabinoides e fitoterpenos. Uso terapêutico dos fitoterpenofenóis e para fins de produção animal. Interações medicamentosas entre os canabinoides e medicamentos comumente prescritos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7101":{"codigo":"BSU7101","nome":"Desenvolvimento Sustentável e Saúde Global","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7105":{"codigo":"BSU7105","nome":"Comunicação e Relações Interpessoais","ementa":"Comunicação. Relacionamento interpessoal. Intersubjetividade. Uso adequado dos recursos de ação comunicativa na prática profissional. Interpretação e compreensão das diferentes culturas e suas linguagens. Atuação em equipes. Comunicação dialógica entre colegas, chefias e clientes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7161":{"codigo":"BSU7161","nome":"Nutrição e Alimentação de Ruminantes","ementa":"Importância da Nutrição Animal. Exigências nutricionais de ruminantes. Princípios da formulação de ração e balanceamento de dietas para ruminantes. Planejamento alimentar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7162":{"codigo":"BSU7162","nome":"Nutrição e Alimentação de Monogástricos","ementa":"Exigências nutricionais e programas de alimentação para aves, suínos, cães, gatos e equinos. Noções de manejo nutricional de peixes. Principais alimentos e aditivos para monogástricos. Métodos básicos de formulação de ração. Alimentação natural para cães e gatos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7803":{"codigo":"BSU7803","nome":"Instalações e Ambiência Animal","ementa":"Elementos e fatores climáticos que afetam os animais: temperatura do ar, umidade relativa do ar, vento, precipitação pluviométrica, radiação e altitude; Os animais e o ambiente: formas de dissipação e produção de calor; Efeitos do ambiente na produção, reprodução e saúde dos animais; Projeto e dimensionamento de instalações para suínos, bovinos de leite, aves de corte e postura, ovinos e caprinos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CBV7803","prerequisito":"ABF7204 ou CBV7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7808":{"codigo":"BSU7808","nome":"Tecnologia dos Produtos de Origem Animal II","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"CBV7808","prerequisito":"ABF7204 ou CBV7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7810":{"codigo":"BSU7810","nome":"Ovinocultura","ementa":"Situação atual da ovinocultura. Raças e produtos ovinos. Sistemas de produção. Aspectos básicos de manejo produtivo e sanitário de ovinos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7811":{"codigo":"BSU7811","nome":"Piscicultura","ementa":"Qualidade da água. Fisiologia e morfologia de animais aquáticos. Espécies de interesse econômico para a piscicultura. Sistemas criatórios e instalações. Manejo e sanidade em piscicultura.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7001":{"codigo":"CBA7001","nome":"Sistema Integrado de Produção Agropecuária","ementa":"Caracterização dos sistemas agropastoris, agroflorestais, agrosilvipastoris e lavoura\/pecuária. Critérios para a implantação dos sistemas integrados em áreas agrícolas, pecuárias e florestais. Princípios da interação solo x planta x animal. Fundamentos da ciclagem de nutrientes. Espécies vegetais para múltiplo uso. Integração e regeneração de sistemas. Sistemas consorciados. Planejamento da rotação e sucessão de culturas. Sustentabilidade ambiental e gestão de sistemas integrados.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7001","prerequisito":"(AGC7120 ou CBA7120) e (AGC7123 ou CBA7123)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7002":{"codigo":"CBA7002","nome":"Fruticultura II","ementa":"Abordagens teórico-práticas sobre aspectos gerais e específicos de culturas frutíferas de importância econômica para o Estado de Santa Catarina e Sul do Brasil, com ênfase a goiaba serrana, kiwizeiro, caquizeiro, abacateiro, maracujazeiro, abacaxizeiro, figueira, pequenos frutos (morango, framboesa, mirtilo, amora) e mirtáceas nativas. Abordagens de produção integrada de frutas e fruticultura de base agroecológica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7002 ou AGC7728","prerequisito":"AGC7116 ou CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7003":{"codigo":"CBA7003","nome":"Tecnologia de Aplicação de Defensivos Agrícolas","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"CBA7004","prerequisito":"ABF7114 e CBA7108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7007":{"codigo":"CBA7007","nome":"Agricultura de Precisão","ementa":"Conceitos básicos em agricultura de precisão. Mapeamento de atributos do solo. Mapeamento de atributos das plantas. Mapeamento de produtividade. Condutividade elétrica aparente do solo. Geoestatística básica. Sistemas de aplicação à taxa variável (fertilizantes e produtos fitossanitários). Controle de tráfego de máquinas agrícolas. Classes de manejo diferenciado.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7007","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7010":{"codigo":"CBA7010","nome":"Matologia II","ementa":"Controle químico de plantas daninhas. Classificação dos herbicidas. Características físico-químicas de herbicidas. Mecanismo de ação dos herbicidas. Mecanismos de resistência de plantas daninhas à herbicidas. Tecnologia de aplicação de herbicidas. Aulas de Campo.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7010","prerequisito":"AGC7113 ou CBA7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7019":{"codigo":"CBA7019","nome":"Manejo intensivo de pastagens","ementa":"Interação clima-solo-planta-animal; técnicas de manejo intensivo e adubação de pastagens; manejo de plantas daninhas, doenças e insetos em pastagens; recuperação e reforma de áreas degradadas; estratégias de suplementação animal em áreas de pastejo; uso de novas tecnologias no manejo de pastagens.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7745":{"codigo":"CBA7745","nome":"Agricultura e Silvicultura de Precisão","ementa":"Conceitos básicos em agricultura de precisão. Mapeamento de atributos do solo. Mapeamento de atributos das plantas. Mapeamento de produtividade. Condutividade elétrica aparente do solo. Geoestatística básica. Sistemas de aplicação à taxa variável (fertilizantes e produtos fitossanitários). Controle de tráfego de máquinas agrícolas. Classes de manejo diferenciado.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7745","prerequisito":"ABF7105 ou AGC7105 e AGC7109 ou CBA7109 e CBV7202 ou CNS7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7822":{"codigo":"CBA7822","nome":"Microbiologia e Qualidade do Solo","ementa":"Microrganismos do solo. Ecologia microbiana. Influência dos fatores abiótico e bióticos na quantidade, diversidade e atividade de microrganismos do solo. Microbiologia da rizosfera. Microrganismos promotores de crescimento de plantas: Rizobactérias promotoras do crescimento vegetal, Bactérias diazotróficas, Fungos micorrízicos, Microrganismos endofíticos. Biomassa microbiana. Importância dos microrganismos para fertilidade do solo: ciclos biogeoquímicos. Técnicas de avaliação da comunidade microbiana. Qualidade do solo. Biorremediação microbiana.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"AGC7746","prerequisito":"AGC7106 ou CBA7106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBV7803":{"codigo":"CBV7803","nome":"Instalações e Ambiência Animal","ementa":"Elementos e fatores climáticos que afetam os animais: temperatura do ar, umidade relativa do ar, vento, precipitação pluviométrica, radiação e altitude; Os animais e o ambiente: formas de dissipação e produção de calor; Efeitos do ambiente na produção, reprodução e saúde dos animais; Projeto e dimensionamento de instalações para suínos, bovinos de leite, aves de corte e postura, ovinos e caprinos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBV7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBV7808":{"codigo":"CBV7808","nome":"Tecnologia dos Produtos de Origem Animal II","ementa":"Conhecimentos sobre a importância da higiene do leite e o seu controle de qualidade, abordando os aspectos da sua padronização, classificação, beneficiamento, conservação e armazenamento, para posterior transformação em produtos derivados de alta qualidade.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBV7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7000":{"codigo":"CNS7000","nome":"Agricultura Familiar","ementa":"Conceitos de Agricultura Familiar e campesinato; História do campesinato no Brasil, estrutura agrária e evolução da agricultura no Brasil; diversidade social da agricultura familiar; Agricultura familiar, Políticas Públicas e representação política. Multifuncionalidade e pluratividade da agricultura familiar; formas de organização, movimentos sociais e sustentabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CRC7000 ou CRC7224","prerequisito":"CNS7409 ou CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7001":{"codigo":"CNS7001","nome":"Análise de Regressão","ementa":"Introdução à Análise de Regressão. Princípios básicos. Modelos Linear e Não-Linear. Análise de Resíduos. Análise de Variância. Métodos de seleção de Variáveis. Métodos de seleção de modelos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7002":{"codigo":"CNS7002","nome":"Tecnologia de Bebidas Fermentadas","ementa":"Fundamentos da tecnologia de bebidas fermentadas. Fermentação alcoólica. Técnicas de processamento de vinhos, cervejas e bebidas destiladas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7104 e CBA7106 e CNS7114","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7003":{"codigo":"CNS7003","nome":"Cultivo in vitro de Plantas","ementa":"Conteúdos práticos de cultivo in vitro visando a micropropagação de plantas: Equipamentos básicos, organização e biossegurança laboratorial; Elaboração de soluções estoque; Composição de meios de cultura, Técnicas de extração e inoculação dos diferentes tipos de explantes; Indução por diferentes rotas da morfogêsese in vitro; Biologia celular: Indução, manipulação e avaliações citoquímicas e de crescimento de linhagens celulares; Obtenção de sementes sintéticas e de unidades encapsuláveis; Biorreatores de Imersão temporária e Conservação in vitro.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7003 ou CRC7007","prerequisito":"AGC7112 ou CNS7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7005":{"codigo":"CNS7005","nome":"Tópicos Especiais em Agronomia I","ementa":"(Ementa Variável)","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7005 ou AGC7733","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7006":{"codigo":"CNS7006","nome":"Tópicos especiais em Agronomia II","ementa":"(Ementa Variável)","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7006 ou AGC7734","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7007":{"codigo":"CNS7007","nome":"Relações e Interações Humano-Animal: mudança de paradigma e novos desafios","ementa":"Relações humano - animal, natureza e cultura, novos debates acerca da humanidade e animalidade. A humanização dos animais domésticos e selvagens. Ética e animais de consumo humano. Uso religioso de animais.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7008":{"codigo":"CNS7008","nome":"Agricultura Biodinâmica","ementa":"História da agricultura moderna; Filosofia e agricultura: relações entre o ser humano e a natureza; Epistemologia da agricultura biodinâmica: da antroposofia às práticas agrícolas; Rudolf Steiner e a agricultura biodinâmica: a individualidade do organismo agrícola; Astronomia e agricultura; preparados biodinâmicos; compostagem, nutrição do solo e manejo biodinâmico; certificação biodinâmica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7009":{"codigo":"CNS7009","nome":"Matemática Financeira e Aplicações","ementa":"Fluxo de caixa, juros simples e compostos, séries de pagamentos, amortização. Aplicações financeiras. Educação financeira.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7010":{"codigo":"CNS7010","nome":"Gestão de Impactos Ambientais","ementa":"Introdução aos problemas ambientais globais, nacionais e locais. Impactos ambientais da agricultura, pecuária e silvicultura e possíveis medidas mitigadoras. Licenciamento ambiental de atividades da agricultura, pecuária e silvicultura, e legislação associada. A gestão ambiental em atividades da agricultura, pecuária e silvicultura como \noportunidade de atuação profissional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CNS8008 e CRC7421","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7011":{"codigo":"CNS7011","nome":"Sistemas Agroalimentares","ementa":"A agricultura e a era dos alimentos industrializados; Paradigmas alimentares: nutricionismo e alimentação; Sociologia e Antropologia da alimentação; segurança e soberania alimentar; agricultura urbana e alimentação; Imersão à prática de pesquisa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7011","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7012":{"codigo":"CNS7012","nome":"Intercâmbio II","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"AGC7012","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7013":{"codigo":"CNS7013","nome":"Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"AGC7013","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7015":{"codigo":"CNS7015","nome":"Cultura Brasileira","ementa":"Significados e dinâmicas da Cultura Brasileira. Estudos antropológicos sobre Cultura Brasileira. Conceitos de Cultura Brasileira. Artes no Brasil. Literaturas no período colonial e contemporâneo. Cultura popular e folclore. Comunicação de massa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7021":{"codigo":"CNS7021","nome":"Sistemas  Agroalimentares","ementa":"A agricultura e a era dos alimentos industrializados; Paradigmas alimentares: nutricionismo e alimentação; Sociologia e Antropologia da alimentação; segurança e soberania alimentar; agricultura urbana e alimentação; Imersão à prática de pesquisa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7022":{"codigo":"CNS7022","nome":"Planejamento Integrado da Propriedade Rural","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"ABF7000 ou AGC7000 ou AGC7720","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3654,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7108":{"codigo":"CNS7108","nome":"Biogeografia","ementa":"Identificação e análise das áreas de distribuição dos seres vivos e interpretação dos fatores ecológicos e históricos do meio em suas inter-relações. Princípios e teorias biogeográficas. Conceito de espécie e processos de especiação. Biogeografia histórica, biogeografia de ilhas e a teoria dos refúgios. Paleobiogeografia. Padrões de distribuição das espécies: territórios biogeográficos, biomas brasileiros e principais formações vegetacionais do sul do Brasil.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CBV7108","prerequisito":"(AGC7102 ou CNS7102) e (ABF7103 ou CBV7103)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7615":{"codigo":"CNS7615","nome":"Saneamento Ambiental","ementa":"Conhecimento e conceituação das propriedades físicas, químicas e biológicas dos resíduos; conhecimentos básicos sobre operações e processos unitários; conceituação e tecnologias utilizadas para o tratamento de águas naturais e residuárias; discussão de propostas para controle e disposição de resíduos sólidos; alternativas para reciclagem de resíduos e reuso da água.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CRC7616 ou (CRC7402 e CRC7421)","prerequisito":"CNS7514","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9211":{"codigo":"LLE9211","nome":"Língua Espanhola I","ementa":"Introdução aos estudos da língua espanhola. Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender e produzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"LLE9211","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9212":{"codigo":"LLE9212","nome":"Língua Espanhola II","ementa":"Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender, produzir e traduzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"LLE9212","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"}}},"20212":{"id":"632","codigo":20212,"codigo_curso":555,"carga_horaria_ufsc":4464,"carga_horaria_mec":4320,"aulas_semana_min":15,"aulas_semana_esperado":25,"aulas_semana_max":32,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20212","ucs":{"ABF7102":{"codigo":"ABF7102","nome":"Zoologia Geral","ementa":"Conceito e divisão da Zoologia; Sistemática zoológica: Classificação Lineana, Fenética e sistemática filogenética; Características gerais dos protozoários e importância evolutiva e agropecuária; Características gerais dos invertebrados (morfologia, anatomia e reprodução), importância evolutiva e agropecuária de platelmintos, blastocelomados (nematóides, rotíferas e acantocéfalos), moluscos, artrópodes; Características gerais dos vertebrados (morfologia, anatomia e reprodução); características gerais, importância evolutiva e pecuária dos peixes, anfíbios, répteis, aves e mamíferos. Domesticação de vertebrados. Diversidade de vertebrados silvestres.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7103":{"codigo":"ABF7103","nome":"Ecologia Geral","ementa":"Conceitos fundamentais em Ecologia. Níveis hierárquicos de organização. Biomas. Conceito de ecossistema, principais componentes e dinâmica. Fatores Bióticos e Abióticos. Ciclos biogeoquímicos. Ecologia trófica, cadeias e teias alimentares. Fluxo de energia e Ciclagem de materiais. Fatores ecológicos. Dinâmica de populações. Estrutura de comunidades. Sucessão ecológica. Diversidade das comunidades biológicas. Evolução e dinâmica. Biodiversidade e Usos de Recursos Naturais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7101":{"codigo":"CBA7101","nome":"Biologia Celular","ementa":"Níveis de organização das estruturas biológicas. Diversidade celular. Organização da célula procariota e eucariota animal e vegetal. Evolução celular. A Teoria Celular: as células e as funções celulares. Aspectos morfológicos, bioquímicos e funcionais da célula, de seus revestimentos e de seus compartimentos e componentes sub-celulares. Integração morfofuncional dos componentes celulares. Divisão celular. Processos de morte celular. Métodos de estudo em biologia celular.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7100":{"codigo":"CNS7100","nome":"Introdução  à  Agronomia","ementa":"Consciência crítica a respeito da escolha profissional e institucional, da formação acadêmica e dos compromissos na sociedade. Estrutura do curso de Agronomia. Conhecimento da vida acadêmica, da trajetória histórica da agricultura e da ciência agronômica. A agricultura brasileira e catarinense. Legislação, ética e perfil profissional.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7101":{"codigo":"CNS7101","nome":"Anatomia e Morfologia Vegetal","ementa":"Célula Vegetal. Histologia das plantas vasculares: Meristemas, tecidos de revestimento, tecidos de produção e reserva, tecidos de sustentação, tecidos de condução, estruturas secretoras. Anatomia e Morfologia externa de raiz, caule, folha, flor, fruto, semente e plântula. Embriologia de Gimnospermas e de Angiospermas. Adaptações anatômicas e morfológicas a diferentes ambientes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7112":{"codigo":"CNS7112","nome":"Pré-cálculo","ementa":"Álgebra. Geometria Elementar. Funções.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7114":{"codigo":"CNS7114","nome":"Química Geral e Orgânica","ementa":"Elemento químico e classificação periódica. Estequiometria. Ligações químicas. Polaridade e forças intermoleculares. Ácidos, bases, sais e óxidos. Funções, nomenclatura, propriedades físico-químicas e reatividade de alcanos, alcenos, compostos aromáticos, fenóis, éteres, aldeídos, cetonas, ácidos carboxílicos e seus derivados. Noções básicas sobre compostos de interesse biológico, agroquímicos e poluentes ambientais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7200":{"codigo":"CNS7200","nome":"Ética e Filosofia da Ciência","ementa":"Ética e Filosofia definições conceituais. Relação individuo, sociedade e cultura: Processo de desenvolvimento e constituição do ser humano e sociedade (cultura, linguagem, humanização). Filosofia da ciência: construção do conhecimento cientifico; diversidade de saberes, correlações entre ciência e sociedade. Ética e Ciência. Os múltiplos usos da Ética: na profissão, nas organizações e na sociedade. O interrelacionamento entre Filosofia e Ética.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7104":{"codigo":"ABF7104","nome":"Bioquímica","ementa":"Introdução à Bioquímica; Química e importância biológica de aminoácidos, proteínas, carboidratos, lipídeos, enzimas, coenzimas, vitaminas, nucleotídeos e ácidos nucléicos; Bioenergética; Metabolismo de carboidratos, lipídeos e aminoácidos; Integração e regulação do metabolismo.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7105":{"codigo":"CNS7105","nome":"Sistemática Vegetal","ementa":"Introdução à Botânica. Conceitos e métodos taxonômicos. Sistemas de classificação. Nomenclatura botânica. Noções de plantas avasculares. Sistemática de plantas vasculares. Principais táxons de interesse agronômico e florestal.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"CNS7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7113":{"codigo":"CNS7113","nome":"Cálculo Diferencial e Integral","ementa":"Revisão de Funções. Limites. Continuidade. Derivadas. Estudo de funções. Aplicações das derivadas. Integral Definida. Integral Indefinida. Cálculo de Área e Volume.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7211":{"codigo":"CNS7211","nome":"Física","ementa":"Vetores. Deslocamento. Velocidade. Condições gerais de equilíbrio. Trabalho. Energia. Conservação de Energia. Termodinâmica. Fluidos. Gases. Eletrostática. Fenômenos ondulatórios. Óptica Geométrica. Óptica Física. Introdução à Física Nuclear e a Física Atômica.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7214":{"codigo":"CNS7214","nome":"Química Analítica","ementa":"Introdução à análise química quantitativa e qualitativa. Erro e tratamento de dados analíticos. Estudo do pH. Precipitação e solubilidade. Métodos titulométricos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7215":{"codigo":"CNS7215","nome":"Sociologia Rural","ementa":"Definição de Sociologia Rural e campo temático. Estrutura fundiária e políticas de reforma agrária; formação sócio-econômica rural e relação com os modelos de desenvolvimento do Brasil. Agricultura familiar e agricultura patronal no Brasil. Estratificação e desigualdade rural. Comunidades tradicionais e ancestrais (origens africanas e ameríndias); diversidade sócio cultural da população rural, história e relações étnico-raciais. Relação campo-cidade,  políticas de desenvolvimento territorial e sustentabilidade.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7216":{"codigo":"CNS7216","nome":"Geologia e Mineralogia","ementa":"Introdução à Geologia. A Terra e a litosfera. Rochas e minerais constituintes. Geologia do Brasil e da região Sul. Intemperismo físico, químico e biológico. Produtos do intemperismo: Solos e mineralogia da fração argila (caulinita, gibbsita, illita, montmorilonita, esmectitas, vermiculita, óxidos de ferro, óxidos de alumínio). Criação de cargas elétricas em solos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7101":{"codigo":"ABF7101","nome":"Meteorologia e Climatologia","ementa":"METEOROLOGIA BÁSICA: Relações terra-sol. Atmosfera. Radiação solar e terrestre. Balanço de radiação e de energia na superfície. Temperatura do ar e do solo. Pressão atmosférica e vento. Evaporação e evapotranspiração. Umidade do ar. Processos de condensação na atmosfera (nuvens, nevoeiro, orvalho e geada). Precipitação (chuva, granizo e neve). Balanço hídrico. Elementos de dinâmica da atmosfera (forças que governam os movimentos atmosféricos, circulação geral e secundária da atmosfera, massas de ar e frentes, El Niño e La Niña). Estrutura meteorológica. CLIMATOLOGIA: elementos e fatores do clima. Macro, meso e microclimas. Classificações climáticas. Climas da Terra. Climas do Brasil. Oscilações e variações climáticas.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"CNS7211","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7105":{"codigo":"ABF7105","nome":"Propriedades Físicas e Químicas do Solo","ementa":"Introdução à Ciência do Solo; Composição do solo: Fases sólida, liquida e gasosa; Densidade de partículas e do solo; Porosidade do solo; Textura do solo; Estrutura e agregação do solo; Consistência do solo; Água no solo (dinâmica da água no solo, infiltração, avaliação, etc...); Temperatura do solo; Oxidação e redução do solo; Fenômenos de superfície; Origem das cargas negativas e positivas; complexos orgânicos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"CNS7211 e CNS7214 e CNS7216","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7119":{"codigo":"ABF7119","nome":"Morfofisiologia Animal","ementa":"Fisiologia celular e bioeletrogênese. Morfofisiologia dos sistemas endócrino, respiratório, digestório, reprodutor masculino, reprodutor feminino, gestação, parto e puerpério. Fisiologia da lactação e dos líquidos orgânicos. Termorregulação.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"ABF7104 e CBA7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7201":{"codigo":"ABF7201","nome":"Desenho Técnico","ementa":"Normas para o desenho técnico (ABNT). Caligrafia e traçado. Instrumentos e material de desenho. Sistemas de coordenadas. Escalas. Noções de geometria descritiva: projeções do ponto, da reta e do plano. Projeções: cilíndrica, ortogonal e oblíqua. Projeção em vistas ortográficas e perspectiva isométrica. Noções de desenho arquitetônico aplicado a edificações rurais. Desenho assistido por computador.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7837":{"codigo":"ABF7837","nome":"Propriedades Físicas e Químicas do Solo","ementa":"Introdução à Ciência do Solo; Composição do solo: Fases sólida, liquida e gasosa. Densidade de partículas e \ndo solo; Porosidade do solo; Textura do solo; Estrutura e agregação do solo; Consistência do solo; Água no \nsolo (dinâmica da água no solo, infiltração, avaliação, etc...); Temperatura do solo; Oxidação e redução do \nsolo; Fenômenos de superfície; Origem das cargas negativas e positivas; complexos orgânicos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"ABF7105","prerequisito":"CNS7211 e CNS7214 e CNS7216","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7838":{"codigo":"ABF7838","nome":"Desenho Técnico","ementa":"Normas para o desenho técnico (ABNT). Caligrafia e traçado. Instrumentos e material de desenho. Sistemas \nde coordenadas. Escalas. Noções de geometria descritiva: projeções do ponto, da reta e do plano. Projeções: \ncilíndrica, ortogonal e oblíqua. Projeção em vistas ortográficas e perspectiva isométrica. Noções de desenho \narquitetônico aplicado a edificações rurais. Desenho assistido por computador.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"ABF7201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7104":{"codigo":"CBA7104","nome":"Fisiologia Vegetal","ementa":"Água e componentes do potencial hídrico; Relações hídricas; Absorção e transporte de nutrientes; Fotossíntese; translocação de solutos orgânicos; Hormônios vegetais; Fotomorfogênese; Controle do florescimento; Fisiologia do estresse.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"ABF7104 e CBA7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7102":{"codigo":"CNS7102","nome":"Genética","ementa":"Material genético, estrutura, função, e expressão gênica. Mutação. Segregação meiótica e permuta. Leis básicas da genética. Interação genética. Determinação do sexo e herança ligada ao sexo. Linhagem e mapas cromossômicos. Herança citoplasmática. Evolução. Genética de Populações. Genômica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"CBA7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7115":{"codigo":"CNS7115","nome":"Metodologia da Pesquisa","ementa":"Introdução à produção de textos acadêmicos. Metodologia da pesquisa, definição do objetivo, hipóteses, problema, contextualização teórica e elaboração de uma proposta de trabalho. Compreensão e produção de textos e análise de gêneros discursivos acadêmicos (projeto de pesquisa, monografia, artigo científico, relatórios de pesquisa).","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7314":{"codigo":"CNS7314","nome":"Estatística Básica","ementa":"Análise estatística na área de ciências agrárias.  Estatística descritiva: Organização, resumo e apresentação de dados estatísticos. Técnicas de amostragem. Noções de probabilidade. Inferência estatística. Tabelas de contigência. A informática na Estatística.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"CNS7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7108":{"codigo":"ABF7108","nome":"Entomologia Agrícola","ementa":"Principais ordens e famílias de interesse agrícola, ciclo evolutivo e o desenvolvimento dos principais insetos de interesse agrícola, as características e identificação a nível de ordem e família destes insetos de interesse agrícola. Importância econômica dos insetos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"ABF7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7139":{"codigo":"ABF7139","nome":"Entomologia Agrícola","ementa":"","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"ABF7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7839":{"codigo":"ABF7839","nome":"Entomologia Agrícola","ementa":"","carga_horaria":72,"fase_sugestao":4,"equivalencia":"ABF7108","prerequisito":"CNS7112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7106":{"codigo":"CBA7106","nome":"Microbiologia Agrícola","ementa":"Introdução à microbiologia e grupos de bactérias, fungos, arquéias, vírus, algas e protozoários. Crescimento e metabolismo microbiano. Classificação e identificação de microrganismos. Estimativas de atividade e diversidade microbiana. Genética microbiana e biotecnologia. Técnicas de isolamento, observação e quantificação de microrganismos. Microbiologia do solo, do ar, da água e do leite.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"ABF7103 e CBA7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7202":{"codigo":"CNS7202","nome":"Elementos de Geodésia","ementa":"Fundamentos da geodésia. Elipsóide, Geóide e Plano. Sistemas geodésicos de referência. Sistemas de coordenadas cartesianas e elipsoidais. Transformação de coordenadas. Orientação do sistema cartesiano. Cálculo do azimute geodésico pelo problema geodésico inverso. Conceitos de cartografia. Escalas. Formas de representação do espaço: mapas, cartas, mosaicos e ortoimagens. Mapeamento sistemático brasileiro. Estudo do sistema de projeção cartográfica Universal Transverso de Mercator (UTM). Precisão e exatidão. Ajustamento de observações geodésicas.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7315":{"codigo":"CNS7315","nome":"Gênese, Morfologia e Classificação do Solo","ementa":"Introdução à Pedologia; Fatores e processos de formação do solo; Morfologia dos solos; Classificação dos solos; Sistemas de Classificação de Solos; Solos do Brasil e de Santa Catarina.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"ABF7105 e ABF7837","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7412":{"codigo":"CNS7412","nome":"Legislação e Gestão Ambiental","ementa":"Agronegócio e meio ambiente. Gases poluentes, efeito estufa, depleção da camada de ozônio. Código florestal brasileiro. Política nacional do meio ambiente. Lei de crimes ambientais. Política nacional de recursos hídricos. Política nacional de resíduos sólidos. Licenciamento ambiental. Código Estadual do Meio Ambiente de Santa Catarina. Sistemas de gestão ambiental.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"ABF7103 e CNS7114 e CNS7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7416":{"codigo":"CNS7416","nome":"Estatística Experimental","ementa":"Planejamento e implantação de experimentos. Princípios básicos de experimentação. Procedimentos para comparações múltiplas. Delineamentos experimentais. Modelos de regressão Apresentação e interpretação de resultados experimentais.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7514":{"codigo":"CNS7514","nome":"Poluição Ambiental","ementa":"Energia, desenvolvimento e poluição; aspectos físicos e químicos da poluição dos ambientes aquáticos e terrestres; poluição atmosférica; quimiodinâmica dos poluentes no ambiente; variáveis de interesse na avaliação e monitoramento do ambiente; critérios e padrões de qualidade da água e do ar; introdução aos sistemas convencionais e alternativos de tratamento e controle da poluição.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"CNS7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7613":{"codigo":"CNS7613","nome":"Fundamentos de Economia Rural","ementa":"Importância dos Setores Agropecuário e Florestal para o Desenvolvimento Econômico. Tópicos de Microeconomia: A demanda do Consumidor; A curva de Oferta; Equilíbrio de Mercado; Teoria da Produção.  Tópicos de Macroeconomia: Noções de Medidas de Atividade Econômica e os Instrumentos de Política Econômica; Inflação; Comercio Internacional. Políticas Agrícolas e Agrárias. Conjuntura da Economia Rural Brasileira.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"CNS7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS8011":{"codigo":"CNS8011","nome":"Poluição Ambiental","ementa":"Energia, desenvolvimento e poluição. Aspectos físicos e químicos da poluição dos ambientes aquáticos e terrestres. Poluição atmosférica. Quimiodinâmica dos poluentes no ambiente. Variáveis de interesse na avaliação e monitoramento do ambiente. Critérios e padrões de qualidade da água e do ar. Introdução aos sistemas convencionais e alternativos de tratamento e controle da poluição.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CNS7514","prerequisito":"CNS7214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7107":{"codigo":"ABF7107","nome":"Hidrologia","ementa":"Propriedades e características da água. Água como elemento da paisagem. Ciclo hidrológico e sua interação no contexto solo-água-planta-atmosfera. Dados hidrológicos básicos (precipitação, interceptação, escoamento superficial, infiltração, evaporação e transpiração). Obtenção e análise de registros hidrológicos. Medição e regularização de vazões. Noções de transporte de sedimentos. Águas subterrâneas. Bacias hidrográficas: definição, importância e caracterização. Noções básicas de manejo de Bacias hidrográficas.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"ABF7101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7110":{"codigo":"ABF7110","nome":"Fitopatologia Agrícola","ementa":"Histórico da Fitopatologia. Conceito de doenças de plantas. Agentes causadores de doenças em plantas. Sintomatologia e diagnose. Ciclo das relações patógenos hospedeiro. Resistência de plantas a doenças. Fisiologia do parasitismo. Epidemiologia. Controle de doenças de plantas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"CBA7106 e CNS7114","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7309":{"codigo":"ABF7309","nome":"Silvicultura","ementa":"Introdução à silvicultura. Produção de mudas de espécies florestais. Implantação de povoamentos florestais. Condução de povoamentos florestais. Sistemas silviculturais. Silvicultura das principais espécies florestais nativas e exóticas.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7840":{"codigo":"ABF7840","nome":"Fitopatologia Agrícola","ementa":"","carga_horaria":72,"fase_sugestao":5,"equivalencia":"ABF7110","prerequisito":"CBA7106 e CNS7114","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7817":{"codigo":"BSU7817","nome":"Fundamentos de Melhoramento Animal","ementa":"Modos de ação gênica; fundamentos de herança e meio; noções de correlações genética, fenotípica e ambiental e interação genótipo ambiente; seleção e ganho genético; endogamia e cruzamento.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7102 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7108":{"codigo":"CBA7108","nome":"Mecanização Agrícola","ementa":"Conceitos gerais de mecânica: Força, Potência, Trabalho e Torque. Motores de combustão interna. Tratores agrícolas, constituição, manutenção, operação e ensaios. Máquinas e implementos agrícolas: função, constituição e regulagens. Máquinas de colheita de grãos e forragens: regulagens e estudo de perdas de colheita. Aspectos de segurança na operação de máquinas e implementos: equilíbrio e transferência de peso. Planejamento, seleção e desempenho operacional da mecanização agrícola. Estudo econômico de conjuntos motomecanizados.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"ABF7105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7109":{"codigo":"CBA7109","nome":"Fertilidade do Solo e Adubação","ementa":"Reação do solo e propriedades químicas do solo. Bases conceituais úteis para a Fertilidade do Solo. Acidez do solo e calagem. Ciclos biogeoquímicos de nutrientes. Dinâmica da matéria orgânica do solo. Dinâmica dos macronutrientes no solo. Dinâmica dos Micronutrientes no solo. Avaliação integrada da fertilidade do solo. Interpretação de análises de solo e recomendação de adubos e corretivos para espécies de interesse agrícola. Uso eficiente de adubos e corretivos. Fontes e classificação dos adubos para espécies agrícolas. Determinação da necessidade de adubação química e orgânica. Adubação de sistemas. Aulas de Campo","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7111":{"codigo":"CBA7111","nome":"Melhoramento Genético de Plantas","ementa":"Origem e Evolução de Plantas Cultivadas. Conservação de germoplasma. Sistemas de Reprodução de Plantas Cultivadas. Estrutura Genética de Populações. Bases Genéticas dos Caracteres Qualitativos e Quantitativos. Base Genética e Métodos de Melhoramento Plantas Autógamas e Alógamas. Interação Genótipo e Ambiente. Genética da resistência a pragas e doenças.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7102 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7823":{"codigo":"CBA7823","nome":"Mecanização Agrícola","ementa":"","carga_horaria":72,"fase_sugestao":5,"equivalencia":"CBA7108","prerequisito":"ABF7105 ou ABF7837","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7826":{"codigo":"CBA7826","nome":"Melhoramento Genético de Plantas","ementa":"","carga_horaria":72,"fase_sugestao":5,"equivalencia":"CBA7111","prerequisito":"CNS7102 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7833":{"codigo":"CBA7833","nome":"Fertilidade do Solo e Adubação","ementa":"","carga_horaria":72,"fase_sugestao":5,"equivalencia":"CBA7109","prerequisito":"CNS7315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7103":{"codigo":"CNS7103","nome":"Extensão e Desenvolvimento Rural","ementa":"Economia e desenvolvimento. Perspectivas de desenvolvimento rural. Políticas públicas e agricultura. Paradigmas da extensão rural. Comunicação social e organizacional. Gestão de pessoas.  Paradigmas pedagógicos e extensão rural. Diagnósticos e metodologias extensionistas. Tecnologias, inovação e extensão rural.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7410":{"codigo":"CNS7410","nome":"Desenvolvimento Rural","ementa":"Crise paradigmática e emergência da dimensão ambiental; Conceito sistêmico de meio ambiente e transformações no mundo rural; crescimento e desenvolvimento econômico; modelos de desenvolvimento rural e agrícola; Do ecodesenvolvimento ao desenvolvimento territorial sustentável; Desenvolvimento, multifuncionalidade e pluriatividade; Territorialidade e políticas públicas; planejamento territorial, regional e municipal; organização, poder local, participação política e ética ambiental.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"CNS7215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7114":{"codigo":"ABF7114","nome":"Agrometeorologia","ementa":"Crescimento e desenvolvimento vegetal; Fatores ecológicos que afetam o crescimento e desenvolvimento dos vegetais e a produtividade das culturas agrícolas: Radiação solar, balanço de radiação e de energia em comunidades vegetais, utilização da radiação pelas culturas. Fotoperiodismo e suas aplicações; Temperatura do ar e comportamento vegetal, termoperiodismo e vernalização; competição em comunidades vegetais; Água no sistema planta-atmosfera e seu efeito na produção agrícola; Zoneamentos agrícolas e ecológicos; Aplicações da Agrometeorologia a ambientes protegidos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"ABF7101 e ABF7103 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7117":{"codigo":"ABF7117","nome":"Hidráulica","ementa":"Propriedades físicas dos fluidos; Princípios da hidrostática e da hidrodinâmica; Condutos forçados; Perda de carga; Instalações de recalque; Bombas e adutoras; Condutos Livres. Hidrometria.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"ABF7107 e CNS7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7118":{"codigo":"ABF7118","nome":"Conservação e Uso da Biodiversidade","ementa":"Qualificação, funções, valoração e perda da biodiversidade. Mudanças climáticas e biodiversidade. Biodiversidade, agricultura e sustentabilidade. Uso, conservação e manejo de Recursos Genéticos. Coleta e caracterização de RGs. Agrobiodiversidade e conhecimento tradicional. A convenção sobre a diversidade biológica (CDB) e outros acordos\/convenções e seus impactos sobre os recursos genéticos (RGs). Abordagens baseadas na legislação sobre a conservação e uso dos RGs. Aulas de campo.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7841":{"codigo":"ABF7841","nome":"Conservação e Uso da Biodiversidade","ementa":"Qualificação, funções, valoração e perda da biodiversidade. Mudanças climáticas e biodiversidade. Biodiversidade, agricultura e sustentabilidade. Uso, conservação e manejo de Recursos Genéticos. Coleta e caracterização de RGs. Agrobiodiversidade e conhecimento tradicional. A convenção sobre a diversidade biológica (CDB) e outros acordos\/convenções e seus impactos sobre os recursos genéticos (RGs). Abordagens baseadas na legislação sobre a conservação e uso dos RGs. Aulas de campo.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"ABF7118","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7115":{"codigo":"BSU7115","nome":"Nutrição Animal","ementa":"Importância da Nutrição Animal. Princípios fisiológicos ligados aos processos de digestão e absorção. Metabolismo dos nutrientes na nutrição de animais ruminantes e não ruminantes.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"ABF7104 e ABF7119","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7113":{"codigo":"CBA7113","nome":"Matologia I","ementa":"Biologia das plantas daninhas. Classificação e identificação de plantas daninhas. Banco de sementes e dormência.  Interferência de plantas daninhas. Alelopatia. Métodos de manejo e controle. Controle químico. Absorção, translocação e metabolismo de herbicidas. Resistência de plantas daninhas à herbicidas. Comportamento de herbicidas no ambiente. Recomendações técnicas para manejo de plantas daninhas em áreas agrícolas e não agrícolas. Aulas de campo.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7116":{"codigo":"CBA7116","nome":"Horticultura","ementa":"Fundamentos da Ciência da Horticultura. Métodos de Propagação de plantas hortícolas, sementeiras, viveiros de produção e conservação de plantas matrizes, básicas e certificadas. Dormência. Floração e Frutificação. Poda e sistemas de condução. Cultivo em ambiente protegido.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7827":{"codigo":"CBA7827","nome":"Matologia I","ementa":"","carga_horaria":54,"fase_sugestao":6,"equivalencia":"CBA7113","prerequisito":"CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7111":{"codigo":"CNS7111","nome":"Biotecnologia Vegetal","ementa":"Histórico, importância e uso da biotecnologia. Totipotência celular e aspectos comparativos em plantas e animais. Cultura de células, tecidos e órgãos. Linhagens e fusões celulares e hibridomas. Manipulação de embriões e Sementes sintéticas. Biorreatores. Criopreservação. Produção de metabólitos secundários \"in vitro\". Dogma central da biologia molecular. Genômica, transcriptômica, proteômica e metabolômica. Marcadores Moleculares: tipos, base genética e aplicações. Tecnologias do ADN recombinante. Conceito, produtos e implicações dos Organismos Geneticamente Modificados. Bioética, Biossegurança e Meio Ambiente.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"CBA7111 e CBA7826","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7203":{"codigo":"CNS7203","nome":"Topografia","ementa":"Limite e divisão da topografia. Planimetria. Altimetria. Instrumentação topográfica. Posicionamento por satélites artificiais. Georreferenciamento de imóveis rurais. Cadastro ambiental rural. Perícias. Elaboração de peças técnicas em topografia: relatórios, monografias de marcos e registro de imóveis. Desenho topográfico.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"CNS7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS8012":{"codigo":"CNS8012","nome":"Topografia","ementa":"Limite e divisão da topografia. Planimetria. Altimetria. Instrumentação topográfica. Posicionamento por satélites artificiais. Georreferenciamento de imóveis rurais. Cadastro ambiental rural. Perícias. Elaboração de peças técnicas em topografia: relatórios, monografias de marcos e registro de imóveis. Desenho topográfico","carga_horaria":72,"fase_sugestao":6,"equivalencia":"CNS7203","prerequisito":"CNS7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7121":{"codigo":"ABF7121","nome":"Manejo Integrado de Pragas e Doenças Agrícolas","ementa":"Introdução ao Manejo Integrado de Pragas e Doenças. Conceitos em Manejo Integrado de Pragas e Doenças. Sistemas de previsão. Métodos e estratégias de controle de populações de pragas. Características dos principais fungicidas e inseticidas. Tecnologia de aplicação de defensivos agrícolas. Toxicologia humana e do ambiente. Manejo integrado de pragas e doenças das principais culturas.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"ABF7108 e ABF7110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7204":{"codigo":"ABF7204","nome":"Construções Rurais","ementa":"Noções sobre a resistência dos materiais, estudo dos materiais, dos elementos estruturais e partes complementares de uma edificação; montagem de projetos de edificações.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"ABF7201 e CNS7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7205":{"codigo":"ABF7205","nome":"Geoprocessamento","ementa":"Fundamentos de sensoriamento remoto. Princípios físicos do sensoriamento remoto. Processamento digital de imagens. Aerofotogrametria e fotointerpretação. Conceito de sistema de informações geográficas. Modelo de dados matriz e vetor. Modelagem de dados geográficos. Banco de dados geográficos. Produção de mapas. Programas aplicados ao geoprocessamento. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"CNS7203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7842":{"codigo":"ABF7842","nome":"Manejo Integrado de Pragas e Doenças Agrícola","ementa":"","carga_horaria":54,"fase_sugestao":7,"equivalencia":"ABF7121","prerequisito":"(ABF7110 ou ABF7840) e (ABF7108 ou ABF7139)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7843":{"codigo":"ABF7843","nome":"Construções Rurais","ementa":"Noções sobre a resistência dos materiais, estudo dos materiais, dos elementos estruturais e partes complementares de uma edificação; montagem de projetos de edificações.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"ABF7204","prerequisito":"(ABF7201 ou ABF7838) e (CNS7203 ou CNS8012)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7844":{"codigo":"ABF7844","nome":"Geoprocessamento","ementa":"Fundamentos de sensoriamento remoto. Princípios físicos do sensoriamento remoto. Processamento digital de imagens. Aerofotogrametria e fotointerpretação. Conceito de sistema de informações geográficas. Modelo de dados matriz e vetor. Modelagem de dados geográficos. Banco de dados geográficos. Produção de mapas. Programas aplicados ao geoprocessamento. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"ABF7205","prerequisito":"CNS7203 ou CNS8012","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7119":{"codigo":"CBA7119","nome":"Tecnologia e Produção de Sementes","ementa":"Importância da semente e panorama atual da produção de semente no Brasil. Estrutura e composição química das sementes. Formação e maturação da semente. Germinação e dormência. Vigor e deterioração de sementes.  Legislação para a produção e comércio de sementes. Estabelecimento e condução de campo de produção de sementes. Sistemas de certificação e fiscalização de sementes. Colheita e secagem de sementes. Beneficiamento e armazenamento de sementes. Tratamento de sementes. Análises de sementes. Aulas de campo.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"CBA7104 e CBA7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7120":{"codigo":"CBA7120","nome":"Manejo e Conservação do Solo e da  Água","ementa":"Introdução ao planejamento do uso das terras e ao planejamento conservacionista. Princípios e conceitos de degradação do solo. Erosão do solo e seu controle. Mecanismos e fatores que afetam a erosão hídrica. Práticas de controle da erosão hídrica do solo. Predição da erosão hídrica do solo. Princípios e conceitos de manejo e conservação do solo e da água. Histórico do manejo e da conservação do solo e da água em Santa Catarina e no Brasil. Sustentabilidade e uso sustentável em agricultura. Manejo do solo em diferentes sistemas de preparo. Plantas de cobertura, rotação e consorciação de culturas. Legislação em conservação do solo e da água. Sistemas de Uso e de culturas do solo (ILP, ILPF). Qualidade do solo. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7122":{"codigo":"CBA7122","nome":"Fruticultura I","ementa":"Importância socioeconômica e organização da atividade frutícola. Caracterização dos sistemas de produção. Origem, botânica, cultivares, exigências climáticas, instalação, manejo e tratos culturais, colheita e comercialização de fruteiras de clima temperado, subtropical e tropical, dando-se ênfase à videira, bananeira, citricultura, frutas de caroço, macieira e pereira.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7123":{"codigo":"CBA7123","nome":"Forragicultura","ementa":"Morfologia e taxonomia das plantas forrageiras. Características agronômicas das principais espécies forrageiras. Pastagens nativas e cultivadas. Fisiologia de plantas forrageiras. Implantação de pastagens. Manejo do campo nativo. Manejo de pastagens. Avaliação e quantificação de forragem. Conservação de forragens. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"BSU7115 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7828":{"codigo":"CBA7828","nome":"Tecnologia e Produção de Sementes","ementa":"","carga_horaria":54,"fase_sugestao":7,"equivalencia":"CBA7119","prerequisito":"CBA7104 e (CBA7111 ou CBA7826)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7829":{"codigo":"CBA7829","nome":"Manejo e Conservação do Solo e da Água","ementa":"Introdução ao planejamento do uso das terras e ao planejamento conservacionista. Princípios e conceitos de degradação do solo. Erosão do solo e seu controle. Mecanismos e fatores que afetam a erosão hídrica. Práticas de controle da erosão hídrica do solo. Predição da erosão hídrica do solo. Princípios e conceitos de manejo e conservação do solo e da água. Histórico do manejo e da conservação do solo e da água em Santa Catarina e no Brasil. Manejo do solo. Plantas de cobertura, rotação e consorciação de culturas. Legislação em conservação do solo e da água. Sistemas de uso do solo (ILP, ILPF). Qualidade do solo. Aulas de campo.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"CBA7120","prerequisito":"CBA7109 ou CBA7833","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CBA7830":{"codigo":"CBA7830","nome":"Forragicultura","ementa":"","carga_horaria":72,"fase_sugestao":7,"equivalencia":"CBA7123","prerequisito":"BSU7115 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7133":{"codigo":"CNS7133","nome":"Planejamento de TCC","ementa":"Planejamento, organização e elaboração de  projetos de pesquisa, extensão e estágio; definição de metas e objetivos; revisão da produção científica; técnicas de elaboração de monografia e apresentação pública. Noções sobre SIARE\/DIP\/PROGRAD e Repositório Institucional.","carga_horaria":18,"fase_sugestao":7,"equivalencia":"","prerequisito":"CNS7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7125":{"codigo":"ABF7125","nome":"Olericultura","ementa":"Importância econômica, alimentar e social, origem, botânica e fisiologia, cultivares, exigências climáticas, propagação, nutrição, tratos culturais das principais espécies olerícolas.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7126":{"codigo":"ABF7126","nome":"Irrigação e Drenagem","ementa":"A água no sistema solo-planta-atmosfera; Manejo da irrigação; Métodos de irrigação pressurizada; Métodos de irrigação por superfície; Drenagem agrícola.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"ABF7114 e ABF7117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7128":{"codigo":"ABF7128","nome":"Agroecologia","ementa":"Agricultura de base agroecológica: conceitos, princípios, processos e histórico. Princípios ecológicos na agricultura: dinâmica de nutrientes, da água e da energia, biodiversidade e trofobiose. Base ecológica do manejo de pragas, doenças e espécies ruderais. Tecnologias agroecológicas. Correntes da agricultura de base agroecológica: orgânica, biodinâmica, natural, permacultura. Conhecimento tradicional\/local e conservação da agrobiodiversidade. Legislação associada à produção de base agroecológica.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"ABF7118 e CNS7409","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7845":{"codigo":"ABF7845","nome":"Irrigação e Drenagem","ementa":"","carga_horaria":54,"fase_sugestao":8,"equivalencia":"ABF7126","prerequisito":"ABF7114 e ABF7117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7846":{"codigo":"ABF7846","nome":"Agroecologia","ementa":"","carga_horaria":54,"fase_sugestao":8,"equivalencia":"ABF7128","prerequisito":"ABF7118 e CNS7409","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7189":{"codigo":"BSU7189","nome":"Bovinocultura de Corte e Leite","ementa":"","carga_horaria":72,"fase_sugestao":8,"equivalencia":"BSU7818","prerequisito":"BSU7115 e (CBA7123 ou CBA7830)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7818":{"codigo":"BSU7818","nome":"Bovinocultura de Corte e Leite","ementa":"Contextualização da cadeia produtiva de bovinos de corte e de leite. Raças, cruzamentos e morfologia de bovinos de corte e de leite. Sistemas de produção intensiva e extensiva de bovinos de corte e de leite. Manejo reprodutivo, alimentar e sanitário do rebanho de bovinos de corte nas fases de cria, recria e terminação. Manejo reprodutivo, alimentar e sanitário de vacas em lactação e fêmeas leiteiras nas fases de cria e recria. Estudo da lactação e manejo da ordenha. Qualidade do leite. Gestão da produção de bovinos de corte e de leite. Bem-estar animal. Aulas de campo.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"BSU7115 e CBA7123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7124":{"codigo":"CBA7124","nome":"Plantas de Lavoura I","ementa":"Trigo, Cevada, Arroz, Soja, Feijão e Milho; Importância socioeconômica; Origem; Usos; Taxonomia, Morfologia e estádios de desenvolvimento; Clima e zoneamento agroclimático; Ecofisiologia; Nutrição mineral e adubação; Manejo da área; Cultivares; Estabelecimento e manejo da cultura; Doenças, Pragas, Plantas daninhas e controle; Colheita; Aulas de campo.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"ABF7101 e CBA7104 e CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7127":{"codigo":"CBA7127","nome":"Fisiologia e Manejo Pós Colheita","ementa":"Abordagens bioquímicas e fisiológicas dos principais eventos que ocorrem durante o amadurecimento e senescência de órgãos vegetais. Padrões de amadurecimento e atributos de qualidade. Fatores que afetam a qualidade de frutos e que contribuem para a ocorrência de perdas durante o manuseio pós-colheita. Sistemas de armazenamento e técnicas complementares disponíveis para a manutenção da qualidade de frutos, hortaliças e flores ao longo da cadeia de comercialização.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CBA7116 e CBA7122","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7129":{"codigo":"CBA7129","nome":"Tecnologia de Produtos Agropecuários","ementa":"Tecnologia de transformação e conservação de produtos agropecuários de uso alimentar com ênfase para carnes e lacticínios. Classificação, terminologia, composição, microbiologia, bioquímica e fermentações. Padronização. Beneficiamento, equipamentos, processos industriais, subprodutos, higiene, controle de qualidade, conservação e armazenamento.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"","prerequisito":"ABF7104 e CBA7106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7831":{"codigo":"CBA7831","nome":"Plantas de Lavoura I","ementa":"","carga_horaria":72,"fase_sugestao":8,"equivalencia":"CBA7124","prerequisito":"(ABF7101 e CBA7104) e (CBA7109 ou CBA7833)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7718":{"codigo":"CNS7718","nome":"Gestão dos Negócios Agroindustriais","ementa":"Introdução ao Pensamento Administrativo. A Organização vista como um Sistema.  Processo Empresarial. Especificidades da Administração Rural. Noções de Gestão de Pessoas. Noções de Finanças. Fundamentos de Logística. Ferramentas de Gestão Rural Simplificada. Critérios de Desempenho Econômico.  Marketing e Planejamento Estratégico Aplicado a Sistemas Agroindustriais. Empreendedorismo e Plano de Negócios.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7130":{"codigo":"ABF7130","nome":"Floricultura e Paisagismo","ementa":"Floricultura: Importância econômica e social, origem, botânica, cultivares, exigências climáticas, propagação, nutrição, tratos culturais, colheita, embalagem, armazenamento, transporte, e comercialização das principais espécies floríferas e ornamentais. Plantas nativas com potencial ornamental. Paisagismo: Introdução e histórico. Estilos de jardins. Os elementos e suas características. Elaboração de projetos paisagísticos. Arborização urbana e rodoviária.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7318":{"codigo":"ABF7318","nome":"Avaliação e Perícia","ementa":"Introdução a Avaliação e Perícia agroflorestal. O papel do Perito. Impactos ambientais por atividades agrícolas e florestais. Avaliação de bens rurais. Avaliação da cobertura florística natural. Elaboração de laudo pericial. Códigos, Leis, Decretos e Portarias que envolvem direta ou indiretamente o uso de recursos naturais. Técnicas de geoprocessamento e cartografia digital aplicados aos trabalhos de perícias e avaliações florestais. Responsabilidade social e ambiental.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"CBA7120 e CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF7418":{"codigo":"ABF7418","nome":"Avaliação, Perícia e Restauração Ambiental","ementa":"Diagnóstico dos impactos ambientais em ecossistemas naturais: avaliação e perícia com enfoque para as propriedades e atividades agropecuárias e florestais. Avaliação de bens rurais NBR 14653. Avaliação da cobertura natural e Valoração Econômica dos Recursos Ambientais (VERA). Legislação aplicada ao uso, avaliação de impacto e restauração ambiental. Elaboração de laudo de avaliação e pericia ambiental. Princípios da restauração: solo, interações ecológicas e\nsucessão. Projeto de Recuperação de Áreas Degradadas. Práticas de Avaliação, Perícia e Restauração de recursos naturais em áreas degradadas.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"ABF7318","prerequisito":"CBA7120 ou (CBA7829 e CNS7412)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ABF7847":{"codigo":"ABF7847","nome":"Avaliação e Perícia","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"ABF7318","prerequisito":"(CBA7120 e CBA7829) e CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7806":{"codigo":"BSU7806","nome":"Suinocultura e Avicultura","ementa":"Importância e estatísticas da criação de suínos. Perspectivas na suinocultura mundial. Raças e linhagens suínas. Instalações, equipamentos, manejo, sanidade, profilaxia em suinocultura. Mane o zootécnico de suínos. Mane o reprodutivo de suínos. Mane o dejetos e carcaças na suinocultura. Situação e perspectivas da avicultura de corte e postura no Brasil e no mundo. O frango de corte moderno, sua formação, características das linhagens, sistemas de produção, desempenho, manejo e características das suas carcaças. As poedeiras comerciais modernas em seus aspectos de formação, evolução genética, produção, desempenho e características das granjas e seu manejo. Produção de pintos comerciais.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7103":{"codigo":"CBA7103","nome":"Tecnologia de Aplicação de Defensivos Agrícolas","ementa":"Importância da qualidade na aplicação de defensivos agrícolas. Conceitos de alvo biológico. Técnicas de aplicação de produtos agrícolas. Adjuvantes agrícolas. Fatores climáticos na aplicação\nde defensivos. Teoria da gota. Índice Span. Penetração, Deposição, cobertura e densidade de gotas. Deriva na aplicação de defensivos agrícolas. Tipos de pulverizadores. Manutenção de equipamentos. Pontas de pulverização. Importância da pressão de pulverização. Qualidade e segurança na aplicação. Metodologias para estimar a qualidade da aplicação.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"CBA7003","prerequisito":"ABF7114 e CBA7108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7131":{"codigo":"CBA7131","nome":"Plantas de Lavoura II","ementa":"Café, Cana-de-açúcar, Algodão, Mandioca, Girassol e Canola. Importância socioeconômica; Origem; Usos; Taxonomia, Morfologia e estádios de desenvolvimento; Clima e zoneamento agroclimático; Ecofisiologia; Nutrição mineral e adubação; Manejo da área; Cultivares; Estabelecimento e manejo da cultura; Doenças, Pragas, Plantas daninhas e controle; Colheita; Aulas de Campo.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"","prerequisito":"ABF7101 e CBA7104 e CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7132":{"codigo":"CBA7132","nome":"Bioenergia","ementa":"Fontes de energia renováveis e não renováveis. Matriz energética brasileira. Agrocombustíveis. Análise e planejamento de sistemas eficientes de produção agrícola para a produção de Agrocombustíveis. Energia de biomassa, dejetos, algas, outros. Propriedades da madeira para energia. Processos de pirólise e carbonização. Briquetagem de biomassa para energia. Marco Regulatório e Políticas públicas. Impactos ambientais e socioeconômicos.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CBA7832":{"codigo":"CBA7832","nome":"Plantas de Lavouras II","ementa":"","carga_horaria":72,"fase_sugestao":9,"equivalencia":"CBA7131","prerequisito":"(ABF7101 e CBA7104) e (CBA7109 ou CBA7833)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS7135":{"codigo":"CNS7135","nome":"Trabalho de Conclusão de  Curso","ementa":"Elaboração e organização do TCC realizados a partir de atividades de pesquisa e ou extensão. Estas atividades, objeto de estudo do TCC, também poderão ser aquelas realizadas durante o estágio supervisionado.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"CNS7133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS7555":{"codigo":"CNS7555","nome":"Cooperativismo e Comercialização","ementa":"Aspectos teóricos da comercialização. Descrição do processo da comercialização. O enfoque de Cadeias Produtivas. Identificação e denominação de origem geográfica. Certificação de produtos. Fundamentos do cooperativismo como doutrina. O cooperativismo no Brasil. Criação e administração de uma cooperativa. Legislação cooperativa brasileira. Autogestão e educação cooperativa.","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"CNS7718","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS8013":{"codigo":"CNS8013","nome":"Extensão Rural","ementa":"","carga_horaria":54,"fase_sugestao":9,"equivalencia":"CNS7716","prerequisito":"CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"BSU7101":{"codigo":"BSU7101","nome":"Desenvolvimento Sustentável e Saúde Global","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7134":{"codigo":"CNS7134","nome":"Estágio Obrigatório Supervisionado","ementa":"Elaboração e organização do TCC realizados a partir de atividades de pesquisa e ou extensão. Estas atividades, objeto de estudo do TCC, também poderão ser aquelas realizadas durante o estágio supervisionado.","carga_horaria":198,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":198,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNS8017":{"codigo":"CNS8017","nome":"Atividades Complementares","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ABF5051":{"codigo":"ABF5051","nome":"Nutrição Mineral de Plantas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7001":{"codigo":"ABF7001","nome":"Agricultura Digital","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7004":{"codigo":"ABF7004","nome":"Patologia de Sementes","ementa":"Histórico, definições básicas e importância da Patologia de Sementes. Patógenos associados a sementes de culturas de importância. Pontos de entrada e localização de Patógenos em sementes. Transmissão e Epidemiologia. Testes de sanidade. Métodos de controle. Fungos de armazenamento. Situação atual e perspectivas da Patologia de Sementes. Equipamentos e Instalações. Métodos em Patologia de Sementes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7009":{"codigo":"ABF7009","nome":"Introdução a Etnobotânica","ementa":"Introdução. Desenvolvimento histórico da Etnobotânica, abordagens teóricas. Populações tradicionais e conservação biológica. Estudos etnobotânicos aplicados à conservação da biodiversidade. Métodos de coleta e análise de dados. Legislação sobre a utilização do patrimônio genético. Aspectos éticos associados ao acesso da informação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7206":{"codigo":"ABF7206","nome":"Manejo de Bacias Hidrográficas","ementa":"A floresta e o ciclo hidrológico. Dinâmica da água em solos florestados. Definição e caracterização de \nbacias hidrográficas. Conceito e importância do Manejo de Bacias Hidrográficas. Política e legislação para \nmanejo dos recursos da bacia hidrográfica. Uso racional dos recursos da bacia hidrográfica. Proteção de \nnascentes. Importância e função das matas ciliares. Efeito do reflorestamento, desflorestamento e da \nexploração florestal sobre os recursos hídricos. Controle e produção de água em microbacias hidrográficas \nflorestadas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7107 e ABF7205 e CBA7120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7311":{"codigo":"ABF7311","nome":"Ecologia Florestal","ementa":"Introdução à ecologia florestal: conceitos e importância. Ecologia das diferentes formações florestais naturais e povoamentos florestais. Fatores ambientais e climáticos. Produtividade florestal. Ciclagem de nutrientes.  Biomassa vegetal. Processos biológicos: competição, sucessão vegetal, polinização, dispersão de sementes, ecologia de população e comunidades. Distúrbios antrópicos e ambientais. Relação solo-vegetação. Fragmentação florestal. Ecologia da paisagem.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7209 e CNS7108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7315":{"codigo":"ABF7315","nome":"Restauração Ambiental","ementa":"Diagnóstico da degradação ambiental em ecossistemas naturais, com enfoque para as atividades agropecuárias e florestais. Princípios ecológicos para a restauração: solo, interações ecológicas e sucessão. Práticas de restauração de áreas degradadas. Projeto de Recuperação de Áreas Degradadas - PRAD. Legislação aplicada a recuperação e restauração ambiental.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7118","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7319":{"codigo":"ABF7319","nome":"Sistemas Agroflorestais","ementa":"Histórico e classificação de Sistemas Agroflorestais (SAF). Ecologia dos sistemas agroflorestais. Dinâmica temporal e espacial de SAFs. Implantação e manejo de SAFs. Dimensões sociais e econômicas dos SAFs. Legislação aplicada aos SAFs.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7309","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7328":{"codigo":"ABF7328","nome":"Unidade de Conservação","ementa":"A conservação da diversidade biológica no Brasil e no mundo - Sistema Nacional de Unidades de Conservação (SNUC- Brasil), sistemas de conservação de biodiversidade de outros países do mundo - análise comparativa. Critérios para estabelecimento de áreas protegidas para manejo e conservação de espécies, populações, comunidades e ecossistemas. Estratégias mundiais para proteção de biodiversidade.  Planejamento e Manejo de Unidades de Conservação de Proteção Integral e de Uso Sustentável. Gestão do entorno de unidades e criação de corredores ecológicos. Integração entre UCPI, UCUS e outras áreas protegidas como APP (áreas de proteção permanentes) e RL (reservas legais) com vistas à gestão biorregional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7729":{"codigo":"ABF7729","nome":"Plantas Medicinais, condimentares e aromáticas","ementa":"Origem, histórico, produção in vivo e in vitro de espécies medicinais, aromáticas e condimentares. Importância econômica, social e aspectos de mercado, quimiotaxonomia, classes de metabólitos secundários, vias biossintéticas e ensaios de atividade biológica. Sistemas de cultivo e desenvolvimento de produtos a partir de espécies medicinais, aromáticas e condimentares.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7730":{"codigo":"ABF7730","nome":"Plantas Medicinais, Condimentares e Aromáticas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7803":{"codigo":"ABF7803","nome":"Instalações e  Ambiência Animal","ementa":"Elementos e fatores climáticos que afetam os animais: temperatura do ar, umidade relativa do ar, vento, precipitação pluviométrica, radiação e altitude; Os animais e o ambiente: formas de dissipação e produção de calor; Efeitos do ambiente na produção, reprodução e saúde dos animais; Projeto e dimensionamento de instalações para suínos, bovinos de leite, aves de corte e postura, ovinos e caprinos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7204","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7819":{"codigo":"ABF7819","nome":"Biologia e Ecotoxicologia do Solo","ementa":"Biologia dos principais grupos de invertebrados edáficos em sistemas agrícolas e naturais. Papel da fauna do solo nos serviços do ecossistema e na conservação do solo. Métodos para coleta e monitoramento de fauna do solo. Fundamentos de Ecotoxicologia. Cultivo de organismos-teste em laboratório. Ensaios de Ecotoxicidade na regulamentação e avaliação de risco de agroquímicos e resíduos. Diagnóstico e monitoramento de áreas contaminadas. Normas brasileiras para caracterização Ecotoxicológica de solos e resíduos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7102 e ABF7103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7823":{"codigo":"ABF7823","nome":"Cultivo Protegido","ementa":"Conceitos e Introdução. Materiais, equipamentos e estruturas. Manejo dos materiais, equipamentos e estruturas. Manejo do ambiente de cultivo. Cultivo e manejo em ambiente protegido. Manejo da Fertirrigação. Cultivo hidropônico.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7101 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ABF7824":{"codigo":"ABF7824","nome":"Cultivo Protegido","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7101 e CBA7104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7003":{"codigo":"BSU7003","nome":"Apicultura","ementa":"Contextualização, histórico e conceitos básicos em apicultura e meliponicultura. Biologia e classificação das abelhas. Equipamentos, indumentária e instalações apícolas. Manejo de colmeias e apiários. Alimentação das abelhas. Produtos apícolas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7004":{"codigo":"BSU7004","nome":"Endocanabinologia","ementa":"O Sistema Endocanabinoide: Endocanabinoides e seus receptores. Farmacologia dos endocanabinoides. Papel  fisiológico do sistema endocanabinoide. Os terpenofenóis: fitocanabinoides e fitoterpenos. Uso terapêutico dos fitoterpenofenóis e para fins de produção animal. Interações medicamentosas entre os canabinoides e medicamentos comumente prescritos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7105":{"codigo":"BSU7105","nome":"Comunicação e Relações Interpessoais","ementa":"Comunicação. Relacionamento interpessoal. Intersubjetividade. Uso adequado dos recursos de ação comunicativa na prática profissional. Interpretação e compreensão das diferentes culturas e suas linguagens. Atuação em equipes. Comunicação dialógica entre colegas, chefias e clientes.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7161":{"codigo":"BSU7161","nome":"Nutrição e Alimentação de Ruminantes","ementa":"Importância da Nutrição Animal. Exigências nutricionais de ruminantes. Princípios da formulação de ração e balanceamento de dietas para ruminantes. Planejamento alimentar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7162":{"codigo":"BSU7162","nome":"Nutrição e Alimentação de Monogástricos","ementa":"Exigências nutricionais e programas de alimentação para aves, suínos, cães, gatos e equinos. Noções de manejo nutricional de peixes. Principais alimentos e aditivos para monogástricos. Métodos básicos de formulação de ração. Alimentação natural para cães e gatos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7810":{"codigo":"BSU7810","nome":"Ovinocultura","ementa":"Situação atual da ovinocultura. Raças e produtos ovinos. Sistemas de produção. Aspectos básicos de manejo produtivo e sanitário de ovinos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"BSU7115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"BSU7811":{"codigo":"BSU7811","nome":"Piscicultura","ementa":"Qualidade da água. Fisiologia e morfologia de animais aquáticos. Espécies de interesse econômico para a piscicultura. Sistemas criatórios e instalações. Manejo e sanidade em piscicultura.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7001":{"codigo":"CBA7001","nome":"Sistema Integrado de Produção Agropecuária","ementa":"Caracterização dos sistemas agropastoris, agroflorestais, agrosilvipastoris e lavoura\/pecuária. Critérios para a implantação dos sistemas integrados em áreas agrícolas, pecuárias e florestais. Princípios da interação solo x planta x animal. Fundamentos da ciclagem de nutrientes. Espécies vegetais para múltiplo uso. Integração e regeneração de sistemas. Sistemas consorciados. Planejamento da rotação e sucessão de culturas. Sustentabilidade ambiental e gestão de sistemas integrados.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7120 e CBA7123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7002":{"codigo":"CBA7002","nome":"Fruticultura II","ementa":"Abordagens teórico-práticas sobre aspectos gerais e específicos de culturas frutíferas de importância econômica para o Estado de Santa Catarina e Sul do Brasil, com ênfase a goiaba serrana, kiwizeiro, caquizeiro, abacateiro, maracujazeiro, abacaxizeiro, figueira, pequenos frutos (morango, framboesa, mirtilo, amora) e mirtáceas nativas. Abordagens de produção integrada de frutas e fruticultura de base agroecológica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7003":{"codigo":"CBA7003","nome":"Tecnologia de Aplicação de Defensivos Agrícolas","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7114 e CBA7108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7010":{"codigo":"CBA7010","nome":"Matologia II","ementa":"Controle químico de plantas daninhas. Classificação dos herbicidas. Características físico-químicas de herbicidas. Mecanismo de ação dos herbicidas. Mecanismos de resistência de plantas daninhas à herbicidas. Tecnologia de aplicação de herbicidas. Aulas de Campo.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7113","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7019":{"codigo":"CBA7019","nome":"Manejo intensivo de pastagens","ementa":"Interação clima-solo-planta-animal; técnicas de manejo intensivo e adubação de pastagens; manejo de plantas daninhas, doenças e insetos em pastagens; recuperação e reforma de áreas degradadas; estratégias de suplementação animal em áreas de pastejo; uso de novas tecnologias no manejo de pastagens.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7123","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7745":{"codigo":"CBA7745","nome":"Agricultura e Silvicultura de Precisão","ementa":"Conceitos básicos em agricultura de precisão. Mapeamento de atributos do solo. Mapeamento de atributos das plantas. Mapeamento de produtividade. Condutividade elétrica aparente do solo. Geoestatística básica. Sistemas de aplicação à taxa variável (fertilizantes e produtos fitossanitários). Controle de tráfego de máquinas agrícolas. Classes de manejo diferenciado.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7105 e CBA7109 e CNS7202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CBA7822":{"codigo":"CBA7822","nome":"Microbiologia e Qualidade do Solo","ementa":"Microrganismos do solo. Ecologia microbiana. Influência dos fatores abiótico e bióticos na quantidade, diversidade e atividade de microrganismos do solo. Microbiologia da rizosfera. Microrganismos promotores de crescimento de plantas: Rizobactérias promotoras do crescimento vegetal, Bactérias diazotróficas, Fungos micorrízicos, Microrganismos endofíticos. Biomassa microbiana. Importância dos microrganismos para fertilidade do solo: ciclos biogeoquímicos. Técnicas de avaliação da comunidade microbiana. Qualidade do solo. Biorremediação microbiana.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7000":{"codigo":"CNS7000","nome":"Agricultura Familiar","ementa":"Conceitos de Agricultura Familiar e campesinato; História do campesinato no Brasil, estrutura agrária e evolução da agricultura no Brasil; diversidade social da agricultura familiar; Agricultura familiar, Políticas Públicas e representação política. Multifuncionalidade e pluratividade da agricultura familiar; formas de organização, movimentos sociais e sustentabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7410","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7001":{"codigo":"CNS7001","nome":"Análise de Regressão","ementa":"Introdução à Análise de Regressão. Princípios básicos. Modelos Linear e Não-Linear. Análise de Resíduos. Análise de Variância. Métodos de seleção de Variáveis. Métodos de seleção de modelos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7114 e CNS7416","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7002":{"codigo":"CNS7002","nome":"Tecnologia de Bebidas Fermentadas","ementa":"Fundamentos da tecnologia de bebidas fermentadas. Fermentação alcoólica. Técnicas de processamento de vinhos, cervejas e bebidas destiladas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7104 e CBA7106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7003":{"codigo":"CNS7003","nome":"Cultivo in vitro de Plantas","ementa":"Conteúdos práticos de cultivo in vitro visando a micropropagação de plantas: Equipamentos básicos, organização e biossegurança laboratorial; Elaboração de soluções estoque; Composição de meios de cultura, Técnicas de extração e inoculação dos diferentes tipos de explantes; Indução por diferentes rotas da morfogêsese in vitro; Biologia celular: Indução, manipulação e avaliações citoquímicas e de crescimento de linhagens celulares; Obtenção de sementes sintéticas e de unidades encapsuláveis; Biorreatores de Imersão temporária e Conservação in vitro.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"CBA7111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7005":{"codigo":"CNS7005","nome":"Tópicos Especiais em Agronomia I","ementa":"(Ementa Variável)","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7006":{"codigo":"CNS7006","nome":"Tópicos especiais em Agronomia II","ementa":"(Ementa Variável)","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7007":{"codigo":"CNS7007","nome":"Relações e Interações Humano-Animal: mudança de paradigma e novos desafios","ementa":"Relações humano - animal, natureza e cultura, novos debates acerca da humanidade e animalidade. A humanização dos animais domésticos e selvagens. Ética e animais de consumo humano. Uso religioso de animais.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7008":{"codigo":"CNS7008","nome":"Agricultura Biodinâmica","ementa":"História da agricultura moderna; Filosofia e agricultura: relações entre o ser humano e a natureza; Epistemologia da agricultura biodinâmica: da antroposofia às práticas agrícolas; Rudolf Steiner e a agricultura biodinâmica: a individualidade do organismo agrícola; Astronomia e agricultura; preparados biodinâmicos; compostagem, nutrição do solo e manejo biodinâmico; certificação biodinâmica.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7009":{"codigo":"CNS7009","nome":"Matemática Financeira e Aplicações","ementa":"Fluxo de caixa, juros simples e compostos, séries de pagamentos, amortização. Aplicações financeiras. Educação financeira.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7010":{"codigo":"CNS7010","nome":"Gestão de Impactos Ambientais","ementa":"Introdução aos problemas ambientais globais, nacionais e locais. Impactos ambientais da agricultura, pecuária e silvicultura e possíveis medidas mitigadoras. Licenciamento ambiental de atividades da agricultura, pecuária e silvicultura, e legislação associada. A gestão ambiental em atividades da agricultura, pecuária e silvicultura como \noportunidade de atuação profissional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7412","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7011":{"codigo":"CNS7011","nome":"Sistemas Agroalimentares","ementa":"A agricultura e a era dos alimentos industrializados; Paradigmas alimentares: nutricionismo e alimentação; Sociologia e Antropologia da alimentação; segurança e soberania alimentar; agricultura urbana e alimentação; Imersão à prática de pesquisa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7012":{"codigo":"CNS7012","nome":"Intercâmbio II","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7013":{"codigo":"CNS7013","nome":"Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7015":{"codigo":"CNS7015","nome":"Cultura Brasileira","ementa":"Significados e dinâmicas da Cultura Brasileira. Estudos antropológicos sobre Cultura Brasileira. Conceitos de Cultura Brasileira. Artes no Brasil. Literaturas no período colonial e contemporâneo. Cultura popular e folclore. Comunicação de massa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7022":{"codigo":"CNS7022","nome":"Planejamento Integrado da Propriedade Rural","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3654,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7108":{"codigo":"CNS7108","nome":"Biogeografia","ementa":"Identificação e análise das áreas de distribuição dos seres vivos e interpretação dos fatores ecológicos e históricos do meio em suas inter-relações. Princípios e teorias biogeográficas. Conceito de espécie e processos de especiação. Biogeografia histórica, biogeografia de ilhas e a teoria dos refúgios. Paleobiogeografia. Padrões de distribuição das espécies: territórios biogeográficos, biomas brasileiros e principais formações vegetacionais do sul do Brasil.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"ABF7103 e CNS7102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7615":{"codigo":"CNS7615","nome":"Saneamento Ambiental","ementa":"Conhecimento e conceituação das propriedades físicas, químicas e biológicas dos resíduos; conhecimentos básicos sobre operações e processos unitários; conceituação e tecnologias utilizadas para o tratamento de águas naturais e residuárias; discussão de propostas para controle e disposição de resíduos sólidos; alternativas para reciclagem de resíduos e reuso da água.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"CNS7514","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CNS7720":{"codigo":"CNS7720","nome":"Planejamento Integrado da Propriedade Rural","ementa":"Análise e avaliação da propriedade rural no contexto da segurança alimentar e inserção no mercado. Levantamento utilitário do meio físico e avaliação da capacidade de uso das terras e do(s) sistema(s) de produção da propriedade. Mapeamento temático digital da propriedade rural. Planejamento integrado e conservacionista de uso da propriedade rural. Estimativa dos custos e das receitas e da viabilidade da execução do planejamento. Projeto de uso de uma propriedade agrícola dentro de um enfoque sistêmico e integrado de produção.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9211":{"codigo":"LLE9211","nome":"Língua Espanhola I","ementa":"Introdução aos estudos da língua espanhola. Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender e produzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE9212":{"codigo":"LLE9212","nome":"Língua Espanhola II","ementa":"Compreensão e produção oral e escrita: apresentação e análise dos mais diversos gêneros discursivos orais e escritos que permitam o aluno compreender, produzir e traduzir textos que contemplem situações sociais da vida cotidiana e acadêmica. Informações pertinentes sobre características fonéticas, gramaticais e sociolingüísticas da língua espanhola.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"CNS8014":{"codigo":"CNS8014","nome":"Atividade Ação de Extensão - Cursos","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS8015":{"codigo":"CNS8015","nome":"Atividade Ação de Extensão -  Eventos","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"CNS8016":{"codigo":"CNS8016","nome":"Atividade Ação de Extensão  - Projetos","ementa":"","carga_horaria":18,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"}}}}}