{"codigo":213,"nome":"ENGENHARIA DE PRODUÇÃO ELÉTRICA","sigla_centro":"CTC","sigla_departamento":"EPS","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"19871":19871,"19891":19891,"19911":19911,"20071":20071},"situacao":0,"situacao_descricao":"regular","num_vagas_total":120,"num_vagas_primeiro_semestre":0,"num_vagas_segundo_semestre":0,"presencial":true,"curriculos":{"19871":{"id":"115","codigo":19871,"codigo_curso":213,"carga_horaria_ufsc":4482,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":25,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19871 (EXTINTO)","ucs":[]},"19891":{"id":"254","codigo":19891,"codigo_curso":213,"carga_horaria_ufsc":4482,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":26,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19891 (EXTINTO)","ucs":[]},"19911":{"id":"116","codigo":19911,"codigo_curso":213,"carga_horaria_ufsc":4518,"carga_horaria_mec":3765,"aulas_semana_min":14,"aulas_semana_esperado":26,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19911","ucs":{"EGR5619":{"codigo":"EGR5619","nome":"Desenho Técnico para Engenharia Elétrica","ementa":"Conceito, normalização e classificação do desenho técnico; técnicas fundamentais do traçado a mão livre; técnicas fundamentais do desenho auxiliado por computador (CAD); noções básicas de geometria descritiva; sistemas de representação: perspectivas e vistas ortográficas; desenho técnico: classificação e normas técnicas; técnicas fundamentais do desenho técnico com instrumentos; desenho de projetos industriais; desenho de projetos de engenharia; desenho de diagramas elétricos; noções de desenho civil e arquitetônico; desenho de instalação elétrica residencial.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EGR5622 ou RTS1622 ou RTS5622","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5120":{"codigo":"EPS5120","nome":"Introdução a Engenharia de Produção","ementa":"Diretrizes curriculares. Perfil do profissional. Evolução da engenharia. Desenvolvimento econômico e capacitação C&T. Contextualização da Eng. de Produção. Produção na organização. Fronteiras da Função Produção. Modelo de transformação. Objetivos da produção. Estratégia de produção. Princípios gerais de projeto em produção: projeto de produtos e serviços e projeto de processos. Natureza do planejamento e controle na produção. Noções de Metodologia Científica e de Comunicação Técnica.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EPS1120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5102":{"codigo":"FSC5102","nome":"Física Básica I","ementa":"Introdução aos conceitos fundamentais da cinemática e dinâmica. Leis de conservação da energia e do momento linear. Cinemática e dinâmica da rotação.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"FSC5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5161":{"codigo":"MTM5161","nome":"Cálculo A","ementa":"Funções reais de variável real. Funções elementares. Noções sobre limite e continuidade. A derivada. Aplicações da derivada. Integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM1161","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5223":{"codigo":"MTM5223","nome":"Álgebra Linear e Geometria Analítica","ementa":"Matrizes. Sistemas lineares. Espaço vetorial Rn. Produtos em um espaço vetorial. Estudo da reta e do plano. Transformação linear. Curvas planas. Superfícies.","carga_horaria":108,"fase_sugestao":1,"equivalencia":"MTM5512 e MTM5245","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5106":{"codigo":"QMC5106","nome":"Química Geral","ementa":"Átomos e elétrons; compostos iônicos e covalentes, transformações químicas; gases, líquidos, pressão de vapor; estequiometria; termodinâmica; geometria molecular, momento dipolar, solubilidade; estruturas cristalinas, elétrons nos sólidos; defeitos nos sólidos; soluções, propriedades coligativas; cinética e mecanismo das reações; equilíbrio químico, equilíbrio ácido-base; reações de oxi-redução;eletroquímica, pilhas, acumuladores; corrosão; combustão.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EQA5115","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5234":{"codigo":"EPS5234","nome":"Análise de Sistemas de Produção","ementa":"Conceitos, definições e propriedades de sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; caracterização do sistema, subsistemas e supersistema; caracterização do modelo conceitual; comparação do modelo conceitual com a situação de problema; definição de mudanças possíveis; determinação de ações e melhorias. Teoria de Sistemas aplicada à Engenharia de Produção. Sistemas Organizacionais: marketing, produção, materiais, pessoal, finanças\/controladoria e informática. Abordagem sistêmica para a decisão em sistemas de produção","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EPS5229","prerequisito":"EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7001":{"codigo":"EPS7001","nome":"Informática para Engenharia de Produção","ementa":"Conceitos básicos. Principais aplicativos para engenheiros de Produção. Estrutura de dados. Algoritmos: formulação, representação e noções de complexidade. Linguagem de programação: estrutura, tipos de dados simples e estruturados, instruções de repetição, funções e procedimentos. Noções de orientação a objetos. Fundamentos em Bancos de Dados Relacionais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"INE5201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5103":{"codigo":"FSC5103","nome":"Estática para Engenharia","ementa":"Estudo  das  condições  de  equilíbrio  de  partículas  e  de  corpos  rígidos  (estruturas,  vigas,  treliças  etc)  no  plano  e  no  espaço,  envolvendo  o  cálculo  das  reações  em  conexões  padrão  utilizadas  em  engenharia;  cálculo  de  forças  axiais,  esforços  cortantes  e  momentos  fletores  em  estruturas  e  vigas;  cálculo  de  centróides  de  áreas  e  de  volumes  de  figuras  simples  e  de  figuras  compostas;  cálculo  de  momentos  de  inércia  de  chapas  planas  simples  e  compostas  e  de  sólidos  simples  e  compostos;  equilíbrio  de  cabos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5050","prerequisito":"(FSC5102 e MTM5161) ou (FSC5101 e MTM5161)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5124":{"codigo":"FSC5124","nome":"Física Experimental para Engenharia A","ementa":"Instrumentos  de  medição.  Erros.  Traçado  de  gráficos.  Experimentos  típicos  de  física  básica.  Discussão  dos  experimentos.  Confecção  de  relatórios.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"FSC5122","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5137":{"codigo":"FSC5137","nome":"Ondas e Calor","ementa":"O  oscilador  harmônico,  oscilações  amortecidas  e  forçadas,  ondas,  som,  temperatura;  calor  e  primeira  lei  da  termodinâmica;  propriedades  dos  gases;  a  segunda  lei  da  termodinâmica;  teoria  cinética  dos  gases;  noções  de  mecânica  estatística.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5132","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5162":{"codigo":"MTM5162","nome":"Cálculo B","ementa":"Métodos de integração; aplicações da integral definida; integrais impróprias; funções de várias variáveis; derivadas parciais; aplicações das derivadas parciais; integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM1162","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ5102":{"codigo":"ECZ5102","nome":"Conservação de Recursos Naturais","ementa":"Estrutura, funcionamento e dinâmica de ecossistemas. Efeito da ação antrópica sobre os ecossistemas. Legislação e Conservação dos recursos naturais.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"BLG1140 ou BLG5303 ou ECZ5112","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5133":{"codigo":"FSC5133","nome":"Física Teórica B","ementa":"Carga elétrica. Campo elétrico. Lei de Gauss. Potencial. Capacitores. Corrente elétrica. Força eletromotriz e circuitos. Campo magnético. Lei de Ampére. Lei de Faraday. Indutância. Propriedades magnéticas da matéria. Óptica física: Interferência, difração, polarização. Física quântica. Ondas e partículas.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"FSC1133","prerequisito":"FSC5101 e MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5202":{"codigo":"INE5202","nome":"Cálculo Numérico em Computadores","ementa":"Erros e Sistemas de Numeracão. Solução de equações algébricas e transcendentais. Solução de equações polinomiais. Sistemas de equações lineares e não lineares. Interpolação Ajustamento de curvas. Integração numérica. Solução numérica de equações diferenciais ordinárias e sistemas de equações diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"(CEC1103 ou CEC5202 e INE5232) ou EPS7001","prerequisito":"EPS7001 e MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5163":{"codigo":"MTM5163","nome":"Cálculo C","ementa":"Noções de cálculo vetorial; integrais curvilíneas e de  superfície; teorema de Stokes;  teorema  de  divergência  de \nGauss; equações diferenciais de 1ª ordem; equações diferenciais   lineares de ordem n; noções sobre transformada de Laplace.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"MTM1163","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7041":{"codigo":"EEL7041","nome":"Eletromagnetismo","ementa":"1. Revisão Matemática: o operador nabla; gradiente; divergente e rotacional; teorema da divergência e teorema de Stokes; operadores de segunda ordem; e exemplos. \n2. O Eletromagnetismo a partir das equações de Maxwell: as grandezas eletromagnéticas, as equações de Maxwell sob a forma local e sob a forma integral; o eletromagnetismo em baixas frequências (quase-estática); e exemplos. \n3. A Eletrostática: campo elétrico; teorema de Gauss; potencial elétrico; força eletromotriz; refração de campos elétricos; rigidez dielétrica; capacitância; e exemplos. \n4. A Magnetostática: lei de Ampère; lei de Biot-Savart; refração de campos magnéticos; materiais magnéticos: diamagnetismo, paramagnetismo, ferromagnetismo, e ímãs permanentes; circuitos magnéticos; indutâncias; e exemplos. \n5. A Magnetodinâmica: lei de Faraday; lei de Lenz; blindagem magnética; penetração de campos magnéticos em condutores; perdas no cobre e no ferro; e exemplos. \n6. Interação entre grandezas eletromagnéticas e mecânicas: lei de Laplace; lei de Lorentz; força pela variação de energia; vetor de Poynting; tensor de Maxwell; e exemplos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EEL5132","prerequisito":"FSC5137 e MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7045":{"codigo":"EEL7045","nome":"Circuitos Elétricos A","ementa":"Conceitos básicos: carga, corrente, tensão, potência, energia, elementos de circuito. Leis básicas (Ohm, Kirchhoff). Circuitos de corrente contínua: divisor de tensão e de corrente; métodos de análise (nodal e de malhas); teoremas de circuitos (linearidade, superposição, transformação de fontes, Thévenin, Norton, máxima transferência de potência). Capacitores e indutores. Circuitos de primeira ordem. Circuitos de segunda ordem. Circuitos de corrente alternada: senóides e fasores, relação fasorial para elementos de circuito, impedância e admitância; análise senoidal em regime permanente; resposta em frequência (ressonância e filtros); potência (valor eficaz, potências instantânea, ativa, reativa e aparente, fator de potência, máxima transferência de potência). Atividades de laboratório.","carga_horaria":108,"fase_sugestao":4,"equivalencia":"EEL7040","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7005":{"codigo":"EPS7005","nome":"Pesquisa Operacional","ementa":"Introdução: histórico, objetivos, restrições e modelos. Condições de otimalidade. Programação linear: modelos de programação linear, método simplex, dualidade, análise de sensibilidade e pós-otimalidade. Problemas lineares especiais.Programação não-linear; otimização multivariada; otimização sem restrições. Programação Inteira, Binária e Mista: algoritmos e modelos. Programação Dinâmica determinística e estocástica.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EPS5113","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5207":{"codigo":"FSC5207","nome":"Mecânica II - Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Dinâmica da partícula e do corpo rígido.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"FSC1207","prerequisito":"FSC5103 e FSC5137 e MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5164":{"codigo":"MTM5164","nome":"Calculo D","ementa":"Números Complexos; séries numéricas;  séries de funções, equações diferenciais parciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"MTM1164","prerequisito":"MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7051":{"codigo":"EEL7051","nome":"Materiais Elétricos","ementa":"Propriedades gerais dos materiais; classificação; materiais condutores; materiais semicondutores; materiais isolantes; materiais magnéticos, aplicações.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EEL5127","prerequisito":"EEL7041 e QMC5106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7055":{"codigo":"EEL7055","nome":"Circuitos Elétricos B","ementa":"Potência complexa. Correção do fator de potência. Circuitos trifásicos: tensões balanceadas, tipos de ligações, potência em sistemas balanceados, sistemas desbalanceados, componentes simétricas. Análise de circuitos com a integral de convolução. Circuitos acoplados magneticamente: indutância (própria e mútua), energia, transformadores. Quadripolos: parâmetros de impedância, admitância, híbridos e de transmissão, conexão de quadripolos. Laboratório.","carga_horaria":108,"fase_sugestao":5,"equivalencia":"EEL7050","prerequisito":"(EEL7045 e MTM5164) ou (EEL7040 e MTM5164)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5125":{"codigo":"EMC5125","nome":"Mecanica dos Solidos I","ementa":"Solicitações internas. Reações. Diagramas. Tensões e deformações. Estados de tensão. Lei de Hooke. Trabalho de deformação. Solicitações axiais. Flexão simples. Cisalhamento em vigas longas. Torção. Solicitações compostas. Análise de tensões em um ponto. Teorias de colapso.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC1125 ou EMC5128","prerequisito":"(FSC5103 e MTM5245) ou MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5425":{"codigo":"EMC5425","nome":"Fenômenos de Transportes","ementa":"Conceitos fundamentais em mecânica dos fluidos; dimensões e unidades; campos escalar, vetorial e tensorial; viscosidade. Hidrostática; pressão em fluido estático, manômetros; forças sobre superfícies planas e curvas submersas. Análise de escoamento; leis básicas para sistemas e volumes de controle;  conservação da massa; equação da quantidade de movimento linear; primeira lei da termodinâmica; equação de Bernoulli. Escoamento viscoso incompressível; escoamento em tubos;  diagrama de  Moody; perdas de carga distribuidas e localizadas. Conceitos fundamentais em transmissão de calor;  dimensões e unidades; leis básicas  da transmissão de calor; condução, convecção e radiação; mecanismos combinados de transmissão de calor. Condução unidimensional em regime permanente; espessura crítica de isolamento; aletas; estruturas compostas. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC1425","prerequisito":"FSC5137 e MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5231":{"codigo":"EPS5231","nome":"Gerência Industrial I","ementa":"Introdução à contabilidade. Noções preliminares. A contabilidade como sistema de controle e informações. Procedimentos contábeis básicos. Variação patrimonial. Balanço e demonstrativo de lucros e perdas. Análise econômica financeira. Introdução à finanças de empresas. Funções do mercado financeiro. Significado e objetivos das finanças da empresa. Administração financeira do ativo, passivo e patrimônio líquido.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS1231 ou EPS7010","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1400,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7002":{"codigo":"EPS7002","nome":"Probabilidade e Modelos Estocásticos","ementa":"Probabilidade: definições, variáveis aleatórias discretas e contínuas; distribuições conjuntas, marginais e condicionais; funções de distribuições de probabilidades: normal, qui-quadrado, exponencial, binominal e Poisson. Processos Estocásticos: definições, cadeias de Markov e matriz de transição. Teoria das filas: sistemas M\/M\/1, M\/M\/c e M\/M\/ck. Simulação: geração de números pseudo-aleatórios, formulação de modelos de simulação; validação do modelo; linguagens de simulação. Noções de confiabilidade de sistemas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EPS5117 e INE5115","prerequisito":"MTM5162 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7053":{"codigo":"EEL7053","nome":"Ondas  Eletromagnéticas","ementa":"Equações de Maxwell; ondas planas uniformes (OPU): propagação das OPU num meio qualquer, potência associada à OPU - o vetor de Poynting, propagação das OPU em meios sem perda, propagação das OPU em bons condutores, reflexão de ondas, polarização de ondas. Linhas de transmissão (LT): equações e parâmetros básicos, forma hiperbólica das equações de LT, reflexão e casamento de impedâncias, tipos e parâmetros das LT. Guias de onda e cavidades ressonantes. Antenas: (definição, parâmetros principais, tipos e aplicações, cálculo de radioenlaces).","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EEL5144","prerequisito":"EEL7041 e FSC5133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7061":{"codigo":"EEL7061","nome":"Eletrônica I","ementa":"Introdução à eletrônica; amplificadores operacionais; diodos; o transistor de junção bipolar; transistores de efeito de  \ncampo; componentes optoeletrônicos.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"EEL5341 ou EEL5342 ou EEL5346","prerequisito":"EEL7050 e EEL7051","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7064":{"codigo":"EEL7064","nome":"Conversão Eletromecânica de Energia A","ementa":"Introdução e princípios de máquinas elétricas; transformadores: tipos, ensaios, circuito equivalente, regulação e rendimento, paralelismo de transformadores, transformador de corrente e Potencial, autotransformador, campo girante, máquinas síncronas: geradores síncronos, motores síncronos, teoria de máquinas síncronas de polos lisos e salientes; ensaios, circuitos equivalentes, controle da energia ativa e reativa, triângulo de Potier, diagrama de capabilidade, Tipos de excitação, enrolamento compensador, sincronismo, compensador síncrono, refrigeração, laboratório.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EEL5152 e EEL7073","prerequisito":"EEL7040","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5232":{"codigo":"EPS5232","nome":"Gerência Industrial II","ementa":"Introdução à contabilidade de custos e aos conceitos de custos. O ciclo da contabilidade de custo. Custo de matéria-prima. Custo de mão-de-obra. Custos indiretos de produção. Sistemas de custos por ordens de produção. Sistemas de custos por processo. Custos conjuntos e de sub-produto. Custos direto. Análise da relação entre custos, volume e lucro. Custo para a tomada de decisões.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS1232 ou EPS7018","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7003":{"codigo":"EPS7003","nome":"Estatística e Modelos de Previsão","ementa":"Estatística: planejamento de pesquisa e levantamento de dados, amostragem, análise de dados, análise de correlação e regressão, estimação de parâmetros, testes de hipóteses paramétricos e não paramétricos. Previsão: médias móveis e decomposição de séries, Holt-Winters e outros métodos determinísticos. Regressão simples e múltipla. Modelos ARIMA.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS7000 ou INE5104","prerequisito":"EPS7002 ou INE5115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5105":{"codigo":"EEL5105","nome":"Circuitos e Técnicas Digitais","ementa":"Sistemas de numeração e códigos numéricos. Álgebra Booleana. Funções e portas lógicas. Portas lógicas CMOS. Síntese e otimização de circuitos lógicos. Circuitos combinacionais. Circuitos sequenciais. Máquinas de estados finitos. Relógio e temporização. Modelo bloco operativo\/bloco de controle. Introdução às linguagens de descrição de hardware (HDL). Dispositivos lógicos programáveis.","carga_horaria":90,"fase_sugestao":8,"equivalencia":"EEL7020","prerequisito":"EEL7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7052":{"codigo":"EEL7052","nome":"Sistemas Lineares","ementa":"Sinais e sistemas contínuos; sistemas lineares contínuos e invariantes no tempo; Série de Fourier; Transformada de Fourier; Transformada de Laplace; funções de transferência e representação por diagrama em blocos; resposta em frequência de sistemas lineares e invariantes no tempo; sistemas amostrados e Transformada Z.","carga_horaria":90,"fase_sugestao":7,"equivalencia":"","prerequisito":"MTM5164 e MTM5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7071":{"codigo":"EEL7071","nome":"Introdução a Sistemas de Energia Elétrica","ementa":"Organização da indústria de energia elétrica; modelagem dos elementos e representação dos sistemas elétricos; análise de fluxo de potência; análise de curto-circuito.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EEL5161","prerequisito":"EEL7053 e EEL7064 e INE5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7072":{"codigo":"EEL7072","nome":"Projeto de Instalações Elétricas","ementa":"Normas; sistemas de alimentação e configuração de redes BT e AT; planejamento e projeto de uma instalação; cargas típicas; componentes de uma instalação; pontos de iluminação e tomadas; potência instalada; fator de demanda; fator de carga; diagrama unifilar; dimensionamentos dos condutores; dimensionamento da proteção; projeto residencial e predial; pára-raios; projeto telefônico; interfones; antenas, alarmes; luminotécnica; projeto de iluminação de interiores; iluminação de emergência; instalações elétricas industriais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EEL5155","prerequisito":"EEL7051 e EEL7064","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7073":{"codigo":"EEL7073","nome":"Conversão Eletromecânica de Energia B","ementa":"Motores de indução: ensaios, circuito equivalente, potência e torque em motores trifásicos, métodos de partida do motor trifásico, Motores monofásico e bifásico; máquinas de corrente contínua: máquinas elementares, máquinas reais, tensão gerada e torque, fluxo de potência e perdas, geradores corrente contínua, motores corrente contínua; máquinas especiais: motor universal, outros tipos de motores especiais, laboratório.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EEL7064","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5222":{"codigo":"EPS5222","nome":"Modelos Econômicos Quantitativos","ementa":"Mercado: oferta e demanda. Formação da demanda: demanda individual e do mercado. Produção: tecnologia, insumos, produtividade e custos; maximização de lucros. Tipos de mercados: monopólio, monopsônio, concorrência perfeita, oligopólios. Estruturas de mercados e formação de preços. Teoria dos jogos e estratégia competitiva. Mercado para fatores de produção. Externalidades e bens públicos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS1221 ou EPS1222","prerequisito":"MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5225":{"codigo":"EPS5225","nome":"Ergonomia e Segurança Industrial","ementa":"Conceitos. Sistemas homem-máquina. Posto de trabalho. Atividade muscular.  Antropometria. Postura de trabalho. Ambiente térmico. Audição. Visão. Vibração. Atividade mental. Acidentes de trabalho: conceitos, causas e custos. Métodos de prevenção individual e coletiva. Aspectos legais.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS1213 ou EPS1225 ou EPS7020","prerequisito":"EPS7003 ou INE5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5317":{"codigo":"DAS5317","nome":"Sistemas de Controle","ementa":"Teórica: Apresentação e definição do problema de controle de sistemas; análise de sistemas de controle contínuos e discretos em regime permanente: precisão e sensibilidade; estabilidade de sistemas de controle contínuos e discretos: métodos de Routh-Hurwitz, Jury, Nyquist e Bode; estruturas básicas de controladores; projeto de controladores contínuos e discretos: método de Ziegler-Nichols, projeto usando o lugar das raízes, projeto usando métodos frequências. Exemplos de aplicações. \nLaboratório: Análise de sistemas contínuos e discretos. Resposta de sistemas, precisão e sensibilidade. Análise de estabilidade. Projeto de controladores usando lugares das raízes. Projeto de controladores usando métodos frequenciais. Sintonia de controladores PID usando Ziegler-Nichols. Projeto de controladores: casos contínuos e discretos.","carga_horaria":108,"fase_sugestao":8,"equivalencia":"EEL7063","prerequisito":"EEL7052","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5223":{"codigo":"EPS5223","nome":"Economia da Engenharia","ementa":"Noções de matemática financeira. Juros simples e compostos. Taxas. Métodos de análise de investimentos. Fluxo de caixa. Investimento inicial, capital de giro, receitas e despesas. Efeitos da depreciação sobre rendas tributáveis. Influência do financiamento e amortização. Incerteza e risco em projetos. Análise de viabilidade de fluxo de caixa final. Análise e sensibilidade. Substituição de equipamentos. Lessing. Correção monetária.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1210 ou EPS1223 ou EPS7019","prerequisito":"EPS5222 e EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5227":{"codigo":"EPS5227","nome":"Planejamento Industrial","ementa":"Noções de planejamento empresarial. Etapas de um empreendimento industrial. Metodologia para elaboração dos ante-projetos. Estudos de mercado. Estudos de localização. Análise de tecnologias e fatores de produção. Caracterização do processo produtivo. Estudo do tamanho. Determinação do investimento. Projeção de receitas e custos. Análise de retorno do investimento.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1217 ou EPS1227","prerequisito":"EPS5222 e EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5235":{"codigo":"EPS5235","nome":"Planejamento e Controle da Produção","ementa":"Visão geral dos sistemas de produção. Planejamento estratégico da produção. Planejamento mestre da produção. Programação da produção: administração de estoques, seqüenciamento,emissão e liberação de ordens. Acompanhamento da produção.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1201 ou EPS1235 ou EPS5201","prerequisito":"EPS5117 ou (EPS7002 e EPS7005)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5238":{"codigo":"EPS5238","nome":"Estudos de Tempos e Métodos","ementa":"Introdução e objetivos. Processo de projeto. Projeto de método (Estudo de Movimento): técnicas de registro e análise, economia de movimentos. Técnicas de medida do trabalho: estudo de tempos, amostragem do trabalho, tempos pré-determinados, avaliação ritmo. Tempo padrão.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS1205 ou EPS1238 ou EPS5205 ou EPS7022","prerequisito":"EPS5225","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5311":{"codigo":"EPS5311","nome":"Projeto de Produto I","ementa":"Os ciclos dos produtos: conceitos e objetivos. Concepção do produto. Desenvolvimento do produto: análise do valor, método morfológico e método experimental. Projeto de fabricação. Comercialização do produto. Vida de mercado. Tópicos complementares.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EPS1311 ou EPS5201 ou EPS5312 ou EPS7021","prerequisito":"EPS5225","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7040":{"codigo":"EPS7040","nome":"Estágio Supervisionado em Engenharia de Produção","ementa":"","carga_horaria":450,"fase_sugestao":9,"equivalencia":"EPS7016","prerequisito":"EPS5227 e EPS5230 e EPS5238 e EPS5311 e EPS5312","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3220,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7030":{"codigo":"EEL7030","nome":"Microprocessadores","ementa":"Arquiteturas de microprocessadores; programação de microprocessadores: tipo e formatos de instruções, modos de endereçamento; linguagens Assembly ou C; memória; entrada\/saída; dispositivos periféricos; interrupção; acesso direto a memória; barramentos padrões; ferramentas para análise, desenvolvimento e depuração; projetos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL5314","prerequisito":"EEL7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7062":{"codigo":"EEL7062","nome":"Princípios de Sistemas de Comunicação","ementa":"Análise e transmissão de sinais; modulações analógicas em amplitude e em frequência; multiplexação; ruído em sistemas de comunicação; modulação por pulso; conversão analógico-digital; transmissão digital em banda base e em banda passante.","carga_horaria":90,"fase_sugestao":10,"equivalencia":"EEL1167 ou EEL5167","prerequisito":"EEL5166 e EEL7052 e EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7100":{"codigo":"EEL7100","nome":"Operação de Sistemas de Energia Elétrica","ementa":"Estrutura e tipos de estudos de operação de Sistemas Elétricos de Potência; Despacho Econômico de unidades térmicas; consideração de perdas de transmissão; Alocação Ótima de Unidades Geradoras; Fluxo de Potência Ótimo; Despacho Hidrotérmico; Geração renovável não tradicional: geração eólica e fotovoltaica; Controle de Geração e operação interligada; Modelagem em tempo real de sistemas de energia elétrica","carga_horaria":72,"fase_sugestao":10,"equivalencia":"EEL5162","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7303":{"codigo":"EEL7303","nome":"Circuitos Eletrônicos Analógicos","ementa":"Amplificadores multi-estágios; ruído em circuitos analógicos; amplificadores diferenciais; espelhos de corrente;  \nestágios de saída e amplificadores de potência; resposta em frequência de amplificadores; referências de  \ncorrente e tensão; circuitos com amplificadores operacionais; circuitos realimentados; osciladores.","carga_horaria":90,"fase_sugestao":10,"equivalencia":"EEL5342","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5230":{"codigo":"EPS5230","nome":"Garantia de Qualidade","ementa":"O conceito de qualidade total. Os ambientes, o planejamento e gestão da qualidade. O modelo de qualidade in-line. A qualidade off-line. O modelo de qualidade on-line. Qualidade total em produtos e serviços. A ênfase do cliente na estrutura da qualidade total. Planejamento da qualidade total. Gestão da qualidade total. Estratégias e ferramentas para a implantação da qualidade. Ferramentas e estratégias para a implantação da qualidade total. Estratégias para a qualidade in-line. Estratégias para a qualidade on-line. Avaliação da qualidade.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS1224 ou EPS1230 ou EPS7023","prerequisito":"EPS5235 e EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5237":{"codigo":"EPS5237","nome":"Projeto de Fabrica","ementa":"Objetivos do estudo e metodologia de elaboração. Especificações de processos. Arranjo físico. Instalações na indústria. Edificações industriais.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS1237 ou EPS7025","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5312":{"codigo":"EPS5312","nome":"Projeto de Produto II","ementa":"Desenvolvimento de um projeto de produto com a construção modelo em laboratório e respectivo projeto de fabricação.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"EPS1312 ou EPS5311 e EPS7021","prerequisito":"EPS5311","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7004":{"codigo":"EPS7004","nome":"Logística Empresarial","ementa":"O ambiente de negócios. Conceito e evolução da logística. Cadeia de suprimentos (supply chain). O sistema logístico. Custos logísticos. Nível de serviço ao cliente. A logística de suprimento. A distribuição física de produtos. O subsistema transporte: os modais de transporte; característica e escolha do modal; os processos coleta-transferência e distribuição. O subsistema armazém: funções e meios de armazenagem; unitização de cargas; sistemas de endereçamento dos produtos. O gerenciamento de estoques: classificação ABC, sistemática de re-suprimento.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"EPS5236 ou EPS7026","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT0001":{"codigo":"ZZT0001","nome":"Optativa I","ementa":"","carga_horaria":54,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ARQ5212":{"codigo":"ARQ5212","nome":"Arquitetura e Sociedade","ementa":"Cultura urbana. Classes sociais, movimentos-sócio-políticos e arquitetura.. Nascimento e crescimento das cidades. Problemática da organização dos indivíduos: a família, os grupos, as associações atuação e as comunidades. Os espaços coletivos: análise e avaliação crítica. A inadequação da cidade contemporânea frente aos indivíduos: crianças, adultos, velhos, inválidos, etc.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD5305":{"codigo":"CAD5305","nome":"Mercadologia","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"CAD7232":{"codigo":"CAD7232","nome":"Estratégia Mercadológica","ementa":"Segmentação e posicionamento de Mercado; Sistema de Informação de Marketing; Tipologias e ferramentas de estratégias de marketing; O marketing de relacionamento e de serviço; Posturas estratégicas de marketing: de preço, de praça, de promoção e de produto. Planejamento e plano de marketing; Metodologias para a elaboração do plano de marketing; Tópicos emergentes de marketing: esportivo, social, marketing internacional, E-Marketing, e, universitário.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5156":{"codigo":"EEL5156","nome":"Projetos de Instalações Elétricas Industriais","ementa":"Introdução. Instalação e proteção de motores elétricos industriais em AT e BT. Quadros e subestações industriais. Correção do fator de potência. Geração própria. Controle da demanda e faturamento. Cargas especiais (forno, Eletroternia, Solda elétrica, Raio X. Tração elétrica, etc.). Projeto elétrico industrial. Instalações em corrente contínua. Projeto iluminação externa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1156 ou EEL1230","prerequisito":"EEL7072","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5166":{"codigo":"EEL5166","nome":"Sinais e Sistemas","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1166","prerequisito":"EEL5143","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5168":{"codigo":"EEL5168","nome":"Sistemas Amostrados","ementa":"Discretização. Amostragem. Teorema de Schannon. Transformada em Z. F. T. Amostrada. Precisão. Estabilidade. Compensação (Zdan, critérios temporais). Controladores de estrutura fixa para uso industrial (PID, outros). Laboratório: 36 horas - Experiências sobre discretização, análise e projetos de sistemas amostrados. Experiências sobre teoria moderna de controle.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1168 ou EEL7063","prerequisito":"DAS5317 ou EEL7063","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5169":{"codigo":"EEL5169","nome":"Controle por Realimentação de Estado","ementa":"Representação por equação de estado. Realização de função de transferência. Soluções de equações de estado. Autovalores e autovetores. Formas canônicas. Controlabilidade. Posicionamento de pólos por realimentação de estados. Observadores. Análise e projeto de sistemas amostrados por variáveis de estado. Laboratório: 36 horas - Análise e projeto usando teoria moderna de controle.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1169","prerequisito":"DAS5317 ou EEL7063","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5170":{"codigo":"EEL5170","nome":"Int. ao Est. do Merc. de En. El.","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1170 ou EEL1240 ou EEL5180","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5171":{"codigo":"EEL5171","nome":"Centrais Hidroelétricas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1171","prerequisito":"EEL5170 e EMC5425","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5172":{"codigo":"EEL5172","nome":"Centrais Termoelétricas","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1172","prerequisito":"EEL5170 e EMC5425","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5173":{"codigo":"EEL5173","nome":"Aterramento de Sistemas Elétricos","ementa":"Introdução. Estratificação do solo. Dimensionamento de sistemas de aterramento por hastes verticais. Potenciais em sistemas de aterramento. Dimensionamento de malhas de terra. Tratamento químico do solo. Corrosão em sistemas de aterramento. Análise de sistemas de aterramento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1173","prerequisito":"EEL7072","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5174":{"codigo":"EEL5174","nome":"Confiabilidade em Sistemas Elétricos","ementa":"Introdução a confiabilidade. Confiabilidade estrutural. Confiabilidade da Geração. Confiabilidade da transmissão. Confiabilidade da distribuição. Tratamento estatístico de ocorrências de falha.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1174","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5175":{"codigo":"EEL5175","nome":"Planejamento da Expansão de Sistemas de Energia Elétrica","ementa":"Conceituação básica. O contexto do planejamento. Estrutura e funcionamento dos sistemas de energia elétrica do Brasil. O processo do planejamento da expansão. Planejamento da expansão do sistema de geração. Aspectos gerais. Avaliação econômica de alternativas de expansão. Conceitos básicos. Metodologia de planejamento da geração. Planejamento da expansão de sistemas de transmissão: aspectos gerais. Metodologia de planejamento de sistemas de transmissão.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1175","prerequisito":"EEL5170 e EEL7100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5176":{"codigo":"EEL5176","nome":"Sobretensões em Sistemas Elétricos","ementa":"Introdução. Transitórios de chaveamento. Ferro-ressonância. Ondas viajantes em L.T. Sobretensões atmosféricas. Sobretensões de manobras e sobretensões sustentadas. NBI, Normas. Métodos de determinação das sobretensões. Proteção de equipamentos contra sobretensão. Coordenação do isolamento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1176","prerequisito":"EEL5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5180":{"codigo":"EEL5180","nome":"Introdução a Utilização de Energia Elétrica","ementa":"Caracterização do Mercado de Energia Elétrica. Caracterização da produção e do consumo de energia elétrica. Noções de planejamento da produção. Comercialização da energia elétrica. Análise econômica de alternativas de suprimento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1170 ou EEL1240 ou EEL5170","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5238":{"codigo":"EEL5238","nome":"Transmissão de Energia Elétrica","ementa":"Transmissão de energia elétrica. O estado da arte. Histórico. Perspectivas. Características mecânicas e elétricas. Cabos. Isoladores. Ferragens. Estruturas. Transmissão em C.A. Potência transmitida. Perdas. Transitórios. Efeitos especiais. Limite térmico. Transmissão em C.C. Linhas de transmissão de potência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1238 ou EEL1239","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5255":{"codigo":"EEL5255","nome":"Aspectos Construtivos de Maquinas Elétricas","ementa":"Construção, montagem, ensaios de recebimento, instalação e operação de transformadores, máquinas síncronas e máquinas de indução. Análise de projetos. (Visitas a indústrias de máquinas elétricas).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1255","prerequisito":"EEL5152","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5256":{"codigo":"EEL5256","nome":"Dinâmica de Maquinas Elétricas","ementa":"Equações de tensão e torque de máquina elétrica básica. Dinâmica das máquinas de corrente contínua. Teoria de eixos de referência. Dinâmica das máquinas de indução. Dinâmica das máquinas síncronas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1256","prerequisito":"EEL5152","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5257":{"codigo":"EEL5257","nome":"Proteção de Sistemas Elétricos de Potencia","ementa":"Introdução, proteção de linhas de transmissão com relés de sobre-corrente. Proteção direcional de sistemas em anel. Relés de distância. Proteção diferencial de transformadores e barramentos. Proteção de geradores. Teleproteção.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1242 ou EEL1257","prerequisito":"EEL7100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5258":{"codigo":"EEL5258","nome":"Controle e Estabilidade de Sistemas de Potencia","ementa":"Estabilidade. Definição. Estabilidade transitória e dinâmica. Modelos da máquina síncrona. Estudo de estabilidade em sistemas multimáquinas. Uso de reguladores. Controle de velocidade e excitação. Controle carga-frequência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1258","prerequisito":"EEL7100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5259":{"codigo":"EEL5259","nome":"Distribuição de Energia Elétrica","ementa":"Características básicas de um sistema de distribuição. Projeto de Redes de Distribuição. Estudos elétricos. Proteção. Materiais utilizados. Normas. Aspectos econômicos. Eletrificação rural. Responsabilidade técnica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1259","prerequisito":"EEL5170","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5316":{"codigo":"EEL5316","nome":"Noções de Informática Industrial","ementa":"Sistemas operacionais. Linguagens de programação. Noções de programação concorrente: escalonamento. Mecanismos de comunicação. Noções de redes de computadores e sistemas distribuídos: arquitetura. Protocolo de comunicação. Métodos de concepção de software: noções de engenharia de software. Rede de Petri. Laboratório: 36 horas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1316","prerequisito":"EEL7040","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5343":{"codigo":"EEL5343","nome":"Eletrônica C","ementa":"Modelos grandes sinais do diodo, JFET, MOSFET e BJT. Amplificadores de potência: classe de operação, saída push-pull, projeto de dissipadores, aplicações. Circuitos de chaveamento: multivibradores monoestáveis, biestáveis e estáveis. Comparadores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1343","prerequisito":"EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5344":{"codigo":"EEL5344","nome":"Eletrônica D","ementa":"Famílias lógicas de circuitos digitais. Tipos de memória, memórias estáticas e dinâmicas, CCD, PLA's e 'gate arrays'.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL1344","prerequisito":"EEL5343","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5345":{"codigo":"EEL5345","nome":"Eletrônica E","ementa":"Componentes de circuitos integrados; R, C, diodos, JFET, MOSFET, BJT. Circuitos integrados lineares básicos: amplificadores, cargas ativas, espelhos de corrente. Amplificadores operacionais integrados. Aplicações de circuitos integrados lineares. Tecnologias de circuitos integrados e fundamentos de lay out.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1345","prerequisito":"EEL5342","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5348":{"codigo":"EEL5348","nome":"Eletrônica de Potência II e Princípios de Acionamento Elétrico","ementa":"Componentes (transistores de potência, MOSFET, IGBT, GTO, etc.) Conversores CC-CC (Buck, Boost, Buck-Boost) para 1 e 2 quadrantes. Conversores CC-CA (Inversores Autônomos). Princípios básicos de fontes chaveadas. Princípios básicos de acionamento eletrônico  de máquinas de corrente contínua e alternada. Laboratório: 36 horas","carga_horaria":90,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5350":{"codigo":"EEL5350","nome":"Eletrônica Modular","ementa":"Amplificador de instrumentação. Comparador Analógico. Amostrador\/Redentor (S\/H). Conversor D\/A. Conversor A\/D. Temporizadores - osciladores (relógios). Fontes reguladas - Reguladores Integrados. Laboratório: 18 horas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1350","prerequisito":"EEL5342","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5611":{"codigo":"EEL5611","nome":"Tópicos Especiais em Sistema de Energia I","ementa":"Estrutura e componentes dos sistemas de energia elétrica, organização do Setor Elétrico, legislação básica, agente setoriais, efeitos da competição. Métodos para análise energético-econômica de sistemas de energia elétrica: conceitos de microeconomia, análise de investimentos, conceitos de otimização e simulação, teoria da decisão, dinâmica de sistemas. Demanda de Energia Elétrica: curva cronológica, de duração de carga e demanda - energia, fatores, previsão de mercado, métodos econométricos, técnicas de cenários, dinâmica de sistemas. Oferta de Energia Elétrica: principais tecnologias, princípios de funcionamento de centrais elétricas, principais parâmetros técnicos, planejamento de sistemas de geração, custos de produção, dimensionamento das fontes de geração, valor dos benefícios energéticos, simulação de sistemas hidrotérmicos, aplicação de dinâmica de sistemas. Comercialização da energia elétrica: princípios de tarifação, estrutura tarifária, tarifação com base em custos contábeis e marginais, tarifas de suprimento, fornecimento e transporte (pedágio), autoprodução, co-geração e produção independente de energia; financiamento de projetos de geração, modelo econômico-financeiro baseado em dinâmica de sistemas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1611","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5612":{"codigo":"EEL5612","nome":"Tópicos Especiais em Sistema de Energia II","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1612","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5613":{"codigo":"EEL5613","nome":"Tópicos Especiais em Sistema de Energia III","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1613","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5621":{"codigo":"EEL5621","nome":"Tópicos Especiais em Sistema de Informação I","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1621","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5622":{"codigo":"EEL5622","nome":"Tópicos Especiais em Sistema de Informação II","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1622","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5623":{"codigo":"EEL5623","nome":"Tópicos Especiais em Sistema de Informação III","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1623","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7074":{"codigo":"EEL7074","nome":"Eletrônica de Potencia I","ementa":"Revisão da teoria de potência elétrica e qualidade de energia em sistemas de corrente alternada. Semicondutores de potência (diodos, tiristores e transistores de potência): características estáticas e dinâmicas, cálculo térmico; retificadores a diodo; retificadores a tiristor e inversores não-autônomos; estudo da comutação; princípios de conversores duais; princípios de cicloconversores; princípios os de gradadores; Ábaco de Puschlowski; princípios de conversores CC-CC comutados em alta frequência; princípios de inversores comutados em alta frequência.","carga_horaria":90,"fase_sugestao":999,"equivalencia":"EEL7070","prerequisito":"EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5673":{"codigo":"EGR5673","nome":"Introdução ao CAD","ementa":"Introdução ao CAD, manipulação de arquivo, tela de trabalho, comandos de construção, visualização, edição, textos, biblioteca de símbolos, escalas-contagem, espessura de traçados, impressão. Noções de construção em 3D. Elaboração de desenhos eletromecânicos e diagramas elétricos.41","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EGR5619","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5115":{"codigo":"EPS5115","nome":"Pesquisa Operacional III","ementa":"Familiarização com conceitos e técnicas de teoria de grafos: definições básicas; árvores; problemas de cobertura e partição de conjuntos; problemas de p-medianas e p-centros; coloração de grafos; algoritmos de busca e caminhos mínimos; fluxos em redes; problemas Eulerianos e Hamiltoneanos; emparelhamento. Métodos meta-heurísticos: busca tabu, algoritmo genético, simulated annealing, ant systems. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1115","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5141":{"codigo":"EPS5141","nome":"Tópicos Especiais em Pesquisa Operacional","ementa":"Estudo de caso com aplicações de técnicas de Pesquisa Operacional. \n- Artigos diversos publicados em revistas sobre temas relacionados com os estudos de caso \nrealizados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1141","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5145":{"codigo":"EPS5145","nome":"Tópicos Especiais em Qualidade Total","ementa":"Qualidade total. A Função qualidade. A abordagem sistêmica da qualidade. Missão das organizações e qualidade total. Qualidade organizacional. Gestão participativa. Os recursos humanos e a melhoria contínua. Normalização técnica. Requisitos para sistema de garantia de qualidade a partir da ISO 9000. A importância da automação industrial no Brasil e no mundo. Robôs e comando numérico. CAD\/CAM\/CAE, AGV, Sensores, CN, CNC, DNC e CIM.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5146":{"codigo":"EPS5146","nome":"Tópicos Especiais em Arranjo Físico","ementa":"Método para Estudo do Arranjo Físico. Estudo de casos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1142 ou EPS5142","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5211":{"codigo":"EPS5211","nome":"Programação Econômica e Financeira","ementa":"Sistema Econômico: juros simples e compostos; taxa nominal e efetiva; método valor atual; balanço e princípios contábeis básicos. Plano de cotas. Patrimônio líquido. Demonstração de lucros e perdas. Sistema tributário. Estoques. Classificação ABC. Introdução à administração financeira.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1211","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5216":{"codigo":"EPS5216","nome":"Sistemas de Informações Gerenciais","ementa":"Introdução aos sistemas informações gerenciais. Sistemas de informações e organizações. O processo de desenvolvimento de sistemas de informações. Impacto e avaliação de sistemas de informações. Tipos de sistema de informação. Tópicos em gerenciamento dos sistemas. O futuro da tecnologia da informação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5224":{"codigo":"EPS5224","nome":"Finanças em Gestão de Empresas","ementa":"Introdução a moderna teoria de investimentos, títulos e mercados. Alguns conceitos estáticos. Gestão de carteiras de investimentos. Carteira eficiente. Relação entre risco, retorno esperado e medida de desempenho. Mercado de capitais e carteira do mercado.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5228":{"codigo":"EPS5228","nome":"Logística Empresarial","ementa":"Conceito e evolução da logística. Papel da logística na empresa moderna. Logística no Brasil. Enfoque sistêmico e logístico: interfaces, marketing e logística, solução global. Subsistemas logísticos: transportes, armazenagem e distribuição física de produtos. Logística de suprimentos. Tratamento integrado estoque-distribuição. Custos e tarifação. Nível de serviço e sua quantificação. Tratamento da informação. Gestão do sistema logístico. Estudo da casos: roteirização de veículos, análise de artigos, curva ABC, etc..","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5233":{"codigo":"EPS5233","nome":"Gerência Industrial III","ementa":"Integração e revisão dos conhecimentos de administração de vendas, administração da produção, contabilidade, economia da engenharia, economia de empresas e gerência de recursos humanos através de estudos de casos e jogos empresarias.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1233","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5240":{"codigo":"EPS5240","nome":"Gerenciamento de Projetos","ementa":"O ciclo de vida do projeto. As funções administrativas no projeto. O gerente do projeto. Organização da equipe. Planejamento do projeto. Programação. Cronogramas. Rêdes. Orçamentos. Controle do projeto. Interligação do projeto com a empresa.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1240","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5241":{"codigo":"EPS5241","nome":"Planejamento Estratégico","ementa":"Planejamento estratégico e objetivos. Sistemas de planejamento estratégico. Sistemas de planos. O processo de planejamento estratégico. O subsistema de decisão para planejamento. Subsistema de informação e organização para planejamento. Subsistema de gerência para planejamento.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1241","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5242":{"codigo":"EPS5242","nome":"Controle Estatístico de Qualidade","ementa":"Aplicação da estatística ao controle de qualidade. Controle estatístico de processos. Planos de amostragem. Inspeção por atributos. Inspeção por variáveis. Introdução à contabilidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1242","prerequisito":"EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5244":{"codigo":"EPS5244","nome":"Operações em Microcomputadores","ementa":"Utilização de equipamentos. Desenvolvimento de programas simples. Utilização de aplicativos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS1244","prerequisito":"EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5245":{"codigo":"EPS5245","nome":"Sistema de Movimentação e Armazenagem","ementa":"Introdução. Princípios básicos. Acondicionamento. Embalagem. Utilização. Equipamentos. Análise de problemas. Dimensionamento de espaços. Custos de movimentação. Implantação de um projeto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1226 ou EPS1245","prerequisito":"EPS5238","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5246":{"codigo":"EPS5246","nome":"Sistema de Apoio a Decisão em Engenharia de Produção","ementa":"Introdução ao uso dos micros, sistemas de apoio a decisão, análise de custo-volume-lucro, otimização linear pelo método simplex, gerência ótima de estoque, árvores de decisão, PERT-CPM, otimização de fila e análise de séries temporais: médias móveis, amortização exponencial, regressão linear simples, regressão linear múltipla, análise de índices financeiros, fluxo de caixa descontado, gerência de carteira de ativos financeiros, auxílio à decisão multicritério.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1246","prerequisito":"EPS5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5247":{"codigo":"EPS5247","nome":"Delineamento de Experimentos","ementa":"Análise de regressão. Delineamento de experimentos: delineamento sem restrições; blocos casualizados; quadrados latinos; experimentação e análise fatorial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1247","prerequisito":"EPS7003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5248":{"codigo":"EPS5248","nome":"Racionalização da Construção","ementa":"Produtividade na construção. Racionalização: edificação\/produto e edificação\/processo. Economia da construção. Otimização econômica da edificação\/produto. Análise edificação\/processo. Construção tradicional versus construção industrializada.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1248","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5249":{"codigo":"EPS5249","nome":"Analise de Sistemas de Produção","ementa":"Função estratégia da produção: patologia das organizações. Teoria de sistemas aplicada à produção: conceitos essenciais; organização e conceito de sistema; propriedades dos sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; definição de sistemas, subsistemas de supersistemas; concepção de modelo conceitual; comparação do modelo conceitual com situação de problema; definição de mudanças possíveis; determinação de ações de melhorias. Abordagem sistêmica para a decisão em sistemas de produção: investigação de situações de estudo; identificação e decisão para a melhoria da produção.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5250":{"codigo":"EPS5250","nome":"Técnicas Modernas de Produção","ementa":"A macro-estratégica para melhoria da produção: política, sistemas, sub-sistemas e posturas. Integração de técnicas para a qualidade e produtividade. Controle total da qualidade, perda zero, gestão participativa (polivalência e círculos de qualidade), automação, just-in-time\/kanban (e alternativos). Comprovação entre sistemas de produção (ocidentais e o exemplo japonês).","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS1243 ou EPS5243","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5251":{"codigo":"EPS5251","nome":"Técnicas de Previsão para Engenheiros","ementa":"Introdução qualitativa. Introdução quantitativa. Médias móveis e decomposição de séries. Holt-Winters e outros métodos determinísticos. Regressão simples. Regressão múltipla. ARIMA. Organização Empresarial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5316":{"codigo":"EPS5316","nome":"Gestão da Inovação","ementa":"Processo de inovação, estudos de casos, análise econômica da inovação, produção de inovação, inovação e ciclos, mudanças técnicas, análise multicritério da inovação, 'management' da informação tecnológica, formulação de estratégias tecnológicas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5317":{"codigo":"EPS5317","nome":"Inovação de Produtos e Processos","ementa":"Introdução: a empresa, o supersistema, as mudanças; O cliente e seus problemas; atendimento; inovação e criatividade; inovação e diferenciação; inovação de produtos e processos - aspectos metodológicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2600,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5318":{"codigo":"EPS5318","nome":"Padronização de Empresas\/Qualidade Total","ementa":"Conceito de padronização; procedimentos para padronização; principais padrões da empresa; como garantir o cumprimento dos padrões; resultados da padronização; ISO 9000, ISO 9001, ISO 9002, ISO 9003, ISO 9004.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2300,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5320":{"codigo":"EPS5320","nome":"Gestão da Tecnologia e da Inovação","ementa":"Inovação tecnológica: definição e perspectiva; o processo de inovação tecnológica; criação e disseminação de tecnologia; adoção e implementação de tecnologia - o contexto da mudança, processos decisórios implementação; inovação de processos - entendendo, selecionando e melhorando processos existentes, implementação das inovações através da tecnologia de informação; gerenciamento do processo de inovação - criando condições para o trabalho criativo; formulação de estratégias.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5321":{"codigo":"EPS5321","nome":"Integração da Computação no Projeto da Produção I","ementa":"Introdução; Modelagem geométrica; Projeto auxiliado pelo computador; engenharia concorrente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5163","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5322":{"codigo":"EPS5322","nome":"Integração da Computação no Projeto da Produção II","ementa":"Tecnologia de grupo; Planejamento do processo; Planejamento e controle da fabricação integrada. Controle da Fabricação.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2700,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5323":{"codigo":"EPS5323","nome":"Integração da Computação no Projeto da Produção III","ementa":"Controle de Fabricação (Controle Numérico); Robótica; Medidas, Análise e Atuação; Introdução ao CIM.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5321 e EPS5322","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7006":{"codigo":"EPS7006","nome":"Métodos Quantitativos na Gestão da Produção Industrial","ementa":"Gestão da manutenção e confiabilidade de Equipamentos. Planejamento da capacidade de produção. Modelos e controle de estoque e formação de lote. Modelos de seqüenciamento e programação da produção. Balanceamento de linhas de produção. Planejamento de Materiais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7007":{"codigo":"EPS7007","nome":"Avaliação de Desempenho","ementa":"Conceito e evolução das técnicas de Avaliação de Desempenho. Métodos locais- Estatísticos, Mapas, Gráficos, Diagramas e Pareto. Métodos Corporativos - BSC, Baldrige, FPNQ, Nevada, Hronec, McKinsey 7-S, etc. Métodos Construtivistas - SSM, MCDA-C, Estruturação - Contextualização, Elementos Primários de Avaliação, Conceitos, Mapas meio-fim, Árvore de Valor, descritores, níveis âncora. Avaliação - função de valor, independência, taxas, perfil de desempenho. Recomendações - análise de sensibilidade, processo gerador de ações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7008":{"codigo":"EPS7008","nome":"Gestão Estratégica da Tecnologia da Informação","ementa":"Competitividade; Empresas Inteligentes (Gerenciamento na Era da Informação); Plano de ação em GC; Gestão da Informação e o Suporte à Decisão; Tecnologia da Informação e BI; Tecnologias da informação e GC; Implantação de Projetos de TI e GC.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7009":{"codigo":"EPS7009","nome":"Teoria de Decisão","ementa":"- Introdução: Teoria Normativa e a Teoria Descritiva. Estruturação de problemas de decisão: modelagem de alternativas, modelagem das influências do ambiente e modelagem de preferências. Matriz e árvore de decisão. Princípio da Dominância. Decisão sob incerteza. Decisão sob risco. Princípio de Bernoulli. Avaliação e levantamento da informação. Noções sobre decisão com múltiplos objetivos: função de valor, método AHP, métodos outranking.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7011":{"codigo":"EPS7011","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando à realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovado pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7012":{"codigo":"EPS7012","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programas de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7013":{"codigo":"EPS7013","nome":"Empreendedorismo","ementa":"- A formação da Personalidade; O processo comportamental; As necessidades do empreendedor; O conhecimento para empreender; O empreendedor e suas habilidades; Os valores do empreendedor; O processo evolutivo das empresas; Modelos de Ciclo de Vida; A personalidade do empreendedor e o ciclo de vida da organização.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5232","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7014":{"codigo":"EPS7014","nome":"Redes de Empresa","ementa":"Globalização e Competitividade, Competitividade Regional, Aglomerações Produtivas, Redes e Consórcios de Empresas, Cadeias de Fornecedores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7036":{"codigo":"EPS7036","nome":"Atividades Complementares A","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7037":{"codigo":"EPS7037","nome":"Atividades Complementares B","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7038":{"codigo":"EPS7038","nome":"Sistemas de Produção Enxutos","ementa":"Origens, visão geral do Sistema Toyota de Produção (STP). O Mecanismo da Função Produção: a função processo e a função operação. Princípios da Manufatura Enxuta. Valor e desperdícios no sistema produtivo. Mapeamento de fluxo de valor. Tempo Takt. Inventário. Supermercado. Troca rápida de ferramentas (TRF). Fluxo contínuo. Células. Balanceamento de linha, Trabalho padronizado, TPM, Sistemas Canban, Linha FIFO, Programação de produção,  Controle de qualidade zero defeitos e poka-yokes, gerenciamento visual e kaizen (melhoria contínua). Implantação da Manufatura Enxuta. Desenvolvimento Enxuto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7039":{"codigo":"EPS7039","nome":"Projeto para Manufatura Enxuta","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5101":{"codigo":"INE5101","nome":"Simulação Discreta","ementa":"Definições, metodologia: formulação do problema, formulação do modelo, formulação do programa para computador, validação do projeto experimental, análise dos dados. Modelos. Validação. Experimentos práticos. Geração de variáveis estocásticas. Geração de números pseudo-aleatórios. Linguagens de simulação. Estudo de casos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CEC5101","prerequisito":"EPS7003 ou INE5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5108":{"codigo":"PSI5108","nome":"Psicologia Aplicada a Administração","ementa":"Psicologia organizacional - histórico, caracterização e áreas de atuação. Problemas humanos nas organizações - características da personalidade, integração indivíduo X organização, necessidades humanas e motivação para o trabalho. A organização como contexto social - processos de grupo, cultura organizacional e conflito nas organizações. Criatividade e processo decisório. Diagnóstico e desenvolvimento. O poder nas organizações. Administração de conflitos. A alienação no trabalho.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"PSI1302","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DIR5996":{"codigo":"DIR5996","nome":"Noções Gerais de Direito","ementa":"Pessoas. Bens. Fato jurídico. Direito de vizinhança. A empresa. Registro do Comércio. Nome comercial. Propriedade industrial. Sociedades comerciais. Títulos de crédito. Empregado. Empregador. Contrato de trabalho. Estabilidade e Fundo de Garantia do Tempo de Serviço. Segurança e Medicina do Trabalho. Previdência Social. Legislação relativa aos profissionais da engenharia. CONFEA. CREA. Exercício profissional. Responsabilidade profissional. Registro de autonomia de planos e projetos. Remuneração profissional.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"DPS1140 ou DPS5140","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5103":{"codigo":"EEL5103","nome":"Circuitos Elétricos I","ementa":"","carga_horaria":108,"fase_sugestao":999,"equivalencia":"EEL1103","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5131":{"codigo":"EEL5131","nome":"Circuitos Elétricos II","ementa":"","carga_horaria":108,"fase_sugestao":999,"equivalencia":"EEL1131","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5140":{"codigo":"EEL5140","nome":"Aspectos de Segurança em Engenharia Elétrica","ementa":"Engenharia de segurança, legislação e normas regulamentares. Fundamentos de higiene e segurança do trabalho. Análise de projetos. Princípios básicos sobre prevenção de incêndios. Primeiros socorros. Serviço de segurança na empresa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5229":{"codigo":"EEL5229","nome":"Eletrotécnica Aplicada I","ementa":"","carga_horaria":90,"fase_sugestao":999,"equivalencia":"EEL1229","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5230":{"codigo":"EEL5230","nome":"Eletrotécnica Aplicada II","ementa":"","carga_horaria":90,"fase_sugestao":999,"equivalencia":"EEL1230","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5249":{"codigo":"EEL5249","nome":"Análise de Sistemas Elétricos de Potência","ementa":"","carga_horaria":108,"fase_sugestao":999,"equivalencia":"EEL1249","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5251":{"codigo":"EEL5251","nome":"Conversão Eletromecânica da Energia I","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1251","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5252":{"codigo":"EEL5252","nome":"Conversão Eletromecânica da Energia II","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1252","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5253":{"codigo":"EEL5253","nome":"Laboratórios de Maquinas Elétricas I","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EEL1253","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5254":{"codigo":"EEL5254","nome":"Lab. de Maquinas Elétricas II","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EEL1254","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5311":{"codigo":"EEL5311","nome":"Microprocessadores e Microcomputadores","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1311 ou EEL5314 ou EEL5315","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5332":{"codigo":"EEL5332","nome":"Eletrônica I","ementa":"","carga_horaria":90,"fase_sugestao":999,"equivalencia":"EEL1332","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5333":{"codigo":"EEL5333","nome":"Eletrônica II","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1333","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5334":{"codigo":"EEL5334","nome":"Eletrônica III","ementa":"","carga_horaria":90,"fase_sugestao":999,"equivalencia":"EEL1334","prerequisito":"EEL5342","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5414":{"codigo":"EEL5414","nome":"Princípios de Sistemas de Comunicação","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EEL1414","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5505":{"codigo":"EEL5505","nome":"Analises de Sistemas Lineares","ementa":"","carga_horaria":108,"fase_sugestao":999,"equivalencia":"EEL1505","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5506":{"codigo":"EEL5506","nome":"Servomecanismos I","ementa":"","carga_horaria":180,"fase_sugestao":999,"equivalencia":"EEL1506","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL5633":{"codigo":"EEL5633","nome":"Pratica de Eletrotécnica","ementa":"Aspectos práticos das instalações de lâmpadas (incandescentes, fluorescentes), interruptores simples, three way, four way, contactores. Partida de motores, reversão, fim de curso, chave-bóia, minuteria, célula fotoelétrica, fusível.","carga_horaria":18,"fase_sugestao":999,"equivalencia":"EEL1723","prerequisito":"EEL7040 e EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5604":{"codigo":"EGR5604","nome":"Desenho Técnico I","ementa":"Introdução ao Desenho Técnico à mão livre. Normas para o desenho. Técnicas fundamentais de traçado à mão livre. Sistemas de representação: 1º e 3º diedros. Projeção ortogonal de peças simples. Vistas omitidas. Cotagem e proporções. Perspectiva axométrica, isométrica, bimétrica, trimétrica. Perspectiva cavaleira. Esboços cotados. Sombras próprias. Esboços sombreados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"RTS1604 ou RTS5604","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5201":{"codigo":"EPS5201","nome":"Planejamento e Controle da Produção","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5205":{"codigo":"EPS5205","nome":"Estudo do Trabalho, Arranjo Físico e Mov. de Mat.","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1205","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5218":{"codigo":"EPS5218","nome":"Gerência Industrial","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1218 ou (EPS5231 e EPS5232) ou (EPS1231 e EPS1232)","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5302":{"codigo":"EPS5302","nome":"Projeto do Produto","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS1302","prerequisito":"EPS5205","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FSC5114":{"codigo":"FSC5114","nome":"Física IV","ementa":"Indutância e suas aplicações; as propriedades magnéticas da matéria: materiais diamagnéticos, paramagnéticos e ferromagnéticos, as leis que os regem. Equações de Maxwell: interpretação física e aplicações. Solução de circuitos em série (RLC) de corrente alternada e transformadores. Luz: natureza, propagação e fenômenos ópticos (interferência, difração e polarização). Física Moderna: introdução à Mecânica Quântica, Física Atômica e Nuclear. Relatividade Especial: Leis e aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"FSC1114","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLE5101":{"codigo":"LLE5101","nome":"Inglês Instrumental I-A","ementa":"Introdução ao desenvolvimento das estratégias de leitura e estudo de estruturas básicas da língua inglesa tendo como objetivo a compreensão de textos preferencialmente autênticos, gerais e específicos da área.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LLE5712":{"codigo":"LLE5712","nome":"Inglês I-B","ementa":"","carga_horaria":60,"fase_sugestao":999,"equivalencia":"LLE1103","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLV5175":{"codigo":"LLV5175","nome":"Português Pratico - Redação I","ementa":"Estudo do texto: conteúdo, linguagem  e estrutura. A redação técnica e científica: tipos e característicos da descrição e da dissertação. Redação oficial: documentos e correspondências. Estudo assistemático de conteúdos gramaticais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"LLV1114 ou LLV1175","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"SPO5128":{"codigo":"SPO5128","nome":"Sociologia Geral A","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"CSO5128","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"MTM5801":{"codigo":"MTM5801","nome":"H Cálculo I","ementa":"Números: propriedades básicas, valor absoluto, desigualdades, números naturais, inteiros, racionais e reais. Funções reais de uma variável real: gráficos, limites, continuidade, ínfimo e supremo, existência de máximo de uma função contínua em um intervalo fechado. Derivada: diferenciação, significado da derivada, convexidade, derivada da função inversa. Integral: somas de Riemann, Teorema fundamental do cálculo. Funções trigonométricas, logarítmica e exponencial. Aplicações numéricas. Uso de pacotes.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5802":{"codigo":"MTM5802","nome":"H Cálculo II","ementa":"Integral, Técnicas de Integração, Aproximações por Polinômios, Seqüências e Séries, Convergência Uniforme.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5801 e MTM5811","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5803":{"codigo":"MTM5803","nome":"H Cálculo III","ementa":"Sistemas de coordenadas: cartesianas, polares, cilíndricas, esféricas, mudança de coordenadas. Funções reais de várias variáveis: gráficos, limite, continuidade, derivação, gradiente, derivada direcional. Funções vetoriais: campos de vetores, divergente, rotacional, cálculo diferencial vetorial. Derivadas de ordem superior: teorema de Taylor, extremos de funções reais, multiplicadores de Lagrange, teorema da função implícita. Integrais duplas: integração sobre diversos tipos de regiões, mudança na ordem de integração. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5802","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5804":{"codigo":"MTM5804","nome":"H-Cálculo IV","ementa":"Integrais de Curva e Superfícies, Teoremas de Integração da Análise Vetorial, Aplicações.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5803","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5811":{"codigo":"MTM5811","nome":"H-Álgebra I","ementa":"Vetores em R2 e R3. Produto interno. Produto vetorial no R3. Retas no R2 e R3. Planos no R3. Produtos mistos no R3. Sistemas lineares. Matrizes. Determinantes. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5812":{"codigo":"MTM5812","nome":"H-Álgebra II","ementa":"Espaços vetoriais. Bases e dimensão. Transformações lineares. Produto interno. Bases ortonormais. Decomposição QR. Autovalores e autovetores de um operador linear. Métodos numéricos para cálculo de autovalores e autovetores. Matrizes autoadjuntas e o teorema espectral. Identificação de cônicas em R2 e quádricas em R3. Uso de pacotes. Aplicações numéricas.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5811","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5813":{"codigo":"MTM5813","nome":"H-Álgebra III","ementa":"Autovalores e autovetores: aplicações, Matrizes definidas positivas, Computação com matrizes, \nProgramação linear , Uso de pacotes computacionais","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5812","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM5814":{"codigo":"MTM5814","nome":"H-Análise Linear","ementa":"Convergência em Espaços Euclidianos. Teoria Geral das EDO. \t\nTransformada de Laplace. Séries de Fourier. Problemas de fronteira   \t\npara EDO e EDP. Uso de Pacotes.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM5813","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20071":{"id":"427","codigo":20071,"codigo_curso":213,"carga_horaria_ufsc":4338,"carga_horaria_mec":4320,"aulas_semana_min":14,"aulas_semana_esperado":26,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20071","ucs":{"EGR5619":{"codigo":"EGR5619","nome":"Desenho Técnico para Engenharia Elétrica","ementa":"Conceito, normalização e classificação do desenho técnico; técnicas fundamentais do traçado a mão livre; técnicas fundamentais do desenho auxiliado por computador (CAD); noções básicas de geometria descritiva; sistemas de representação: perspectivas e vistas ortográficas; desenho técnico: classificação e normas técnicas; técnicas fundamentais do desenho técnico com instrumentos; desenho de projetos industriais; desenho de projetos de engenharia; desenho de diagramas elétricos; noções de desenho civil e arquitetônico; desenho de instalação elétrica residencial.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5120":{"codigo":"EPS5120","nome":"Introdução a Engenharia de Produção","ementa":"Diretrizes curriculares. Perfil do profissional. Evolução da engenharia. Desenvolvimento econômico e capacitação C&T. Contextualização da Eng. de Produção. Produção na organização. Fronteiras da Função Produção. Modelo de transformação. Objetivos da produção. Estratégia de produção. Princípios gerais de projeto em produção: projeto de produtos e serviços e projeto de processos. Natureza do planejamento e controle na produção. Noções de Metodologia Científica e de Comunicação Técnica.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EPS2302","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5101":{"codigo":"FSC5101","nome":"Física I","ementa":"Introdução aos conceitos fundamentais da cinemática, dinâmica e estática. Leis de conservação da energia e do momento linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"FSC5102","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3110":{"codigo":"MTM3110","nome":"Cálculo 1","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101 ou MTM5161","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5125":{"codigo":"QMC5125","nome":"Química Geral Experimental A","ementa":"Matéria. Conceitos gerais. Teoria atômica. Estrutura atômica. ConfiguraçãoEletrônica. Orbital Atômico. Ligações químicas: iônicas, covalentes, metálicas. Leis dos gases. Conceito de Mol. Funções químicas. Misturas. Soluções. Concentração de soluções. Equações químicas. Reações redox. Introdução ao Equilíbrio químico; ácidos ebases; ph. Calor de reação. Introdução á Termoquímica.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"QMC5138":{"codigo":"QMC5138","nome":"Química Geral","ementa":"Matéria. Conceitos gerais. Teoria atômica. Estrutura atômica. Orbital atômico. Transformações químicas. Gases, líquidos e pressão de vapor. Estequiometria. Conceito de mol. Termodinâmica. Geometria molecular, Momento dipolar, Solubilidade. Estruturas químicas cristalinas, Elétrons nos sólidos, Defeitos nos sólidos. Soluções e misturas, propriedades coligativas. Cinética e mecanismos de reações. Equilíbrio químico, Equilíbrio ácido-base. Reações de oxi-reduções, eletroquímica, pilhas, corrosão e combustão.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7011":{"codigo":"EEL7011","nome":"Laboratório de Eletricidade Básica","ementa":"Noções gerais de eletricidade (unidades, erros, corrente, tensão, Lei de Ohm, potência, energia e outras características elétricas); medidores: amperímetro, voltímetro, ohmímetro; circuitos resistivos e leis de Kirchhoff; osciloscópio e gerador de funções; capacitores; diodos e retificadores; transistores; amplificadores operacionais; circuitos elétricos simples.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5234":{"codigo":"EPS5234","nome":"Análise de Sistemas de Produção","ementa":"Conceitos, definições e propriedades de sistemas. Metodologia de análise de sistemas: reconhecimento da situação de problema; caracterização do sistema, subsistemas e supersistema; caracterização do modelo conceitual; comparação do modelo conceitual com a situação de problema; definição de mudanças possíveis; determinação de ações e melhorias. Teoria de Sistemas aplicada à Engenharia de Produção. Sistemas Organizacionais: marketing, produção, materiais, pessoal, finanças\/controladoria e informática. Abordagem sistêmica para a decisão em sistemas de produção","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EPS2320","prerequisito":"EPS2302 ou EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7001":{"codigo":"EPS7001","nome":"Informática para Engenharia de Produção","ementa":"Conceitos básicos. Principais aplicativos para engenheiros de Produção. Estrutura de dados. Algoritmos: formulação, representação e noções de complexidade. Linguagem de programação: estrutura, tipos de dados simples e estruturados, instruções de repetição, funções e procedimentos. Noções de orientação a objetos. Fundamentos em Bancos de Dados Relacionais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EPS2301","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5002":{"codigo":"FSC5002","nome":"Física II","ementa":"Estudo da Cinemática e Dinâmica da rotação de corpos rígidos. Oscilações e ondas Mecânicas(som). Estática e Dinãmica dos Fluídos. Noções sobre temperatura, calor, princípios da Termodiâmica e teoria cinética dos gases.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5132 ou FSC5137","prerequisito":"(FSC5101 e MTM5161) ou (FSC5102 e MTM5161) ou (FSC5101 e MTM3101) ou (FSC5102 e MTM3101) ou (FSC5101 e MTM3110) ou (FSC5102 e MTM3110)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5103":{"codigo":"FSC5103","nome":"Estática para Engenharia","ementa":"Estudo  das  condições  de  equilíbrio  de  partículas  e  de  corpos  rígidos  (estruturas,  vigas,  treliças  etc)  no  plano  e  no  espaço,  envolvendo  o  cálculo  das  reações  em  conexões  padrão  utilizadas  em  engenharia;  cálculo  de  forças  axiais,  esforços  cortantes  e  momentos  fletores  em  estruturas  e  vigas;  cálculo  de  centróides  de  áreas  e  de  volumes  de  figuras  simples  e  de  figuras  compostas;  cálculo  de  momentos  de  inércia  de  chapas  planas  simples  e  compostas  e  de  sólidos  simples  e  compostos;  equilíbrio  de  cabos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5050","prerequisito":"(FSC5101 e MTM5161) ou (FSC5102 e MTM5161) ou (FSC5101 e MTM3101) ou (FSC5102 e MTM3101) ou (FSC5101 e MTM3110) ou (FSC5102 e MTM3110)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5122":{"codigo":"FSC5122","nome":"Física Experimental I","ementa":"Complementação  dos conteúdos de mecânica, acústica, termologia. Obtida através de montagem e realização de experiências, em número de 12 (doze), versando sobre os tópicos acima.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"FSC5124","prerequisito":"FSC5101 ou FSC5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3120":{"codigo":"MTM3120","nome":"Cálculo 2","ementa":"Aplicações da integral definida. Técnicas de integração (por partes, substituição trigonométrica, frações parciais). Integral imprópria. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies. Funções de várias variáveis. Derivadas parciais. Máximos e mínimos de funções de duas variáveis.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"(MTM3102 e MTM3111) ou (MTM3102 e MTM5512) ou (MTM5162 e MTM5512) ou (MTM3111 e MTM5162)","prerequisito":"MTM3101 ou MTM3110 ou MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3121":{"codigo":"MTM3121","nome":"Álgebra Linear","ementa":"Matrizes. Determinantes. Sistemas lineares. Espaço vetorial real. Produto interno. Transformações lineares. Autovalores e autovetores de um operador linear. Diagonalização. Aplicações da Álgebra Linear.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3112 ou MTM5245","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5125":{"codigo":"EMC5125","nome":"Mecanica dos Solidos I","ementa":"Solicitações internas. Reações. Diagramas. Tensões e deformações. Estados de tensão. Lei de Hooke. Trabalho de deformação. Solicitações axiais. Flexão simples. Cisalhamento em vigas longas. Torção. Solicitações compostas. Análise de tensões em um ponto. Teorias de colapso.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMC5128","prerequisito":"(FSC5103 e MTM3112) ou (FSC5103 e MTM5223) ou (FSC5103 e MTM5245) ou (FSC5103 e MTM3121)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7002":{"codigo":"EPS7002","nome":"Probabilidade e Modelos Estocásticos","ementa":"Probabilidade: definições, variáveis aleatórias discretas e contínuas; distribuições conjuntas, marginais e condicionais; funções de distribuições de probabilidades: normal, qui-quadrado, exponencial, binominal e Poisson. Processos Estocásticos: definições, cadeias de Markov e matriz de transição. Teoria das filas: sistemas M\/M\/1, M\/M\/c e M\/M\/ck. Simulação: geração de números pseudo-aleatórios, formulação de modelos de simulação; validação do modelo; linguagens de simulação. Noções de confiabilidade de sistemas.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"(MTM3102 ou MTM3120 ou MTM5162) e (MTM3112 ou MTM3121 ou MTM5223 ou MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5113":{"codigo":"FSC5113","nome":"Física III","ementa":"Análise dos principais fenômenos da eletricidade  e magnetismo abrangendo o estudo de campo elétrico, potencial elétrico, capacitor, corrente elétrica, força eletromotriz, campo magnético e indução eletromagnética.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"(FSC5002 ou FSC5137) e (MTM3102 ou MTM3120 ou MTM5162)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5202":{"codigo":"INE5202","nome":"Cálculo Numérico em Computadores","ementa":"Erros e Sistemas de Numeracão. Solução de equações algébricas e transcendentais. Solução de equações polinomiais. Sistemas de equações lineares e não lineares. Interpolação Ajustamento de curvas. Integração numérica. Solução numérica de equações diferenciais ordinárias e sistemas de equações diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EPS2301 ou EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3103":{"codigo":"MTM3103","nome":"Cálculo 3","ementa":"Integração múltipla: integrais duplas e triplas. Noções de cálculo vetorial: curvas e superfícies. Campos escalares e vetoriais. Integrais de linha e de superfícies. Teoremas de Green, Stokes e da Divergência.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM5163","prerequisito":"MTM3102 ou MTM3120 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3131":{"codigo":"MTM3131","nome":"Equações Diferenciais Ordinárias","ementa":"Equações diferenciais ordinárias de primeira ordem. Equações diferenciais ordinárias lineares homogêneas de ordem n. Equações diferenciais ordinárias lineares não homogêneas de ordem 2. Noções gerais de Transformada de Laplace. Sistemas de Equações Diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM3102 ou MTM5163","prerequisito":"MTM3101 ou MTM3120 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT0001":{"codigo":"ZZT0001","nome":"Optativa I","ementa":"","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EEL7041":{"codigo":"EEL7041","nome":"Eletromagnetismo","ementa":"1. Revisão Matemática: o operador nabla; gradiente; divergente e rotacional; teorema da divergência e teorema de Stokes; operadores de segunda ordem; e exemplos. \n2. O Eletromagnetismo a partir das equações de Maxwell: as grandezas eletromagnéticas, as equações de Maxwell sob a forma local e sob a forma integral; o eletromagnetismo em baixas frequências (quase-estática); e exemplos. \n3. A Eletrostática: campo elétrico; teorema de Gauss; potencial elétrico; força eletromotriz; refração de campos elétricos; rigidez dielétrica; capacitância; e exemplos. \n4. A Magnetostática: lei de Ampère; lei de Biot-Savart; refração de campos magnéticos; materiais magnéticos: diamagnetismo, paramagnetismo, ferromagnetismo, e ímãs permanentes; circuitos magnéticos; indutâncias; e exemplos. \n5. A Magnetodinâmica: lei de Faraday; lei de Lenz; blindagem magnética; penetração de campos magnéticos em condutores; perdas no cobre e no ferro; e exemplos. \n6. Interação entre grandezas eletromagnéticas e mecânicas: lei de Laplace; lei de Lorentz; força pela variação de energia; vetor de Poynting; tensor de Maxwell; e exemplos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"(FSC5113 ou FSC5133 e MTM5163) ou MTM3103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7045":{"codigo":"EEL7045","nome":"Circuitos Elétricos A","ementa":"Conceitos básicos: carga, corrente, tensão, potência, energia, elementos de circuito. Leis básicas (Ohm, Kirchhoff). Circuitos de corrente contínua: divisor de tensão e de corrente; métodos de análise (nodal e de malhas); teoremas de circuitos (linearidade, superposição, transformação de fontes, Thévenin, Norton, máxima transferência de potência). Capacitores e indutores. Circuitos de primeira ordem. Circuitos de segunda ordem. Circuitos de corrente alternada: senóides e fasores, relação fasorial para elementos de circuito, impedância e admitância; análise senoidal em regime permanente; resposta em frequência (ressonância e filtros); potência (valor eficaz, potências instantânea, ativa, reativa e aparente, fator de potência, máxima transferência de potência). Atividades de laboratório.","carga_horaria":108,"fase_sugestao":4,"equivalencia":"EEL7040","prerequisito":"(FSC5113 ou FSC5133) e (EEL7011 e MTM5163) ou MTM3103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7000":{"codigo":"EPS7000","nome":"Estatística e Modelos de Previsão","ementa":"Estatística: planejamento de pesquisa e levantamento de dados, amostragem, análise de dados, análise de correlação e regressão, estimação de parâmetros, testes de hipóteses paramétricos e não paramétricos. Previsão: médias móveis e decomposição de séries, Holt-Winters e outros métodos determinísticos. Regressão simples e múltipla. Modelos ARIMA.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EPS7003","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7009":{"codigo":"EPS7009","nome":"Teoria de Decisão","ementa":"- Introdução: Teoria Normativa e a Teoria Descritiva. Estruturação de problemas de decisão: modelagem de alternativas, modelagem das influências do ambiente e modelagem de preferências. Matriz e árvore de decisão. Princípio da Dominância. Decisão sob incerteza. Decisão sob risco. Princípio de Bernoulli. Avaliação e levantamento da informação. Noções sobre decisão com múltiplos objetivos: função de valor, método AHP, métodos outranking.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EPS2340","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7060":{"codigo":"EPS7060","nome":"Gestão Ambiental","ementa":"Fundamentos da questão ambiental. Modelos de produção e sustentabilidade. Ferramentas da gestão ambiental. Leis e normas ambientais e métodos de avaliação de impactos. Gerenciamento de resíduos. Desastres ambientais.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"","prerequisito":"EPS2302 ou EPS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5114":{"codigo":"FSC5114","nome":"Física IV","ementa":"Indutância e suas aplicações; as propriedades magnéticas da matéria: materiais diamagnéticos, paramagnéticos e ferromagnéticos, as leis que os regem. Equações de Maxwell: interpretação física e aplicações. Solução de circuitos em série (RLC) de corrente alternada e transformadores. Luz: natureza, propagação e fenômenos ópticos (interferência, difração e polarização). Física Moderna: introdução à Mecânica Quântica, Física Atômica e Nuclear. Relatividade Especial: Leis e aplicações.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"FSC5113 ou FSC5133","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3104":{"codigo":"MTM3104","nome":"Cálculo 4","ementa":"Sequências e séries numéricas. Sequências e séries de funções: séries de potências e séries de Fourier. Equações diferenciais parciais: método da separação de variáveis nas equações clássicas da onda, do calor e de Laplace.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"MTM5164","prerequisito":"MTM3102 ou MTM3131 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7051":{"codigo":"EEL7051","nome":"Materiais Elétricos","ementa":"Propriedades gerais dos materiais; classificação; materiais condutores; materiais semicondutores; materiais isolantes; materiais magnéticos, aplicações.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"(FSC5114 ou FSC5133) e QMC5106 ou (FSC5114 ou FSC5133) e (QMC5125 e QMC5138)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7052":{"codigo":"EEL7052","nome":"Sistemas Lineares","ementa":"Sinais e sistemas contínuos; sistemas lineares contínuos e invariantes no tempo; Série de Fourier; Transformada de Fourier; Transformada de Laplace; funções de transferência e representação por diagrama em blocos; resposta em frequência de sistemas lineares e invariantes no tempo; sistemas amostrados e Transformada Z.","carga_horaria":90,"fase_sugestao":5,"equivalencia":"","prerequisito":"EEL7045 e (MTM3104 ou MTM5164) e (MTM3112 ou MTM3121 ou MTM5223 ou MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7053":{"codigo":"EEL7053","nome":"Ondas  Eletromagnéticas","ementa":"Equações de Maxwell; ondas planas uniformes (OPU): propagação das OPU num meio qualquer, potência associada à OPU - o vetor de Poynting, propagação das OPU em meios sem perda, propagação das OPU em bons condutores, reflexão de ondas, polarização de ondas. Linhas de transmissão (LT): equações e parâmetros básicos, forma hiperbólica das equações de LT, reflexão e casamento de impedâncias, tipos e parâmetros das LT. Guias de onda e cavidades ressonantes. Antenas: (definição, parâmetros principais, tipos e aplicações, cálculo de radioenlaces).","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EEL7041 e (EEL7040 ou EEL7045)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7055":{"codigo":"EEL7055","nome":"Circuitos Elétricos B","ementa":"Potência complexa. Correção do fator de potência. Circuitos trifásicos: tensões balanceadas, tipos de ligações, potência em sistemas balanceados, sistemas desbalanceados, componentes simétricas. Análise de circuitos com a integral de convolução. Circuitos acoplados magneticamente: indutância (própria e mútua), energia, transformadores. Quadripolos: parâmetros de impedância, admitância, híbridos e de transmissão, conexão de quadripolos. Laboratório.","carga_horaria":108,"fase_sugestao":5,"equivalencia":"EEL7050","prerequisito":"EEL7040 ou EEL7045","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7005":{"codigo":"EPS7005","nome":"Pesquisa Operacional","ementa":"Introdução: histórico, objetivos, restrições e modelos. Condições de otimalidade. Programação linear: modelos de programação linear, método simplex, dualidade, análise de sensibilidade e pós-otimalidade. Problemas lineares especiais.Programação não-linear; otimização multivariada; otimização sem restrições. Programação Inteira, Binária e Mista: algoritmos e modelos. Programação Dinâmica determinística e estocástica.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"(EPS2301 ou EPS7001) e (EPS2340 ou EPS7009)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7010":{"codigo":"EPS7010","nome":"Gestão Patrimonial","ementa":"Informação contábil no processo de produção das organizações. Dinâmica dos fluxos operacionais de curto e longo prazo. Princípios e procedimentos contábeis básicos. Demonstrativos contábeis para a gestão da produção. Indicadores financeiros do desempenho. Capital de giro, endividamento e estrutura de capital. Liquidez e fluxos de caixa. Rentabilidade, origem e aplicações de recursos.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EPS2350","prerequisito":"EPS2320 ou EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7020":{"codigo":"EPS7020","nome":"Ergonomia","ementa":"Introdução à Ergonomia: definições e histórico. Princípios de fisiologia do trabalho. Princípios de psicologia do trabalho. Antropometria e biomecânica. Princípios de organização do trabalho. Condições ambientais de trabalho. O projeto do trabalho. Introdução a Análise Ergonômica do Trabalho.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS2362","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5317":{"codigo":"DAS5317","nome":"Sistemas de Controle","ementa":"Teórica: Apresentação e definição do problema de controle de sistemas; análise de sistemas de controle contínuos e discretos em regime permanente: precisão e sensibilidade; estabilidade de sistemas de controle contínuos e discretos: métodos de Routh-Hurwitz, Jury, Nyquist e Bode; estruturas básicas de controladores; projeto de controladores contínuos e discretos: método de Ziegler-Nichols, projeto usando o lugar das raízes, projeto usando métodos frequências. Exemplos de aplicações. \nLaboratório: Análise de sistemas contínuos e discretos. Resposta de sistemas, precisão e sensibilidade. Análise de estabilidade. Projeto de controladores usando lugares das raízes. Projeto de controladores usando métodos frequenciais. Sintonia de controladores PID usando Ziegler-Nichols. Projeto de controladores: casos contínuos e discretos.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"EEL7063","prerequisito":"EEL7052","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7061":{"codigo":"EEL7061","nome":"Eletrônica I","ementa":"Introdução à eletrônica; amplificadores operacionais; diodos; o transistor de junção bipolar; transistores de efeito de  \ncampo; componentes optoeletrônicos.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"EEL5346","prerequisito":"(EEL7040 ou EEL7045) e (FSC5114 ou FSC5133)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7064":{"codigo":"EEL7064","nome":"Conversão Eletromecânica de Energia A","ementa":"Introdução e princípios de máquinas elétricas; transformadores: tipos, ensaios, circuito equivalente, regulação e rendimento, paralelismo de transformadores, transformador de corrente e Potencial, autotransformador, campo girante, máquinas síncronas: geradores síncronos, motores síncronos, teoria de máquinas síncronas de polos lisos e salientes; ensaios, circuitos equivalentes, controle da energia ativa e reativa, triângulo de Potier, diagrama de capabilidade, Tipos de excitação, enrolamento compensador, sincronismo, compensador síncrono, refrigeração, laboratório.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"(EEL7050 ou EEL7055) e (EEL7041 e EEL7051)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7018":{"codigo":"EPS7018","nome":"Análise Gerencial de Custos","ementa":"- Princípios e métodos de custo. Análise de custo-volume-lucro. Custo padrão. Método dos centros de custos. Custeio baseado em atividades (ABC). Método da unidade de esforço de produção (UEP). Gestão por atividade (ABM).","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EPS2363","prerequisito":"EPS2350 ou EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7019":{"codigo":"EPS7019","nome":"Engenharia Econômica","ementa":"- Matemática Financeira: conceito de juros; relações de equivalência; taxas nominais e efetivas; amortização de dívidas (Price, SAC e Misto). Inflação e correção monetária. Análise econômica de investimentos: princípios e conceitos; VAUE, TIR e Pay-back; substituição de equipamentos; aluguel, leasing e financiamentos. Risco, incerteza e análise de sensibilidade. Calculadoras financeiras e planilhas.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EPS7009","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7071":{"codigo":"EEL7071","nome":"Introdução a Sistemas de Energia Elétrica","ementa":"Organização da indústria de energia elétrica; modelagem dos elementos e representação dos sistemas elétricos; análise de fluxo de potência; análise de curto-circuito.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EEL7053 e EEL7064 e INE5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7072":{"codigo":"EEL7072","nome":"Projeto de Instalações Elétricas","ementa":"Normas; sistemas de alimentação e configuração de redes BT e AT; planejamento e projeto de uma instalação; cargas típicas; componentes de uma instalação; pontos de iluminação e tomadas; potência instalada; fator de demanda; fator de carga; diagrama unifilar; dimensionamentos dos condutores; dimensionamento da proteção; projeto residencial e predial; pára-raios; projeto telefônico; interfones; antenas, alarmes; luminotécnica; projeto de iluminação de interiores; iluminação de emergência; instalações elétricas industriais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"(EEL7050 ou EEL7055) e EEL7051","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7073":{"codigo":"EEL7073","nome":"Conversão Eletromecânica de Energia B","ementa":"Motores de indução: ensaios, circuito equivalente, potência e torque em motores trifásicos, métodos de partida do motor trifásico, Motores monofásico e bifásico; máquinas de corrente contínua: máquinas elementares, máquinas reais, tensão gerada e torque, fluxo de potência e perdas, geradores corrente contínua, motores corrente contínua; máquinas especiais: motor universal, outros tipos de motores especiais, laboratório.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EEL7064","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5425":{"codigo":"EMC5425","nome":"Fenômenos de Transportes","ementa":"Conceitos fundamentais em mecânica dos fluidos; dimensões e unidades; campos escalar, vetorial e tensorial; viscosidade. Hidrostática; pressão em fluido estático, manômetros; forças sobre superfícies planas e curvas submersas. Análise de escoamento; leis básicas para sistemas e volumes de controle;  conservação da massa; equação da quantidade de movimento linear; primeira lei da termodinâmica; equação de Bernoulli. Escoamento viscoso incompressível; escoamento em tubos;  diagrama de  Moody; perdas de carga distribuidas e localizadas. Conceitos fundamentais em transmissão de calor;  dimensões e unidades; leis básicas  da transmissão de calor; condução, convecção e radiação; mecanismos combinados de transmissão de calor. Condução unidimensional em regime permanente; espessura crítica de isolamento; aletas; estruturas compostas. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"(FSC5002 e MTM5162) ou (FSC5137 e MTM5162) ou (FSC5102 e MTM3102) ou (FSC5102 e MTM3131)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5222":{"codigo":"EPS5222","nome":"Modelos Econômicos Quantitativos","ementa":"Mercado: oferta e demanda. Formação da demanda: demanda individual e do mercado. Produção: tecnologia, insumos, produtividade e custos; maximização de lucros. Tipos de mercados: monopólio, monopsônio, concorrência perfeita, oligopólios. Estruturas de mercados e formação de preços. Teoria dos jogos e estratégia competitiva. Mercado para fatores de produção. Externalidades e bens públicos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EPS2330","prerequisito":"EPS7005 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5235":{"codigo":"EPS5235","nome":"Planejamento e Controle da Produção","ementa":"Visão geral dos sistemas de produção. Planejamento estratégico da produção. Planejamento mestre da produção. Programação da produção: administração de estoques, seqüenciamento,emissão e liberação de ordens. Acompanhamento da produção.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"","prerequisito":"EPS7000 e EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7021":{"codigo":"EPS7021","nome":"Planejamento e Projeto do Produto","ementa":"Morfologia. Análise de valor. Ciclo de vida. Informações de projeto: levantamento das necessidades, requisitos de projeto. Projeto preliminar: geração de soluções, matrizes de seleção, análise de varáveis. Detalhamento de projeto. Projeto para fabricação. Aspectos ambientais.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EPS2382","prerequisito":"(EPS2363 ou EPS7018) e (EPS2362 ou EPS7020)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5105":{"codigo":"EEL5105","nome":"Circuitos e Técnicas Digitais","ementa":"Sistemas de numeração e códigos numéricos. Álgebra Booleana. Funções e portas lógicas. Portas lógicas CMOS. Síntese e otimização de circuitos lógicos. Circuitos combinacionais. Circuitos sequenciais. Máquinas de estados finitos. Relógio e temporização. Modelo bloco operativo\/bloco de controle. Introdução às linguagens de descrição de hardware (HDL). Dispositivos lógicos programáveis.","carga_horaria":90,"fase_sugestao":8,"equivalencia":"EEL7020","prerequisito":"EEL7011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5227":{"codigo":"EPS5227","nome":"Planejamento Industrial","ementa":"Noções de planejamento empresarial. Etapas de um empreendimento industrial. Metodologia para elaboração dos ante-projetos. Estudos de mercado. Estudos de localização. Análise de tecnologias e fatores de produção. Caracterização do processo produtivo. Estudo do tamanho. Determinação do investimento. Projeção de receitas e custos. Análise de retorno do investimento.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2375","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS5240":{"codigo":"EPS5240","nome":"Gerenciamento de Projetos","ementa":"O ciclo de vida do projeto. As funções administrativas no projeto. O gerente do projeto. Organização da equipe. Planejamento do projeto. Programação. Cronogramas. Rêdes. Orçamentos. Controle do projeto. Interligação do projeto com a empresa.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2351","prerequisito":"EPS7000 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7008":{"codigo":"EPS7008","nome":"Gestão Estratégica da Tecnologia da Informação","ementa":"Competitividade; Empresas Inteligentes (Gerenciamento na Era da Informação); Plano de ação em GC; Gestão da Informação e o Suporte à Decisão; Tecnologia da Informação e BI; Tecnologias da informação e GC; Implantação de Projetos de TI e GC.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2361","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7022":{"codigo":"EPS7022","nome":"Engenharia do Trabalho","ementa":"- Técnicas de registro e análise do processo. Metodologias de resolução de problemas. Análise do posto do trabalho. Programas de participação do trabalhador na melhoria dos métodos de trabalho. Medida do trabalho: cronometragem, amostragem do trabalho e tempos pré- prédeterminados. \nEscolas de organização do trabalho: escolas clássicas (Taylor e Ford), escola de  relações humanas (enriquecimento de cargos), escolas sócio-técnicas, grupos semi-autônomos.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EPS2372","prerequisito":"EPS2362 ou EPS7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7023":{"codigo":"EPS7023","nome":"Gestão e Avaliação da Qualidade","ementa":"- Qualidade total: conceitos; o planejamento e a gestão; modelos in-line, off-line e on-line; qualidade total em produtos e serviços; estratégias e ferramentas para a implantação da qualidade; avaliação da qualidade. Normalização e certificaão para a qualidade. Gráficos de controle. Inspeção por atributos e por variáveis. Planos de amostragem.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS2360 e EPS2381","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7031":{"codigo":"EPS7031","nome":"Monografia I","ementa":"- Planejamento técnico do trabalho junto com o orientador escolhido; Elaboração do cronograma do trabalho; Definição da metodologia e das ferramentas a serem empregadas no trabalho; Busca da literatura.","carga_horaria":18,"fase_sugestao":8,"equivalencia":"EPS2384","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT1401":{"codigo":"ZZT1401","nome":"Disciplinas Optativas","ementa":"","carga_horaria":72,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EPS7080":{"codigo":"EPS7080","nome":"Estágio Supervisionado em Engenharia de Produção","ementa":"","carga_horaria":306,"fase_sugestao":9,"equivalencia":"EPS5505 ou EPS7016 ou EPS7040","prerequisito":"EPS5235 e EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7024":{"codigo":"EPS7024","nome":"Métodos Quantitativos na Gestão da Produção Industrial","ementa":"Introdução: Teoria da Produção; fatores de produção; planejamento e controle da produção; caracterização dos sistemas de produção. 2 Linhas de Produção: Introdução e formulação do problema; procedimentos heurísticos; sequenciamento de linhas mistas (múltiplos produtos). Plano Mestre da Produção (16 horas-aula) - Introdução e objetivos; políticas de encomendas; modelos dinâmicos de determinação de lotes; métodos heurísticos; modelos considerando capacidade limitada. Programação da Produção:  Introdução e definição do problema; flow-shop com uma máquina; flow-shop com duas ou mais máquinas; job shop; regras de despacho. Planejamento de Materiais: Introdução; heurísticas para definição de lotes de material na produção com múltiplos estágios; cálculo das necessidades de material; MRP. Tecnologia de Grupo: Definições; codificação e classificação de peças; algoritmos de clusterização.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7025":{"codigo":"EPS7025","nome":"Projeto de Instalações","ementa":"- Unidades de uma instalação: produtiva e administrativa. Instalações e normas técnicas. Movimentação de materiais: conceito e equipamentos. Arranjo físico: conceito, tipos de arranjo físico, estudo do fluxo, dimensionamento, métodos para elaboração de arranjo físico, layout do almoxarifado, layout de células de produção. Manufatura celular. Segurança Industrial: Introdução e conceitos básicos. Legislação. Riscos ambientais.","carga_horaria":72,"fase_sugestao":10,"equivalencia":"EPS2341 e EPS2380","prerequisito":"(EPS2375 ou EPS5227) e (EPS2372 ou EPS7022)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7026":{"codigo":"EPS7026","nome":"Logística Empresarial","ementa":"- O ambiente de negócios. Conceito e evolução da logística. Cadeia de suprimentos (supply chain). O sistema logístico. Custos logísticos. Nível de serviço ao cliente. A logística de suprimento. A distribuição física de produtos. O subsistema transporte: os modais de transporte; característica e escolha do modal; os processos de coleta, transferência e distribuição. O subsistema armazém: funções e meios de armazenagem; unitização de cargas;sistemas de endereçamento dos produtos. O gerenciamento de estoques: classificação ABC, sistemática de re-suprimento.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS2370","prerequisito":"EPS5235 e (EPS2363 ou EPS7018)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7028":{"codigo":"EPS7028","nome":"Planejamento Estratégico","ementa":"- Planejamento estratégico e objetivo. Sistemas de planejamento estratégico. Sistemas de planos. O processo de planejamento estratégico. O subsistema de decisão para planejamento. Subsistema de informação e organização para planejamento. Subsistema de gerência para planejamento. Estratégia de marketing.","carga_horaria":54,"fase_sugestao":10,"equivalencia":"EPS5241","prerequisito":"EPS2363 ou EPS7018","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7029":{"codigo":"EPS7029","nome":"Ética e Exercício Profissional","ementa":"- Fundamentos: ética, sociabilidade e grupo profissional. Conduta: liberdade, igualdade, limites da ação, normas éticas e normas jurídicas, conduta individual, direitos e deveres. Obrigações e responsbilidades. Cidadania e organização profissional: cidadania, valorização profissional, organizações produtivas, organizações corporativas, organizações desenvolvedoras  instituições de ensino. Controle do exercício profissional: o estado, o sistema CONFEA\/CREA. Legislação profissional. Codificação ética da profissão.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1200,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7032":{"codigo":"EPS7032","nome":"Monografia II","ementa":"- Aplicação prática dos tópicos estudados no curso de Engenharia de Produção, na forma de projetos técnicos e\/ou científicos ao nível dos atribuídos a um engenheiro.","carga_horaria":18,"fase_sugestao":10,"equivalencia":"","prerequisito":"EPS7031","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CAD7232":{"codigo":"CAD7232","nome":"Estratégia Mercadológica","ementa":"Segmentação e posicionamento de Mercado; Sistema de Informação de Marketing; Tipologias e ferramentas de estratégias de marketing; O marketing de relacionamento e de serviço; Posturas estratégicas de marketing: de preço, de praça, de promoção e de produto. Planejamento e plano de marketing; Metodologias para a elaboração do plano de marketing; Tópicos emergentes de marketing: esportivo, social, marketing internacional, E-Marketing, e, universitário.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7013":{"codigo":"EEL7013","nome":"Laboratório de Transdutores","ementa":"Exercícios de laboratório explorando uma variedade de transdutores eletrônicos para medida de quantidades físicas como temperatura, força, deslocamento, som, luz e potencial iônico. Formas de aquisição de dados e visualização gráfica. Ruídos em transdutores.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7030":{"codigo":"EEL7030","nome":"Microprocessadores","ementa":"Arquiteturas de microprocessadores; programação de microprocessadores: tipo e formatos de instruções, modos de endereçamento; linguagens Assembly ou C; memória; entrada\/saída; dispositivos periféricos; interrupção; acesso direto a memória; barramentos padrões; ferramentas para análise, desenvolvimento e depuração; projetos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7060":{"codigo":"EEL7060","nome":"Conversão Eletromecânica de Energia (Teoria e Laboratório)","ementa":"Introdução e princípios de máquinas elétricas; transformadores: tipos, circuito equivalente, regulação e rendimento; máquinas síncronas: geradores síncronos, motores síncronos, teoria de máquinas síncronas de pólos salientes; motores de indução: circuito equivalente, potência e torque em motores trifásicos, métodos de partida do motor monofásico; máquinas de corrente contínua: máquinas elementares, máquinas reais, tensão gerada e torque, fliuxo de potência e perdas, geradores corrente contínua, motores corrente contínua; máquinas especiais: motor universal, outros tipos de motores especiais.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7062":{"codigo":"EEL7062","nome":"Princípios de Sistemas de Comunicação","ementa":"Análise e transmissão de sinais; modulações analógicas em amplitude e em frequência; multiplexação; ruído em sistemas de comunicação; modulação por pulso; conversão analógico-digital; transmissão digital em banda base e em banda passante.","carga_horaria":90,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7052 e EPS7000 e EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7074":{"codigo":"EEL7074","nome":"Eletrônica de Potencia I","ementa":"Revisão da teoria de potência elétrica e qualidade de energia em sistemas de corrente alternada. Semicondutores de potência (diodos, tiristores e transistores de potência): características estáticas e dinâmicas, cálculo térmico; retificadores a diodo; retificadores a tiristor e inversores não-autônomos; estudo da comutação; princípios de conversores duais; princípios de cicloconversores; princípios os de gradadores; Ábaco de Puschlowski; princípios de conversores CC-CC comutados em alta frequência; princípios de inversores comutados em alta frequência.","carga_horaria":90,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7081":{"codigo":"EEL7081","nome":"Aspectos de Segurança em Engenharia Elétrica","ementa":"Choque elétrico; descargas atmosféricas; tensão de choque; tensão de passo; coração humano; funcionamento elétrico do coração; fibrilação ventricular devido ao choque elétrico; desfibrilador elétrico; primeiros socorros; massagem cardíaca e respiração artificial; efeitos do choque elétrico no corpo humano; riscos do choque elétrico; análise das instalações elétricas; riscos em equipamentos hospitalares; legislação e normas regulamentadoras; segurança contra incêndios.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7072","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7083":{"codigo":"EEL7083","nome":"Energia Elétrica e Sustentabilidade","ementa":"Energia e Sociedade: O papel da energia no desenvolvimento moderno. Recursos energéticos e o uso do meio ambiente. Fontes de Energia (convencionais: carvão, nuclear, hidráulica, gás natural, óleo; não convencionais: biomassa, eólica, solar, fotovoltaica, solar térmica, ondas, marés, geotérmica, PCH). O conceito do desenvolvimento sustentado. A conservação de energia elétrica e benefícios associados. Conservação de energia elétrica e comportamento dos consumidores. Barreiras à conservação de energia elétrica. Eficiência Energética: índices e níveis. Uso final da energia elétrica: motores elétricos, iluminação, refrigeração, aquecimento. Técnicas e Métodos de conservação de energia elétrica. Auditorias energéticas. Potencial de conservação de energia elétrica no Brasil: Análise nos setores industrial, residencial e comercial. Eficiência energética em edificações. O planejamento de sistemas de energia elétrica pelo lado da oferta e pelo lado da demanda. Qualidade da energia elétrica e conservação. Avaliação econômica de programas de conservação de energia elétrica. Tarifação e conservação de energia. Perdas na geração, transmissão e distribuição de energia elétrica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"(FSC5002 e FSC5114) ou (FSC5114 e FSC5122) ou (FSC5002 e FSC5163) ou (FSC5122 e FSC5163)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7100":{"codigo":"EEL7100","nome":"Operação de Sistemas de Energia Elétrica","ementa":"Estrutura e tipos de estudos de operação de Sistemas Elétricos de Potência; Despacho Econômico de unidades térmicas; consideração de perdas de transmissão; Alocação Ótima de Unidades Geradoras; Fluxo de Potência Ótimo; Despacho Hidrotérmico; Geração renovável não tradicional: geração eólica e fotovoltaica; Controle de Geração e operação interligada; Modelagem em tempo real de sistemas de energia elétrica","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7101":{"codigo":"EEL7101","nome":"Dinâmica e Controle de Sistemas Elétricos de Potencia","ementa":"Aspectos gerais da dinâmica e controle de sistemas elétricos de potência. Características e modelagem de equipamentos. Sistemas de Controle. Estudos de Estabilidade. Síntese e Ajuste de Controladores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7102":{"codigo":"EEL7102","nome":"Sistema de Distribuição de Energia Elétrica","ementa":"A disciplina de Sistemas de Distribuição de Energia Elétrica é dividida em quatro etapas metodológicas:  \na. Aspectos tecnológicos de sistemas de distribuição & Projeto de Redes de Sistemas de Distribuição; \nb. Planejamento da Expansão de SD - modelos de previsão espacial de demanda, técnicas de otimização; \nc. Planejamento da Operação de SD: qualidade de serviços; perturbações e soluções corretivas; \nd. Automação de Redes de Distribuição & Manutenção em Sistemas de Distribuição.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7103":{"codigo":"EEL7103","nome":"Instalações Elétricas Industriais","ementa":"Partes constituintes de uma instalação elétrica industrial, dimensionamento e especificação de circuitos, proteção, dimensionamento e especificação de subestações, correção do fator de potência, cargas especiais e fontes de emergência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7100 ou (EEL7071 e EEL7072)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7104":{"codigo":"EEL7104","nome":"Planejamento e Regulação de Mercados de Energia Elétrica","ementa":"Por que planejar? Os três mundos da indústria da eletricidade \u0096 energia (mundo da média), potência (mundo do  \ninstantâneo) e comercialização (mundo do mercado). A Produção e o Consumo de Energia Elétrica. O Problema do  \nPlanejamento da Operação Energética de um Sistema de Energia Elétrica. O Planejamento da Operação Energética no Brasil. Restruturação do Modelo Institucional do Setor Elétrico. Modelo Vigente. Formação de Preço, Contabilização e Liquidação. Gerenciamento de Riscos de Mercado.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7105":{"codigo":"EEL7105","nome":"Planejamento da Operação de Sistemas de Energia Elétrica","ementa":"Objetivos do planejamento da operação; subdivisões do problema; despacho econômico; fluxo de potência ótimo usando modelo linearizado da rede; alocação ótima de unidades; coordenação hidrotérmica; operação interligada de sistemas de potência; introdução à operação em ambiente desregulamentado.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7100","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7106":{"codigo":"EEL7106","nome":"Proteção de Sistemas Elétricos","ementa":"Introdução ao sistema de aterramento; Medição da resistividade do solo; Estratificação do solo; Sistemas de aterramento; Tratamento químico do solo; Quesitos de segurança; Malha de aterramento; Medida de resistência de terra; Corrosão no sistema de aterramento; Surtos de tensão no aterramento; Transformador de corrente e potencial; Proteção de subcorrente; Religamento; Relé direcional; Proteção de distância; Proteção diferencial; Proteção de transformadores; Proteção da geração; Teleproteção.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7107":{"codigo":"EEL7107","nome":"Transmissão de Energia Elétrica","ementa":"Estudo de modelos, cálculo de parâmetros e operação das linhas de transmissão; Planejamento, aspectos mecânicos, e efeitos ambientais na transmissão de energia elétrica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7071","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7120":{"codigo":"EEL7120","nome":"Introdução à Microeletrônica","ementa":"Parte 1: Introdução; Princípios de Cristalografia; Defeitos cristalinos; Difusão; Oxidação térmica do silício; Implantação iônica; Deposição de filmes (Czochralski, MBE, MOCVD, PVD, LPE e sol-gel); Fotolitografia; Processos de fabricação MOS e bipolar. Atualização: Lei de Moore. \nParte 2: Visão geral do processo de fabricação, Layout de componentes passivos; Layout de transistores; Regras de projeto; Layout de células básicas analógicas e digitais; Layout de células mistas; Floorplanning; Metodologias de projeto digital. \nParte 3: Transistores MOS, CMOS, Elementos de tecnologia, Introdução à álgebra de Boole, Funções Lógicas, Quadros de Karnaugh, Agrupamento de minitermos e maxitermos, Introdução aos circuitos combinatórios, Tempos de propagação, Descodificadores e multiplexadores, Somadores e subtratores, Multiplicadores e divisores, Latches, Flip-Flops, Caracterização temporal, Contadores, Registradores, Síntese de circuitos sequenciais, Circuito de Dados e Circuito de Controlo, Controlo por ROM, Controlo por ROM com endereçamento explicito.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7200":{"codigo":"EEL7200","nome":"Eletrônica de Potencia II","ementa":"Introdução ao estudo dos semicondutores de potência com chaveamento controlado: Transistor Bipolar de Potência, MOSFET de Potência e IGBT. Estudo dos Conversores CC-CC: Conversor CC-CC abaixador de tensão (Buck); Conversor CC-CC elevador de tensão (Boost); Conversor CC-CC à acumulação de energia, Conversor Buck-Boost e Conversor Cúk; Reversibilidade dos Conversores CC-CC. Conversores CC-CC Isolados (Forward, Flyback, Push-Pull, Meia-Ponte e Ponte Completa). Conversores CC-CA (Inversores Autônomos): Conversores CC-CA de tensão; Conversores CC-CA de corrente; Controle de tensão nos Conversores CC-CA; Filtro de saída nos conversores CC-CA de tensão com modulação PWM; Conversores CC-CA regulados em Corrente.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7073 e EEL7074","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7201":{"codigo":"EEL7201","nome":"Aspectos Construtivos e Analise de Maquinas Elétricas","ementa":"Introdução; teoria de eixos de referência; teoria das máquinas de indução trifásicas simétricas; máquina de ímãs permanentes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7200","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7203":{"codigo":"EEL7203","nome":"Projeto de Fontes Chaveadas","ementa":"Retificadores monofásicos com filtro capacitivo; Retificadores monofásicos com coreção ativa do fator de potência; Estágio de entrada: retificador monofásico, retificador trifásico, filtro capacitivo de entrada. Topologias dos conversores para fontes chaveadas isoladas: flyback, forward, meia-ponte, ponte completa, push-pull. Comando, comutação e proteção de semicondutores de potência, com ênfase ao MOSFET e IGBT. Circuitos de comando, controle e proteção de fontes chaveadas, incluindo fontes auxiliares. Resposta transitória e estabilidade. Projeto de transformadores e indutores de alta frequência. Análise e filtragem de radio-interferência causada por fontes chaveadas. Caracterização e especificação de capacitores para alta frequência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7200","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7210":{"codigo":"EEL7210","nome":"Modelagem Eletromagnética","ementa":"Introdução ao Eletromagnetismo aplicado a casos reais: revisão de eletrostática, magnetostática, magnetodinâmica e ondas eletromagnéticas; circuitos magnéticos lineares e não-lineares; analogia entre circuitos elétricos e magnéticos; ímãs permanentes; equações de Laplace e de Poisson para campos eletromagnéticos; tensor de Maxwell; cálculo de forças a partir da variação de energia; projeto analítico de circuitos magnéticos lineares e não-lineares; análise através de indutâncias, energia e forças magnetomotrizes; métodos computacionais para cálculo de campos; aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7053","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7211":{"codigo":"EEL7211","nome":"Elementos Finitos em Engenharia Elétrica","ementa":"Equações de Laplace e Poisson relativas a Campos Eletromagnéticos; discretização; método residual de Galerkin; geração e resolução de sistemas matriciais; os setores de pré - e pós-processamento; aplicação do método aos problemas em potencial escalar e magnético; aplicação aos problemas em potencial vetor; campos eletrostáticos em meios isolantes; aplicação em meios condutores; casos de campos magnéticos com potencial escalar, campos magnéticos em potencial vetor; projetos e otimização de estruturas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7210","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7212":{"codigo":"EEL7212","nome":"Introdução a Compatibilidade Eletromagnética","ementa":"Introdução; história dos CEM, normas; princípios eletromagnéticos básicos; não-linearidades dos componentes eletrônicos; espectro de sinais; emissões irradiadas e suscetibilidades; emissões conduzidas e suscetibilidades; diafonia; blindagens; descargas eletrostáticas; projetos para compatibilidade eletromagnética (placas de circuito impresso, aterramento, disposição lógica, filtros, etc.); aplicações em laboratório (paradiafonia, descargas eletrostáticas, blindagem de campos, interferências conduzidas, supressores de transiente e filtros).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7074","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7300":{"codigo":"EEL7300","nome":"Instrumentação Eletrônica","ementa":"Sensores e transdutores; aplicações do amplificador operacional; fontes de alimentação reguladas; circuitos de amostragem\/retenção; conversor digital\/analógico; conversor analógico\/digital; blocos eletrônicos analógicos.","carga_horaria":90,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7020 e EEL7061","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7301":{"codigo":"EEL7301","nome":"Circuitos Eletrônicos Digitais","ementa":"Características estáticas e dinâmicas de circuitos digitais; o circuito inversor; lógicas combinacionais CMOS estática, pseudo nMOS e com transistores de passagem; lógicas combinacionais dinâmicas; circuitos sequenciais; ROM e RAM estática e dinâmica; lógicas com transistor bipolar; introdução ao projeto de circuitos integrados digitais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7300","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7302":{"codigo":"EEL7302","nome":"Projeto de Sistemas Digitais em PLDs","ementa":"Introdução aos PLDs; arquitetura da família MAX7000 da Altera; Max+Plus II: ferramenta de desenvolvimento para PLDs; introdução à VHDL (VHSIC Hardware Description Language); projeto de aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7300","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7303":{"codigo":"EEL7303","nome":"Circuitos Eletrônicos Analógicos","ementa":"Amplificadores multi-estágios; ruído em circuitos analógicos; amplificadores diferenciais; espelhos de corrente;  \nestágios de saída e amplificadores de potência; resposta em frequência de amplificadores; referências de  \ncorrente e tensão; circuitos com amplificadores operacionais; circuitos realimentados; osciladores.","carga_horaria":90,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7052 e EEL7300","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7304":{"codigo":"EEL7304","nome":"Filtros Analógicos","ementa":"Tipos de sinais e de processadores; filtros seletores de sinais; aproximações; equalização de fase; transformações em frequência e escalamentos; sensibilidade; filtros analógicos contínuos; filtros analógicos amostrados; noções de sintonia automática; osciladores sinusoidais; multivibradores e temporizadores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7303","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7400":{"codigo":"EEL7400","nome":"Telecomunicações: Teoria e Fundamentos","ementa":"Princípios básicos: histórico, sistemas analógicos e digitais, multiplexação; comunicação com fio: linhas telefônicas, cabo coaxial, fibras ópticas; comunicação sem fio: rádio-transmissão, o sistema celular, o sistema paging, comunicação por satélite, aplicações; redes de comunicação: redes de dados, redes de área local, redes digitais de serviços integrados (ISDN).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7053 e EEL7062","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7401":{"codigo":"EEL7401","nome":"Teoria da Informação","ementa":"Estatística e teoria da informação; os pontos extremos da teoria da comunicação: compressão de dados ao limite da entropia e comunicação no limite da capacidade do canal; complexidade de Kolmogorov; entropia de Shannon; teoria da taxa de distorção; códigos randômicos e de Huffman; tratamento unificado baseado no Teorema da Equipartição Assintótica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7402":{"codigo":"EEL7402","nome":"Redes Comunicação de Computadores","ementa":"Aplicações de redes de computadores; arquitetura de redes; topologia de redes; análise de conectividade; análise de atrasos; projeto de acesso local; camada física; camada de link de dados; protocolos de camada superior; roteamento; controle de fluxo; controle de congestionamento; redes de área local.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7403":{"codigo":"EEL7403","nome":"Comunicações Moveis","ementa":"Introdução aos sistemas de comunicação sem fio; o conceito de celular; o modelo de propagação em um ambiente rádio-móvel; os efeitos de propagação por multipercurso; técnicas de modulação para rádio móvel; equalização; diversidade e codificação do canal; técnicas de múltiplos acessos para comunicações móveis; os diversos padrões dos sistemas de comunicação sem fio.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7404":{"codigo":"EEL7404","nome":"Sistemas de Comunicações Ópticas","ementa":"Introdução; transmissão em fibras ópticas; fontes ópticas e transmissores; detectores ópticos e receptores; sistemas de comunicações ópticas; tópicos atuais em sistemas de comunicações ópticas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7405":{"codigo":"EEL7405","nome":"Comunicação Digital","ementa":"Introdução; noções de processamento de sinais estocásticos; limites da comunicação; técnicas de modulação digital: DETALHAR; detecção; equalização; sincronização; técnicas de múltiplos acessos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7406":{"codigo":"EEL7406","nome":"Engenharia de Microondas","ementa":"Teoria de linhas de transmissão; guias de onda retangulares e circulares; descontinuidades e perdas em guias de ondas; cavidades ressonantes e fator de qualidade; filtros passa-baixos, passa-faixa e passa-altos; microstrip; característica de impedância e constante de propagação, acoplamento, indutores, capacitores; CAD, projeto de linhas e acoplamentos; sistemas de micro-ondas, fontes, receptores, cargas, amplificadores, ruído, acoplamentos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7407":{"codigo":"EEL7407","nome":"Engenharia de Antenas","ementa":"Conceitos básicos; a antena isotrópica; o dipolo infinitesimal; parâmetros principais das antenas; diferentes tipos de antenas (filamentares, diretivas, de banda larga, refletoras, de abertura, impressas, etc.); arranjos de antenas; casadores e baluns; cálculo de radioenlaces (fórmula de Friis, equação de radar e atenuação em obstáculos).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7400","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7500":{"codigo":"EEL7500","nome":"Fundamentos de Controle e Processamento de Sinais","ementa":"Análise no espaço de estados; introdução ao projeto no espaço de estados; introdução a técnicas avançadas de projeto: controle ótimo, controle adaptativo, controle robusto e controle difuso; introdução a técnicas de processamento de sinais; aplicações de processamento de sinais: processamento de sinais de voz e de imagem, filtragem adaptativa, processamento de sinais biomédicos, outras aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5317 ou EEL7063","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7501":{"codigo":"EEL7501","nome":"Projeto no Espaço de Estados","ementa":"Realimentação de estados. Projeto por posicionamento de pólos. Projeto de observadores. Realimentação usando observadores. O problema do regulador quadrático linear (LQG). O problema do regulador quadrático gaussiano (LQG).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7500","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7502":{"codigo":"EEL7502","nome":"Técnicas Avançadas de Controle","ementa":"Controle robusto: conceitos básicos, modelagem, estabilidade robusta. Controles H2 e Hoo.  Controle adaptativo: conceitos básicos; esquemas de controle adaptativo. Técnicas de identificação de sistemas. O controle adaptativo auto ajustável. Técnicas de controle adaptativo: posicionamento de polos, variância mínima, variância mínima generalizada e controle preditivo generalizado. Controle difuso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7500","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7503":{"codigo":"EEL7503","nome":"Introdução ao Processamento Digital de Sinais","ementa":"Sinais e processamento de sinais; representação de sinais e sistemas digitais no domínio do tempo; representação de sinais e sistemas digitais no domínio da freqüência; processamento digital de sinais contínuos; estruturas de filtragem digital; projeto de filtros digitais; implementação de sistemas de processamento digital de sinais; aplicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7500","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7504":{"codigo":"EEL7504","nome":"Processamento Adaptativo de Sinais","ementa":"Introdução aos sistemas adaptativos; filtros adaptativos; estruturas de sistemas adaptativos: filtro e algoritmo de adaptação; classes de aplicações de filtragem adaptativa: identificação, modelagem inversa, predição e cancelamento de interferências; processador linear adaptativo; função custo; matriz de autocorrelação; minimização de uma função custo quadrática; o algoritmo LMS; outros algoritmos adaptativos; aplicações: identificação de sistemas, estimação de parâmetros, equalização adaptativa, cancelamento de interferência, codificação de sinais de voz, modulação PCM adaptativa, análise espectral, detecção de sinais, cancelamento de ruído, cancelamento de ecos, filtragem espacial adaptativa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7500","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7505":{"codigo":"EEL7505","nome":"Tópico Avançado em  Processamento Digitais de Sinais","ementa":"Processamento de sinais aleatórios: análise espectral, correlação, ruído; processamento unidimensional (processamento de voz, áudio, sinais biomédicos); processamento bidimensional (processamento de imagens e vídeo); técnicas de codificação de sinais; processamento adaptativo de sinais; processamento de sinais usando redes neurais e lógica difusa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7503","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7600":{"codigo":"EEL7600","nome":"Fundamentos de Gestao Empresarial","ementa":"Gerenciamento empresarial: introdução e objetivos; perfil do profissional de Engenharia Elétrica; gerenciamento de empresas em ambientes globalizados; níveis de globalização e objetivos empresariais; novos padrões de competitividade; qualidade; gerenciamento da qualidade total; análise dos ambientes interno e externo de uma organização; gerenciamento de mudanças organizacionais; planejamento estratégico em uma organização; técnicas e tendências; estratégias em ambientes desregulamentados: o caso do setor elétrico brasileiro; marketing em tempos de globalização; planejamento e técnicas de implementação; alianças estratégicas entre organizações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5222","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7601":{"codigo":"EEL7601","nome":"Telecomunicações: Gerencia e Negócios","ementa":"Telecomunicações, oportunidades e desafios; fundamentos de redes de telecomunicações; terminais e estações de trabalho; link de transmissão; métodos de transmissão; escolha de oportunidades; definição de plataforma em telecomunicações; casos econômicos; a indústria das telecomunicações; gerência de redes; qualidade total das operações; gerenciamento de custos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EEL7600","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5013":{"codigo":"EGC5013","nome":"Gestão do Conhecimento nas Organizações","ementa":"Conceitos, histórico (dados, informação e conhecimento). Diretrizes e recomendações básicas e principais abordagens utilizadas na gestão do conhecimento. Criação do conhecimento: formatos e conversões. Facilitadores do trabalho com o formato tácito e explícito do conhecimento. Aplicações da tecnologia da informação na gestão do conhecimento. Aplicação da gestão do conhecimento na organização por meio de seus processos empresariais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5263":{"codigo":"EGC5263","nome":"Finanças Pessoais","ementa":"Planejamento financeiro; processo de planejamento financeiro pessoal, objetivos, necessidades e prioridades do cliente; nível de tolerância ao risco; coleta de dados; relacionamento com o mercado e instituições; desenvolvimento e apresentação de um plano financeiro; implementação e monitoramento. \n  \nPROGRAMA \n1. Comportamento humano: personalidade e resistências a mudanças; perfis psicológicos; fatores restritivos da personalidade; administrando as emoções e os conflitos. \n2. Valores culturais e a personalidade, stress, mudanças e plano de ação. \n3. Operações de Crédito; Conceitos básicos de crédito. \n4. Análise e seleção de seguros e previdência privada; conceitos básicos de seguros; riscos e exposição ao risco; seguros de pessoas; seguro de vida; seguro saúde. \n5. Fundamentos de previdência privada; benefícios; previdência social e previdência privada; órgãos regulatórios; características específicas; perfil do investidor. \n6. Investimento imobiliário. \n7. Investimento e gestão de risco; Intermediação financeira; eficiência dos mercados e instituições financeiras; Alocação patrimonial  (asset allocation). Avaliação dos principais produtos financeiros negociados no mercado; fundos de investimentos; mercado de títulos de renda fixa e de renda variável no Brasil. \n8. Investimento em Tesouro Direto. \n9. Investimento em Renda Variável \u0096 ações. \n10. Comportamento do investidor perante o risco; teoria de carteiras; diversificação; opções; derivativos; riscos com derivativos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS2383":{"codigo":"EPS2383","nome":"Manutenção e Confiabilidade","ementa":"Medidas de confiabilidade e distribuições de tempo de vida. Confiabilidade de componentes em série e paralelo. \nFMEA e FTA. A função manutenção. Manutenção Corretiva. Manutenção Preventiva. Manutenção Preditiva. \nManutenção Centrada em Confiabilidade. Manutenção Produtiva Total.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC5351","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5115":{"codigo":"EPS5115","nome":"Pesquisa Operacional III","ementa":"Familiarização com conceitos e técnicas de teoria de grafos: definições básicas; árvores; problemas de cobertura e partição de conjuntos; problemas de p-medianas e p-centros; coloração de grafos; algoritmos de busca e caminhos mínimos; fluxos em redes; problemas Eulerianos e Hamiltoneanos; emparelhamento. Métodos meta-heurísticos: busca tabu, algoritmo genético, simulated annealing, ant systems. Aplicações.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS5141":{"codigo":"EPS5141","nome":"Tópicos Especiais em Pesquisa Operacional","ementa":"Estudo de caso com aplicações de técnicas de Pesquisa Operacional. \n- Artigos diversos publicados em revistas sobre temas relacionados com os estudos de caso \nrealizados.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7011":{"codigo":"EPS7011","nome":"Programa de Intercâmbio I","ementa":"Participação em Programas de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agência de Fomento, Centros de Pesquisa e instituições semelhantes - visando à realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovado pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7012":{"codigo":"EPS7012","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programas de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7013":{"codigo":"EPS7013","nome":"Empreendedorismo","ementa":"- A formação da Personalidade; O processo comportamental; As necessidades do empreendedor; O conhecimento para empreender; O empreendedor e suas habilidades; Os valores do empreendedor; O processo evolutivo das empresas; Modelos de Ciclo de Vida; A personalidade do empreendedor e o ciclo de vida da organização.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7018","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7014":{"codigo":"EPS7014","nome":"Redes de Empresa","ementa":"Globalização e Competitividade, Competitividade Regional, Aglomerações Produtivas, Redes e Consórcios de Empresas, Cadeias de Fornecedores.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7015":{"codigo":"EPS7015","nome":"Engenharia de Serviços","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021 e EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7030":{"codigo":"EPS7030","nome":"Finanças","ementa":"Introdução a moderna teoria de investimentos, títulos e mercados. Conceitos estatísticos para gestão de carteiras: retorno médio, desvio padrão, variância, covariância, grau de correlação. Carteira eficiente. Relação entre risco, retor-no esperado e medidas de desempenho. Mercado de capitais e carteira do mercado","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7033":{"codigo":"EPS7033","nome":"Gestão da Inovação","ementa":"Inovação: Definição e Perspectivas; Processo de Inovação: Conceito, Fases e Gerenciamento - Criação, Adoção, Implementação e Disseminação da Inovação; Formulação de Estratégias; Inovação em Serviços, Geração e Avaliação de Idéias.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EGC5018","prerequisito":"EPS7008","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7035":{"codigo":"EPS7035","nome":"Avaliação de Desempenho","ementa":"- Conceito e evolução das técnicas de Avaliação de Desempenho. Métodos Locais - Estatísticos, Mapas, Gráficos, Diagramas e Pareto. Métodos Corporativos - BSC, Baldrige, FPNQ, Nevada,Hronec, McKinsey 7-S, etc. Métodos Construtivistas - SSM, MCDA-C. Estruturação - Contextualização, Elementos Primários de Avaliação, Conceitos, Mapas meio-fim, Árvore de Valor, descritores, níveis âncora. Avaliação - função de valor, independência, taxas, perfil de desempenho. Recomendações - análise de sensibilidade, processo gerador de ações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7036":{"codigo":"EPS7036","nome":"Atividades Complementares A","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7037":{"codigo":"EPS7037","nome":"Atividades Complementares B","ementa":"- Atividades extra-classe, realizadas na forma de pesquisa e\/ou extensão, vinculadas aos departamentos de ensino envolvidos no curso, sob a orientação de professor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7038":{"codigo":"EPS7038","nome":"Sistemas de Produção Enxutos","ementa":"Origens, visão geral do Sistema Toyota de Produção (STP). O Mecanismo da Função Produção: a função processo e a função operação. Princípios da Manufatura Enxuta. Valor e desperdícios no sistema produtivo. Mapeamento de fluxo de valor. Tempo Takt. Inventário. Supermercado. Troca rápida de ferramentas (TRF). Fluxo contínuo. Células. Balanceamento de linha, Trabalho padronizado, TPM, Sistemas Canban, Linha FIFO, Programação de produção,  Controle de qualidade zero defeitos e poka-yokes, gerenciamento visual e kaizen (melhoria contínua). Implantação da Manufatura Enxuta. Desenvolvimento Enxuto.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7039":{"codigo":"EPS7039","nome":"Projeto para Manufatura Enxuta","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7043":{"codigo":"EPS7043","nome":"Usabilidade e Projeto de Produtos","ementa":"Introdução ao conceito de Usabilidade. Componentes da usabilidade. As medidas da usabilidade: eficiência e eficácia. As normas de usabilidade. Princípios de projeto centrado no usuário. Especificando as características do usuário.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7044":{"codigo":"EPS7044","nome":"Sistemas de Gestão e Garantia da Qualidade e Meio Ambiente","ementa":"Introdução a Sistemas de Gestão e Garantia da Qualidade e Meio Ambiente; Princípios da Gestão e Garantia da Qualidade; Sistemas de Gestão Baseado em Normas; Auditoria da Qualidade","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7045":{"codigo":"EPS7045","nome":"Princípios do Programa Seis Sigma","ementa":"Bases do programa seis sigma; Projetos seis sigma para a melhoria da qualidade e produtividade; Implementação do programa seis sigma; Outras aplicações do seis sigma","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7050":{"codigo":"EPS7050","nome":"Tópicos Especiais em Gestão da Produção","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7051":{"codigo":"EPS7051","nome":"Tópicos Especiais em Engenharia Econômica","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7019","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7052":{"codigo":"EPS7052","nome":"Tópicos Especiais em Engenharia Organizacional","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7053":{"codigo":"EPS7053","nome":"Tópicos Especiais em Engenharia da Qualidade","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7023","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7054":{"codigo":"EPS7054","nome":"Tópicos Especiais em Transporte e Logística","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7055":{"codigo":"EPS7055","nome":"Tópicos Especiais em Engenharia do Produto","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7056":{"codigo":"EPS7056","nome":"Jogos de Empresas","ementa":"Fundamentos da Teoria de Decisão - Modelos Básicos da Teoria dos Jogos - Conceituação e Caracterização de Jogos de Empresas - Estruturação de Processos de Decisão - Modelos de Avaliação de Resultados - Aplicação Prática de Jogo de Empresas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EPS7046","prerequisito":"EPS5234","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7062":{"codigo":"EPS7062","nome":"Desenvolvimento de Ideias e Modelagem Prática do Negócio","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7065":{"codigo":"EPS7065","nome":"Análise de Dados e Introdução ao Aprendizado - Máquina","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7066":{"codigo":"EPS7066","nome":"Introduction to Data Science and Machine Learning","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7000 e EPS7001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7067":{"codigo":"EPS7067","nome":"Principles of Six Sigma Program","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS0323","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7068":{"codigo":"EPS7068","nome":"Gerenciamento de Projetos II","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS5240","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7070":{"codigo":"EPS7070","nome":"Tópicos Especiais em Simulação","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EPS7002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7075":{"codigo":"EPS7075","nome":"Economia Circular","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EPS0423","prerequisito":"EPS7060","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FSC5207":{"codigo":"FSC5207","nome":"Mecânica II - Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Dinâmica da partícula e do corpo rígido.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC5361","prerequisito":"(FSC5101 e MTM3102) ou (FSC5102 e MTM5162)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LLV5178":{"codigo":"LLV5178","nome":"Redação Técnica","ementa":"Redação técnica: anotações, esquemas, sínteses, resumo, sinopse, curriculum vitae, descrição técnica, relatório técnico, análise e classificação, resumo crítico, dissertação, monografia, pesquisa; auxiliares lingüísticos: premissas, silogismos, dedução e indução, razão e conseqüência, encadeamento, seqüência, progressão, definição e generalização; estruturas de expressão: fim, causa, lugar, tempo, comparação, correlação, paralelismo, analogia, etc.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LLE7881","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"PSI5112":{"codigo":"PSI5112","nome":"Relações Humanas","ementa":"A personalidade humana. Os grupos e sua dinâmica, a comunicação e seus problemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"PSI5205":{"codigo":"PSI5205","nome":"Psicologia Organizacional","ementa":"Processos humanos nas organizações. Integração indivíduo X organização. Organização como contexto social. Poder nas organizações e administração de conflitos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"PSI7002","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}}}}