{"codigo":220,"nome":"ENGENHARIA DE CONTROLE E AUTOMAÇÃO","sigla_centro":"CTC","sigla_departamento":"DAS","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"19892":19892,"19911":19911,"20241":20241},"situacao":0,"situacao_descricao":"regular","num_vagas_total":360,"num_vagas_primeiro_semestre":36,"num_vagas_segundo_semestre":36,"presencial":true,"curriculos":{"19892":{"id":"131","codigo":19892,"codigo_curso":220,"carga_horaria_ufsc":4284,"carga_horaria_mec":3600,"aulas_semana_min":13,"aulas_semana_esperado":25,"aulas_semana_max":30,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19892 (EXTINTO)","ucs":[]},"19911":{"id":"257","codigo":19911,"codigo_curso":220,"carga_horaria_ufsc":4338,"carga_horaria_mec":4320,"aulas_semana_min":14,"aulas_semana_esperado":26,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 19911","ucs":{"DAS5334":{"codigo":"DAS5334","nome":"Introdução à Informática para Automação","ementa":"Princípios gerais da Informática: princípios gerais de concepção de um programa de computador; técnicas de modularização; linguagens de programação; carcterísticas gerais; aplicação de uma linguagem de alto nível; aplicação da informática à automação industrial.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"INE5208","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5411":{"codigo":"DAS5411","nome":"Introdução à  Engenharia de Controle e Automação","ementa":"Palestras sobre engenharia de controle e automação. Funções do engenheiro no contexto tecnológico e social. Palestras sobre o curso de engenharia de controle e automação. Visitas aos laboratórios. Equipamentos básicos. Conceitos básicos de controle e automação. Metodologias e ferramentas da engenharia.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"DAS5412","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECZ5102":{"codigo":"ECZ5102","nome":"Conservação de Recursos Naturais","ementa":"Estrutura, funcionamento e dinâmica de ecossistemas. Efeito da ação antrópica sobre os ecossistemas. Legislação e Conservação dos recursos naturais.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5606":{"codigo":"EGR5606","nome":"Desenho Técnico para Automação","ementa":"Introdução ao desenho técnico a mão livre. Normas para o Desenho Técnico. Técnicas fundamentais de traçado a mão livre. Sistemas de representação: 1º e 3º diedros. Projeção ortogonal de peças simples. Vistas omitidas. Contagem e proporções. Perspectivas axonométricas, isométricas, bimétrica, trimétrica. Perspectiva cavaleira. Esboços cotados. Introdução ao CAD. Contagem. Noções de cortes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EGR5604","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5101":{"codigo":"FSC5101","nome":"Física I","ementa":"Introdução aos conceitos fundamentais da cinemática, dinâmica e estática. Leis de conservação da energia e do momento linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"FSC1101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3110":{"codigo":"MTM3110","nome":"Cálculo 1","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101 ou MTM5161 ou MTM5801","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5102":{"codigo":"DAS5102","nome":"Fundamentos da Estrutura da Informação","ementa":"Estrutura da informação. Vetores; Listas (alocação seqüencial, alocação encadeada); Árvores. Tabelas. Grafos: representações, distâncias, caminho mínimo. Tipos abstratos de dados; programação orientada a objetos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"INE5212","prerequisito":"DAS5334","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5105":{"codigo":"EEL5105","nome":"Circuitos e Técnicas Digitais","ementa":"Sistemas de numeração e códigos numéricos. Álgebra Booleana. Funções e portas lógicas. Portas lógicas CMOS. Síntese e otimização de circuitos lógicos. Circuitos combinacionais. Circuitos sequenciais. Máquinas de estados finitos. Relógio e temporização. Modelo bloco operativo\/bloco de controle. Introdução às linguagens de descrição de hardware (HDL). Dispositivos lógicos programáveis.","carga_horaria":90,"fase_sugestao":2,"equivalencia":"EEL7020","prerequisito":"DAS5334","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5002":{"codigo":"FSC5002","nome":"Física II","ementa":"Estudo da Cinemática e Dinâmica da rotação de corpos rígidos. Oscilações e ondas Mecânicas(som). Estática e Dinãmica dos Fluídos. Noções sobre temperatura, calor, princípios da Termodiâmica e teoria cinética dos gases.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"FSC5132","prerequisito":"(FSC5101 e MTM3110) ou (FSC5101 e MTM3101) ou (FSC5101 e MTM5161)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5122":{"codigo":"FSC5122","nome":"Física Experimental I","ementa":"Complementação  dos conteúdos de mecânica, acústica, termologia. Obtida através de montagem e realização de experiências, em número de 12 (doze), versando sobre os tópicos acima.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"FSC1122","prerequisito":"FSC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3120":{"codigo":"MTM3120","nome":"Cálculo 2","ementa":"Aplicações da integral definida. Técnicas de integração (por partes, substituição trigonométrica, frações parciais). Integral imprópria. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies. Funções de várias variáveis. Derivadas parciais. Máximos e mínimos de funções de duas variáveis.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"(MTM3102 e MTM3111) ou (MTM3111 e MTM5162) ou (MTM3102 e MTM5512) ou (MTM5162 e MTM5512) ou MTM5803","prerequisito":"MTM3101 ou MTM3110 ou MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3121":{"codigo":"MTM3121","nome":"Álgebra Linear","ementa":"Matrizes. Determinantes. Sistemas lineares. Espaço vetorial real. Produto interno. Transformações lineares. Autovalores e autovetores de um operador linear. Diagonalização. Aplicações da Álgebra Linear.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3112 ou MTM5245 ou MTM5812","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5210":{"codigo":"DAS5210","nome":"Introdução ao Controle de Processos","ementa":"-Introdução da problemática de controle de processos: visão intuitiva, motivação prática e exemplos de aplicações. Conceitos básicos: modelos estáticos e dinâmicos, variáveis manipuladas e controladas, perturbações, ponto de operação, sinais de referência, realimentação e pré-alimentação. Revisão e introdução de noções básicas de Física e Cálculo aplicadas ao Controle de Processos; noções de linearidade e linearização, máximos e mínimos de funções. Ações de controle básicas: proporcional, integral e derivativa; ajuste de controladores com métodos empíricos; exemplos práticos e simulações numéricas. Outros conceitos e ferramentas: controle por camadas, escolha de referências e pontos de operação baseada em critérios de custo econômico ou de energia. Laboratório: 18 h.a.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"DAS5110 ou DAS5112","prerequisito":"(DAS5411 e FSC5101 e MTM3101) ou (DAS5411 e FSC5101 e MTM3110) ou (DAS5412 e FSC5101 e MTM3101) ou (DAS5412 e FSC5101 e MTM3110)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5332":{"codigo":"DAS5332","nome":"Arquitetura e Programação de Sistemas Microcontrolados","ementa":"Arquiteturas de microprocessadores. Programação de microprocessadores: tipos e formatos de instruções, modos de endereçamento, linguagens Assembly ou C. Memória. Entrada\/Saída. Dispositivos periféricos, interrupção, acesso direto a memória. Barramento padrões. Ferramentas para análise, desenvolvimento e depuração. Projetos com microprocessadores. Laboratório: 36 h.a. - Programação, uso de ferramentas de análise, desenvolvimento e depuração. Projeto de aplicações com microprocessadores","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EEL7030","prerequisito":"EEL5105 ou EEL7020","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECV5215":{"codigo":"ECV5215","nome":"Mecânica dos Sólidos I","ementa":"Solicitações internas: vinculação, reações, esforços solicitantes, diagramas. Tensão e deformação em carregamentos axiais. Cisalhamento puro: tensão em ligações, distorção. Torção. Flexão simples: propriedades geométricas de seções transversais de vigas, estudo das tensões. Cisalhamento em vigas longas.  Solicitações compostas.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"","prerequisito":"(FSC5002 e MTM3120) ou (FSC5002 e MTM3102) ou (FSC5002 e MTM5162) ou (FSC5132 e MTM3120) ou (FSC5132 e MTM3102) ou (FSC5132 e MTM5162)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5113":{"codigo":"FSC5113","nome":"Física III","ementa":"Análise dos principais fenômenos da eletricidade  e magnetismo abrangendo o estudo de campo elétrico, potencial elétrico, capacitor, corrente elétrica, força eletromotriz, campo magnético e indução eletromagnética.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"FSC5133","prerequisito":"FSC5002 ou FSC5132","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3103":{"codigo":"MTM3103","nome":"Cálculo 3","ementa":"Integração múltipla: integrais duplas e triplas. Noções de cálculo vetorial: curvas e superfícies. Campos escalares e vetoriais. Integrais de linha e de superfícies. Teoremas de Green, Stokes e da Divergência.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM5163 ou MTM5804","prerequisito":"MTM3102 ou MTM3120 ou MTM5162","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3131":{"codigo":"MTM3131","nome":"Equações Diferenciais Ordinárias","ementa":"Equações diferenciais ordinárias de primeira ordem. Equações diferenciais ordinárias lineares homogêneas de ordem n. Equações diferenciais ordinárias lineares não homogêneas de ordem 2. Noções gerais de Transformada de Laplace. Sistemas de Equações Diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM3102 ou MTM5163 ou MTM5814","prerequisito":"(MTM3120 e MTM3121) ou (MTM3112 e MTM3120) ou (MTM3120 e MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5103":{"codigo":"DAS5103","nome":"Cálculo Numérico para Controle e Automação","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante.Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Métodos dos mínimos quadrados e otimização quadrática. Integração numérica. Solução numérica de equações diferenciais e simulação numérica. Aplicações a problemas de controle e automação envolvendo implementações computacionais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"INE5207","prerequisito":"(DAS5102 e MTM3110 e MTM3121) ou (DAS5102 e MTM3110 e MTM3112) ou (DAS5102 e MTM3110 e MTM5245) ou (DAS5102 e MTM3101 e MTM3121) ou (DAS5102 e MTM3101 e MTM3112) ou (DAS5102 e MTM3101 e MTM5245)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5214":{"codigo":"DAS5214","nome":"Sinais e Sistemas Lineares","ementa":"Introdução aos sinais e sistemas lineares em tempo contínuo e discreto. Representação matemática de sistemas lineares. Análise no domínio do tempo de sistemas lineares e invariantes no tempo (LIT): resposta total, resposta ao impulso, convolução. Análise de sistemas LIT usando a transformada de Laplace. Função de transferência, polos e zeros. Estabilidade e influência de polos e zeros na resposta temporal. Álgebra de blocos. Resposta em frequência e análise via diagramas de Bode. Aplicações em controle. Transformada de Fourier de sinais em tempo contínuo. Transformada de Fourier de sinais amostrados, aliasing e taxa de amostragem. Equações a diferenças. Transformada Z: definições e propriedades. Análise de sistemas LIT em tempo discreto usando a Transformada Z. Resposta em frequência de sistemas em tempo discreto. Sistemas em tempo contínuo LIT controlados por controladores discretos: equivalente discreto.","carga_horaria":108,"fase_sugestao":4,"equivalencia":"DAS5113 ou DAS5114","prerequisito":"(DAS5210 e MTM3131) ou (DAS5210 e MTM3102 e MTM3121) ou (DAS5210 e MTM3102 e MTM3112)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5307":{"codigo":"DAS5307","nome":"Sistemas de Automação Discreta","ementa":"Introdução aos sistemas de produção automatizados: níveis hierárquicos da automação fabril, visão geral dos equipamentos programáveis utilizados em sistemas automatizados de produção. Sensores e atuadores discretos. Componentes eletromecânicos: chaves, solenóides, relés. Lógica de Relés. Controladores Lógicos Programáveis (CLP): arquitetura, programação em LD, exemplos de aplicação. Projeto de programas de CLP (GRAFCET). Outras linguagens de programação: SFC, FBD, ST, IL. Controle de entradas e saídas analógicas com CLP. Dispositivos de IHM. Sistemas SCADA. Comunicação entre PC e CLP. Redes de CLP. Padrão OPC. Sensores e atuadores inteligentes.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"DAS5305","prerequisito":"(DAS5411 e EEL5105) ou (DAS5412 e EEL5105)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5308":{"codigo":"DAS5308","nome":"Programação de Sistemas Automatizados","ementa":"Computadores tipo PC, IC, tablet e sistemas embarcados na Automação: arquitetura, principais componentes e exemplos de aplicação. Plataformas embarcadas microprocessadas voltadas ao projeto de controladores. Arquiteturas de software voltadas ao projeto de controladores tempo real. Interface entre plataformas embarcadas e sensores e atuadores. Programação de comunicação entre sistema embarcado e IHM. Programação orientada a objetos voltada ao desenvolvimento de sistemas de supervisão e IHM. Boas práticas de programação. Laboratório: 36 h.a.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"DAS5305","prerequisito":"DAS5102 e DAS5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7540":{"codigo":"EEL7540","nome":"Circuitos Elétricos para  Automação","ementa":"Análise de circuitos em corrente contínua: Conceitos básicos (carga, corrente, tensão, potência e energia), elementos de circuito, leis de Kirchhoff (análise por nós e por malhas), linearidade, superposição, transformação de fontes, teoremas de Thévenin e de Norton e máxima transferência de potência. Análise de circuitos monofásicos em regimente permanente senoidal: fasores, impedância, valor eficaz, potência ativa, reativa, aparente e complexa, fator de potência, correção de fator de potência, resposta em frequência e filtros. Análise de circuitos trifásicos em regimente permanente senoidal: sistema trifásico balanceado, sequência de fases, ligações em delta e em estrela e potência em sistemas trifásicos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EEL5104 ou EEL5106","prerequisito":"(FSC5113 e MTM3131) ou (FSC5113 e MTM3102) ou (FSC5113 e MTM5163) ou (FSC5133 e MTM3131) ou (FSC5133 e MTM3102) ou (MTM5133 e MTM5163)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5108":{"codigo":"INE5108","nome":"Estatística e Probabilidade para Ciências Exatas","ementa":"Teoria da probabilidade. Variáveis aleatórias e distribuição   de probabilidade. Principais distribuições de  probabilidade    discretas. Distribuição normal. Outras distribuições de probabilidade contínuas. Estimação de parâmetros. Testes de hipóteses.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"CEC1221 ou CEC5108","prerequisito":"MTM3101 ou MTM3110 ou MTM5161","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5109":{"codigo":"DAS5109","nome":"Modelagem e Simulação de Processos","ementa":"Processos industriais: modelagem fenomenológica, representação por diagramas de blocos e diagramas de instrumentação. Balanço de massa e energia dos processos de reação química. Processos contínuos e de batelada. Modelagem com parâmetros concentrados e distribuídos. Colunas de destilação. Simulação de processos; uso de simuladores acadêmicos e industriais. Prática: Experimentos em laboratório com plantas piloto e processos simulados em softwares industriais para estudo do comportamento de processos de vários tipos (térmicos, hidráulicos, de fermentação e destilação, etc.).","carga_horaria":72,"fase_sugestao":5,"equivalencia":"DAS5101 e EQA5115","prerequisito":"(DAS5114 e EEL7540) ou (DAS5214 e EEL7540)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5203":{"codigo":"DAS5203","nome":"Modelagem e Controle de Sistemas e Eventos Discretos","ementa":"Sistemas a Eventos Discretos(SEDs): conceituação, classificação, propriedades, exemplos; Redes de Petri e Verificação: definições, propriedades, análise, implementação, modelagem; verificação de propriedades; Autômatos e controle supervisório: Autômatos de Estados Finitos: conceituação básica, operações, controle supervisório de SEDs baseado em autômatos; Experiências práticas de uso dos formalismos na resolução de problemas de modelagem, análise e síntese de controladores para SEDs.","carga_horaria":90,"fase_sugestao":5,"equivalencia":"DAS5202","prerequisito":"DAS5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5312":{"codigo":"DAS5312","nome":"Metodologia para Desenvolvimento de Sistemas","ementa":"Requisitos de qualidade de Sistemas e de Software. Metodologias de desenvolvimento de Sistemas e Software Orientadas a Objetos. Criação de Modelos. Ferramentas para análise, projeto e testes. Ambientes de desenvolvimento. Aplicação das metodologias, ferramentas e ambientes a problemas de Automação. Estudo de caso. Laboratório: 18 h.a.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"DAS5320","prerequisito":"DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7550":{"codigo":"EEL7550","nome":"Eletrônica Aplicada","ementa":"Circuitos lineares com amplificador operacional: amplificadores e modelos; o amplificador operacional ideal; principais aplicações do amplificador operacional. Não-idealidades do amplificador operacional e suas influências no desempenho de circuitos com amplificador operacional. Diodos: o diodo ideal; diodo de junção e suas características terminais; modelos pequenos sinais; diodos Zener; diodos emissores de luz; optoacopladores e sua aplicação em isolação de circuitos digitais; análise de circuitos com diodo (retificador, roda livre, limitador, detector de pico). Transistores BJT e MOSFET: princípios de operação e características estáticas; modelos pequenos sinais; aplicação como chave, como fonte de corrente e como amplificador de potência.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EEL5106 ou EEL5346","prerequisito":"EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5235":{"codigo":"EMC5235","nome":"Metrologia Industrial","ementa":"Processo de medição. Vocabulário típico da área de metrologia; características metrológicas. Sistema internacional de unidades. Procedimentos padronizados para avaliação de incertezas de medição. Confiabilidade metrológica; rastreabilidade; calibração. Definição de limites de conformidade em medições. Princípio de funcionamento e especificação dos principais transdutores empregados para automação da medição de temperatura (termopares, termistores, termoresistores), deformação (extensômetros de resistência em circuitos de ponte), força (células de carga extensométricas e piezelétricas), pressão (manômetros com saída em grandezas elétricas), rotação (encoders digitais, tacogeradores, relutância variável), vazão (deprimogênios, deslocamento positivo, turbinas, eletromagnéticos, ultrassônicos, vórtices, Coriolis, térmicos), nível (flutuadores, ultrassônicos, radar, capacitivos, baseados em força ou pressão) e deslocamento (resistivos, capacitivos, indutivos, óticos). Principais transdutores com saída discreta aplicados em automação de processos: detectores de presença, termostatos, pressostatos, chaves de nível. Tecnologias emergentes para automação do processo de medição.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5236","prerequisito":"EEL5104 ou EEL5106 ou EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5425":{"codigo":"EMC5425","nome":"Fenômenos de Transportes","ementa":"Conceitos fundamentais em mecânica dos fluidos; dimensões e unidades; campos escalar, vetorial e tensorial; viscosidade. Hidrostática; pressão em fluido estático, manômetros; forças sobre superfícies planas e curvas submersas. Análise de escoamento; leis básicas para sistemas e volumes de controle;  conservação da massa; equação da quantidade de movimento linear; primeira lei da termodinâmica; equação de Bernoulli. Escoamento viscoso incompressível; escoamento em tubos;  diagrama de  Moody; perdas de carga distribuidas e localizadas. Conceitos fundamentais em transmissão de calor;  dimensões e unidades; leis básicas  da transmissão de calor; condução, convecção e radiação; mecanismos combinados de transmissão de calor. Condução unidimensional em regime permanente; espessura crítica de isolamento; aletas; estruturas compostas. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"(FSC5002 e MTM3103) ou (FSC5002 e MTM5163) ou (FSC5132 e MTM3103) ou (FSC5132 e MTM5163)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM7820":{"codigo":"CNM7820","nome":"Aspectos Econômicos e Sociais da Automação","ementa":"Os processos de inovação: definições, determinantes, impactos. O desenvolvimento tecnológico como processo social. Paradigmas e trajetórias tecnológicas, revoluções tecnológicas e industriais. A relevância das políticas públicas para o desenvolvimento de capacidades tecnológicas. A sociedade do conhecimento e o atual paradigma tecno-produtivo. Dilemas éticos da inteligência artificial e impactos econômicos e sociais da automação. Inovação e automação no Brasil. O sistema nacional de inovação.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"CNM5111","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5120":{"codigo":"DAS5120","nome":"Sistemas de Controle","ementa":"Revisão de sinais e sistemas. Estruturas de Controle. Controle realimentado. Estabilidade e resposta no tempo de sistemas realimentados. O método de lugar de raízes (LR) como ferramenta de análise; Interpretação frequencial. Diagramas de Bode e polares e estudo de estabilidade. Projeto de controladores por realimentação com o método LR (contínuo e discreto). O controle com dois graus de liberdade. Diagramas polo-zero e sua relação com a resposta no tempo. Rejeição de perturbações em sistemas de controle. Controle por realimentação e pré-alimentação. Controle cascata. Controle por relação. Outras estruturas e configurações de controle de processos. Controle de tanques pulmão, controle de faixa dividida, Preditor de Smith e Preditor de Smith filtrado. PID industriais: configuração; estruturas; métodos de sintonia; aspectos práticos e operacionais.Implementação de controladores digitais. Código de controle. Introdução ao controle robusto. Laboratório com simulação e experimentos que usam a implementação de controladores em microcontroladores, placas AD\/DA e PC e com o uso de PID industriais.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"DAS5121","prerequisito":"DAS5109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5151":{"codigo":"DAS5151","nome":"Instrumentação em Controle","ementa":"Medição: definições básicas envolvidas em sistemas de medição; características estáticas e dinâmicas de sistemas de medição; especificação e análise de sistemas de medição para aplicação em sistemas de controle. Condicionamento de sinais de medição: medição de resistência elétrica a dois, três e quatro fios; ponte de Wheatstone; divisores resistivos e shunts; amplificação; isolação; ajuste de impedâncias de entrada e saída; ruídos e interferências. Aquisição de dados: principais tipos de sistemas de aquisição de dados para instrumentação; sample-and-hold; conversores A\/D e D\/A. Atuação: revisão das principais estratégias empregadas para acionamento de cargas (transistor como chave, acionamento por PWM, ponte H, amplificadores proporcionais de potência). Controladores digitais: aspectos de implementação, quantização.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EEL5181","prerequisito":"(EEL5106 ou EEL5346 ou EEL7550) e DAS5109 e (EMC5235 ou EMC5236)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5314":{"codigo":"DAS5314","nome":"Redes de Computadores para Automação","ementa":"Redes de Computadores: Aspectos arquiteturais; O modelo de referência para interconexão de sistemas abertos (RM-OSI); Estudo de camadas com exemplos de protocolos; Interconexão de redes: repeaters, bridges, routers, gateways; Concentradores: hubs, switches; Redes locais industriais: redes e os níveis hierárquicos de integração; Requisitos das redes industriais; Padrões em redes industriais: IEEE 802, MAP\/TOP; Fieldbus (FIP, PROFIBUS, Foundation Fieldbus); Visão geral de produtos.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"DAS5331","prerequisito":"DAS5307 e DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5193":{"codigo":"EEL5193","nome":"Máquinas e Acionamentos Elétricos para Automação","ementa":"CIRCUITOS TRIFÁSICOS: Conceitos básicos, Potências em circuitos trifásicos, Conexão ?Y; \nPRINCÍPIOS DE FUNCIONAMENTO DE CONVERSORES ESTÁTICOS: Conversores CC básicos, unidirecionais e bidirecionais. Retificadores monofásicos e trifásicos (diodo) e controlados (tiristor), Inversores monofásicos e trifásicos; \nPRINCÍPIOS DE MÁQUINAS ELÉTRICAS: Geradores, Motores, Características estáticas; \nO MOTOR CC E SEUS ACIONAMENTOS: Aspectos construtivos, Princípios de operação, Equações de velocidade e torque, Parâmetros; \nO MOTOR DE INDUÇÃO E SEUS ACIONAMENTOS: Aspectos construtivos, Acionamento direto, Chave ?Y, Soft \nStarter, Controle V\/F, Inversores de frequência; \nO MOTOR SÍNCRONO E SEUS ACIONAMENTOS: Aspectos construtivos, Princípios de operação; \nMOTORES ESPECIAIS: Motor-de-passo, Servomotor CC.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EEL5191 ou EEL5192","prerequisito":"EEL5104 ou EEL5106 ou EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5467":{"codigo":"EMC5467","nome":"Acionamentos Hidráulicos e Pneumáticos para Automação","ementa":"Acionamento Hidráulico: Princípios de funcionamento e características principais dos sistemas hidráulicos; Circuitos hidráulicos fundamentais: Servoválvulas; Dinâmica dos sistemas hidráulicos; Noções de especificação. Acionamento Pneumático: Princípios de funcionamento e características principais dos sistemas pneumáticos; Circuitos pneumáticos; Dinâmica dos sistemas pneumáticos; Noções de especificação. Laboratório (equivalente a 18 h.): Experiências sobre circuitos hidráulicos e pneumáticos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"DAS5307 e EMC5425","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5104":{"codigo":"DAS5104","nome":"Projeto Integrador","ementa":"Teoria sobre desenvolvimento e gestão de projetos; Revisão sobre metodologias de desenvolvimento de projetos; Projeto de um sistema automatizado: a cada semestre, será proposto um único problema a ser tratado por todos os grupos de trabalho.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"DAS5105","prerequisito":"(DAS5312 ou DAS5320) e (DAS5109 e DAS5203 e EEL7550)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5142":{"codigo":"DAS5142","nome":"Sistemas Dinâmicos","ementa":"Sistemas dinâmicos lineares e não lineares. Exemplos em controle de processos, mecatrônica, sistemas biológicos, sistemas de energia. etc. Problemas não lineares na engenharia de controle. Representação matemática por variáveis de estado. Espaço de estados (plano de fase). Análise qualitativa de sistemas dinâmicos (equilíbrios, ciclos limites e comportamento aperiódico). Teorema da linearização de Hartman-Grobman.Estabilidade Estrutural. Bifurcações em sistemas dinâmicos. Diagrama de bifurcações. Não linearidades estáticas em sistemas de controle (saturação, zona morta, histerese, folga, atrito, etc.) Estudo de casos de sistemas de controle com saturação, válvulas de controle industriais não lineares (características estáticas de igual porcentagem e de abertura rápida) e atrito.Métodos de analise no domínio frequêncial para detecção de ciclos limites: método do balanço harmônico (função descritiva) e extensão do critério de Nyquist. Sistemas realimentados com restrições na ação de controle: saturação e métodos de Anti-windup. Análise de estabilidade de sistemas dinâmicos pelo método de Lyapunov. Principais técnicas de projeto de controladores para sistemas dinâmicos: (i) compensação de não linearidades estáticas (folga, quantização, zona morta, atrito); (ii) linearização por realimentação de estado e de saída; (iii) projeto baseado em funções de Lyapunov.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"DAS5141","prerequisito":"DAS5120 ou DAS5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5310":{"codigo":"DAS5310","nome":"Avaliação de Desempenho de Sistemas de Automação Discreta","ementa":"Processos empresarias\/industriais. Princípios de Teoria de Filas. Variabilidade de sistemas, terminologia, histogramas. Indicadores de desempenho: tipos, níveis, seleção. Simulação: metodologia de construção de modelos de simulação, análise estatística. Software ARENA básico. Modelagem de processos. Diagnóstico e geração de alternativas.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"DAS5313 ou DAS5318","prerequisito":"DAS5203 e INE5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5354":{"codigo":"EEL5354","nome":"Eletrotécnica para Automação","ementa":"PRINCÍPIOS DE SISTEMAS ELÉTRICOS: Princípios de geração, transmissão e distribuição de energia elétrica, Noções de tarifação, Princípio da compensação de energia reativa, Transformadores de potência; INSTALAÇÕES DE BAIXA TENSÃO: Princípios da proteção contra choques elétricos, Aterramentos, Projeto de instalações elétricas, Equipamentos elétricos para instalação em baixa tensão, Dispositivos de proteção, Diagrama Unifilar; SELEÇÃO E INSTALAÇÃO DE MOTORES ELÉTRICOS: Dimensionamento de potência, Caixa redutora, Aspectos práticos de partida de motores, Dispositivos de manobra (contatores e relés), Projeto de circuitos alimentadores, Proteção. Laboratório: 18 horas-aula.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EEL5355","prerequisito":"(EEL5191 ou EEL5192 ou EEL5193) e (EEL5104 ou EEL5106 ou EEL7540)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5251":{"codigo":"EMC5251","nome":"Introdução à Robótica Industrial","ementa":"Componentes dos robôs; Analise de propriedades cinemáticas; Cinemática de robôs; Introdução à estática de robôs; Introdução à dinâmica dos robôs; Geração de trajetórias para robôs; Controle de robôs; Sensores; Programação de robôs; Aplicações de robôs.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5114 ou DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5258":{"codigo":"EMC5258","nome":"Introdução à Automação da Manufatura","ementa":"Introdução à Manufatura. Automação de Sistemas de Manufatura: Definição, Níveis e Necessidade da Automação. Monitoramento de Segurança, Diagnósticos de Manutenção, Detecção de Erro e Recuperação. Layouts: Funcional, Por Produto, Posicional, Contínuo, Celular. Manufatura Celular: Definição, Tecnologia de Grupo, Formação de Células. Sistemas Flexíveis de Manufatura (FMS). Sistemas Automatizados de Montagem. Sistemas Automatizados de Armazenamento. Veículos Guiados Automaticamente (AGVs). Princípios Básicos de Materiais. Tratamentos Térmicos. Ensaios Mecânicos. Processos de Fabricação: Fundição, Conformação Mecânica, Usinagem, Soldagem. CAD\/CAE (produtos): Modelagem Geométrica, Análise de Propriedades de Massa, Verificação de Interferência, Análise de Tolerâncias. Projeto para a Montagem Automatizada. CAPP\/CAM (processos): Seleção de Processos de Fabricação, Seleção de Máquinas, Ferramentas e Dispositivos de Fixação, Simulação de Trajetórias.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"EMC5255","prerequisito":"DAS5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5402":{"codigo":"DAS5402","nome":"Ética e Aspectos de Segurança em Sistemas de Controle e Automação","ementa":"Ética aplicada a sistemas de engenharia. Segurança em sistemas automatizados. Responsabilidade técnica. Legislação e estatísticas de acidentes de trabalho. Normas regulamentadoras de segurança. Combate a incêndios. Análise probabilística de risco (PRA). Elementos de confiabilidade. Análise de  modos de falha (FMEA). Árvore de falhas FTA. Princípios de manutenção baseada no monitoramento (CBM).","carga_horaria":36,"fase_sugestao":8,"equivalencia":"DAS5401","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2300,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5501":{"codigo":"DAS5501","nome":"Estágio em Controle e Automação","ementa":"O estágio deve ser realizado em empresas ou laboratórios de pesquisa, e supervisionado por um professor orientador. Tem como objetivo o desenvolvimento dos seguintes tipos de atividades: acompanhamento e participação no projeto e implantação de sistemas automatizados; análise de desempenho de sistemas automatizados; e estudo de viabilidade, levantamento de dados, e relatórios sobre processos automatizados ou a serem automatizados.","carga_horaria":288,"fase_sugestao":8,"equivalencia":"EEL5950","prerequisito":"DAS5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7076":{"codigo":"EPS7076","nome":"Gestão Econômica e de Investimentos","ementa":"Matemática financeira: juros simples e compostos; relações de equivalência; taxas de juros e taxa ajustada à inflação; sistemas de amortização. Análise de investimentos: payback descontado; valor presente líquido; taxa interna de retorno; projeção de fluxo de caixa. Análise de demonstrações financeiras: balanço patrimonial; demonstração de resultado do exercício; indicadores de análise.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS5211","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":900,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT6642":{"codigo":"ZZT6642","nome":"Optativa I","ementa":"","carga_horaria":0,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6643":{"codigo":"ZZT6643","nome":"Optativa II","ementa":"","carga_horaria":0,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6644":{"codigo":"ZZT6644","nome":"Optativa III","ementa":"","carga_horaria":0,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6645":{"codigo":"ZZT6645","nome":"Optativa IV","ementa":"","carga_horaria":0,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6646":{"codigo":"ZZT6646","nome":"Optativa V","ementa":"","carga_horaria":0,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6647":{"codigo":"ZZT6647","nome":"Optativa VI","ementa":"","carga_horaria":0,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6648":{"codigo":"ZZT6648","nome":"Optativa Geral","ementa":"","carga_horaria":0,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"DAS5511":{"codigo":"DAS5511","nome":"Projeto de Fim de Curso","ementa":"Arraigar no aluno os conhecimentos auferidos no curso e desenvolver sua capacitação e auto-confiança na geração de soluções através da execução de um projeto prático a nível laboratorial ou industrial.","carga_horaria":450,"fase_sugestao":10,"equivalencia":"EEL5901","prerequisito":"DAS5501","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5131":{"codigo":"DAS5131","nome":"Controle Multivariável","ementa":"Representação por variáveis de estado de sistemas contínuos e amostrados. Metodologia de análise e projeto de sistemas de controle multivariável. Controlabilidade e observabilidade. Decomposição canônica de sistemas lineares. Formas canônicas. Relação entre a representação por variáveis de estado e a matriz função de transferência. Pólos e zeros multivariáveis. Controle com o estado mensurável. Realimentação de estados. Propriedades: caso monovariável, extensão de resultados. Conceito de estimador de estado; Observadores; Controle usando realimentação de estado estimado. Teorema da separação; Introdução ao conceito de compensação dinâmica. Laboratório: (18 hs) - Utilização de ferramentas de análise e projeto de sistemas multivariáveis. (PACSC). Aplicação a processos físicos tipicamente multivariáveis. (coluna de destilação, motores ac., etc).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5120 ou DAS5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5306":{"codigo":"DAS5306","nome":"Programação Concorrente e Sistemas de Tempo Real","ementa":"Programação concorrente: motivação, mecanismos de comunicação e de sincronização. Sistemas operacionais: características e uso, gerência do processador, da memória e de outros recursos, estudos de caso. Sistemas com requisitos de tempo real. Políticas de escalonamento de tempo real. Linguagens com características de programação em tempo-real. Projeto de executivo tempo-real. Laboratório: 18 h.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"DAS5303","prerequisito":"DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5315":{"codigo":"DAS5315","nome":"Sistemas Distribuídos para Automação","ementa":"Sistemas Distribuídos: Modelo Cliente\/Servidor; RPC e RMI; Comunicação de Grupo; Servidor de Nomes (DNS, X.500, LDAP); Suportes de Middleware; Estudo de caso: CORBA; Serviço de Arquivos Distribuídos (NFS, Andrews File System); Sincronização em Sistemas Distribuídos (Tempo e Estado Global). Projeto de aplicação distribuída.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"DAS5331","prerequisito":"DAS5314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5319":{"codigo":"DAS5319","nome":"Integração de Sistemas Industriais e Empresariais","ementa":"Integração de sistemas e seus requisitos. Integração de empresas, processos, sistemas, pessoas e máquinas. O modelo de referência ISA-95 pirâmide da automação. CIM e Indústria 4.0. Transformação Digital. Principais sistemas envolvidos em integrações empresariais e industriais (ERP, PIMS\/MES, BPM, sistemas ciberfísicos, IoT). Abordagens, estratégias e patterns de integração e interoperação de sistemas gerais e legados. Arquiteturas e Modelos de integração. Arquiteturas Orientadas a Serviços. ESB (Enterprise Service Bus).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"DAS5316","prerequisito":"(DAS5312 e DAS5314) ou (DAS5314 e DAS5320)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5341":{"codigo":"DAS5341","nome":"Inteligência Artificial Aplicada a Controle e Automação","ementa":"Algorítmos de procura; árvores de decisão; representação do conhecimento (Sistemas de Produção, Frames). Sistemas Especialistas. Linguagens PROLOG, LISP. Ferramentas de Desenvolvimento de Sistemas Especialistas. Aplicações. Redes Neurais. Laboratório: 36 horas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5430","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5520":{"codigo":"DAS5520","nome":"Processamento de Sinais","ementa":"Série de Fourier; Transformada de Fourier de sinais contínuos, discretos e amostrados; extração de características de sinais; aplicações em projetos de filtros contínuos e discretos, monitoramento e comunicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5114 ou DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5901":{"codigo":"DAS5901","nome":"Tópicos especiais em Controle: Introdução à Identificação e ao Controle Adaptativo","ementa":"Introdução: modelos de processos contínuo e discreto, modelos com perturbação, equação à diferença linear geral, métodos clássicos de identificação nos domínios do tempo e da freqüência. Métodos de identificação \"off-line\" e \"on-line\": mínimos quadrados, mínimos quadrados generalizado, variável instrumental, aproximação estocástica. Determinação de modelos contínuos a partir de dados amostrados. Processos variantes no tempo: fator de esquecimento variável, reinicialização da matriz de covariância, métodos de detecção de ruptura de modelos, fatorização UD, validação de modelos. Controladores adaptativos: alocação de polos, PID, DeadBeat, Dahlin, auto-ajustável de variância mínima, auto-ajustável de variância mínima generalizada: indireto e direto, PID auto-ajustável com estrutura GMV, preditivos: MAC, DMC, GPC.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL5810","prerequisito":"DAS5120 ou DAS5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5921":{"codigo":"DAS5921","nome":"Tópicos Especiais em Informática Industrial","ementa":"Instrumentação na indústria de P&G: Sensores e atuadores utilizados nas plantas de extração, produção, transporte e refino. Transmissores \"inteligentes\". Controladores industriais. Redes industriais fieldbus para P&G.:Principais padrões de redes tipo fielbus: CAN, ASi, Fieldbus foundation. Redes para áreas de segurança intrínseca (áreas sujeitas a risco de explosão ou incêndio). Aspectos de segurança intrínseca e tolerância a falhas. Algoritmos de escalonamento em tempo real. Controle e supervisão de instalações de P&G: Sistemas de controle baseados em redes industriais tipo fieldbus. Aulas práticas sobre uma planta piloto de laboratório (planta didática da empresa SMAR).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL5811","prerequisito":"(DAS5114 e DAS5314) ou (DAS5214 e DAS5314)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5944":{"codigo":"DAS5944","nome":"Tópicos Especiais em Controle: Instrumentação Aplicada à Industria de Petróleo e Gás","ementa":"Parte Teórica - Terminologia e definições básicas (alcance, amplitude, resolução, etc.) utilizadas no setor de instrumentação. Funções de instrumentos (indicador, transmissor, controlador, registrador, etc.). Classificação e identificação de instrumentos. Diagramas de processo de instrumentação. Sistemas de transmissão em corrente 4-20 mA. Sensores e transmissores para medir: Pressão, Temperatura e Vazão. Medidores para aplicações especiais: para prospecção, multifásicos, para detecção de vazamento, etc. Elemento final de controle. Válvulas. Tipos de válvulas de controle. Válvulas de segurança e reguladoras de pressão auto-operadas. Válvulas para aplicações específicas: gás-lift, check valve, etc. Bombas. Controladores industriais. Parte Prática - serão realizadas práticas sobre plantas piloto de laboratório (plantas didáticas da empresa ARMFIELD existentes no LCP-DAS).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"(DAS5114 e EEL7550) ou (DAS5214 e EEL7550)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5945":{"codigo":"DAS5945","nome":"Tópicos Especiais em Controle: Técnicas de Controle Aplicadas à Indústria de Petróleo e Gás","ementa":"Controle Preditivo: introdução; metodologia; algoritmos específicos; aplicações a processos da indústria de petróleo e gás.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5946":{"codigo":"DAS5946","nome":"Tópicos Especiais em Controle e Automação: Introdução à Engenharia do Petróleo e Gás","ementa":"O petróleo: noções de geologia; prospecção; perfuração; avaliação de formações; completação; reservatórios; elevação; processamento primário de fluídos e refino.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5114 ou DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5947":{"codigo":"DAS5947","nome":"Tópicos Especiais em Controle e Automação: Introdução ao Controle para Indústria do Petróleo e Gás","ementa":"Aplicação das principais estratégias de controle aos equipamentos e processos da indústria de petróleo e gás. Estudo de casos: Reatores FCC, Fracionadores, Colunas de Destilação, trocadores de calor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5114 ou DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5948":{"codigo":"DAS5948","nome":"Tópicos Especiais em Controle e Automação: Seminário para à Industria do Petróleo e Gás","ementa":"Palestras sobre temas selecionados proferidas por especialistas, tratando de temas como: Geologia do Petróleo, Petrofísica, Perfuração\/Completação, Recuperação Avançada de Petróleo, Simulação de Reservatórios de Petróleo, Dutos, Refino: Separação de Hidrocarbonetos por Destilação, Produção de Biocatalisadores para utilização em biorrefino e biorremediação de áreas contaminadas com petróleo, Geração Termelétrica e Cogeração com Gás Natural, Gás Natural, Meio Ambiente, Política e Economia. Estruturação de seminário sobre o tema de pesquisa na área de petróleo, gás e biocombustíveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5114 ou DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5951":{"codigo":"DAS5951","nome":"Tópicos Avançados em Controle e Automação I","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição, sendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e Automação e considerada como avançada no escopo. Deverá passar por análise do coordenador e colegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5952":{"codigo":"DAS5952","nome":"Tópicos Avançados em Controle e Automação II","ementa":"Código  de  disciplina  utilizado  para  fazer  reaproveitamento  de \ndisciplina cursada em outra instituição, sendo a disciplina cursada \nnão  equivalente  a  outra  disciplina  do  curso  de  Engenharia  de \nControle e Automação e considerada como avançada no escopo. \nDeverá passar por análise do coordenador e colegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5953":{"codigo":"DAS5953","nome":"Tópicos Avançados em Controle e Automação III","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5954":{"codigo":"DAS5954","nome":"Tópicos Avançados em Controle e Automação IV","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5955":{"codigo":"DAS5955","nome":"Tópicos Avançados em Controle e Automação V","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5956":{"codigo":"DAS5956","nome":"Tópicos Avançados em Controle e Automação VI","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5957":{"codigo":"DAS5957","nome":"Tópicos Avançados em Controle e Automação VII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5958":{"codigo":"DAS5958","nome":"Tópicos Avançados em Controle e Automação VIII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5959":{"codigo":"DAS5959","nome":"Tópicos Avançados em Controle e Automação IX","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5960":{"codigo":"DAS5960","nome":"Tópicos Avançados em Controle e Automação X","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5961":{"codigo":"DAS5961","nome":"Tópicos Avançados em Controle e Automação XI","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5962":{"codigo":"DAS5962","nome":"Tópicos Avançados em Controle e Automação XII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7125":{"codigo":"EEL7125","nome":"Instrumentação Biomédica","ementa":"Sensores, Transdutores e Visão Geral de Sistemas de Instrumentação. Circuitos Básicos com Amplificador Operacional. Amplificador Operacional Real, Limitações no Desempenho. Amplificadores para Instrumentação. Cálculo de erros em sistemas de aquisição de dados. Instrumentação eletrônica Sistemas de medição e Instrumentação Biomédica. Origem e medição de Biopotencias. Instrumentação de Laboratório Clínico. Instrumentos em geral utilizados em cardiologia. Equipamentos para o sistema respiratório. Sistemas de Imagem Médica. Tomografia computadorizada. Dispositivos Terapêuticos e Protéticos. O Conceito Integrado de Segurança Elétrica. Novos instrumentos e novas tecnologias. Aplicações e estudos de caso; experiência hands-on com sensores e desenvolvimento de sistemas eletrônicos e dispositivos para medição de sinais biomédicos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7307":{"codigo":"EEL7307","nome":"Introdução a Informática Médica","ementa":"Introdução aos sistemas de informática médica. Registro eletrônico de saúde. Grandezas e sinais biomédicos (ECG, EEG, PPG, EMG, outros). Processamento de sinais biomédicos: domínios do tempo, frequência e análise conjunta. Processamento de sinais biomédicos: PCA e ICA. Métodos de decisão e aprendizagem de máquina: Thresholding, KNN, árvores, RNA. Técnicas de diagnóstico por imagens: oftalmoscopia, ultrassonografia, tomografia computadorizada.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7324":{"codigo":"EEL7324","nome":"Engenharia Clínica para Uso Médico","ementa":"Conceitos de Engenharia Clínica: definição de engenharia clínica, de tecnologias em saúde, de equipamentos médicos-assistenciais, ciclo de vida dos equipamentos; Modelo de gestão e gerenciamento de tecnologias médico-hospitalares:  definição do modelo, domínios, impacto no ciclo de vida, conceitos de qualidade; Equipamentos médicos-assistenciais:  abordagem sobre equipamentos, funcionalidade, aplicação, diagrama de blocos, ensaios de desempenho e segurança. Principais atividades realizadas pela engenharia clínica: especificação, recebimento, instalação, treinamento, manutenção, substituição dos equipamentos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7885":{"codigo":"EEL7885","nome":"Fundamentos de Engenharia Biomédica","ementa":"Áreas da engenharia biomédica: instrumentação biomédica, informática médica, bioengenharia e engenharia clínica; Funcionalidade de Sistemas Biológicos: Função dos sistemas e Tecnologias. Introdução processos fisiológicos e aplicações tecnológicas; Aspectos de Segurança Elétrica e Gerenciamento de Riscos, Biossegurança e proteção Radiológica em ambientes com tecnologias na Saúde; Introdução a instrumentação biomédica: Tecnologias e circuitos com aplicação na Engenharia Biomédica; Principais atividades desenvolvidas pela engenharia clínica: gestão e gerenciamento de tecnologia. Equipamentos médicos-assistenciais. Ensaios de desempenho e segurança.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5123":{"codigo":"EMC5123","nome":"Mecanismos","ementa":"Introdução. Conceitos e notações aplicado a mecanismos. Estudo de tipos de mecanismos. Síntese dimensional de mecanismos articulados. Análise e cinemática de cames planos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"(MTM3120 e MTM3121) ou (MTM3112 e MTM3120) ou (MTM3102 e MTM3111 e MTM3121) ou (MTM3102 e MTM3112)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5219":{"codigo":"EMC5219","nome":"Tecnologia de Comando Numérico","ementa":"Conceituação de um Sistema de Comando Numérico. Princípios de funcionamento. Sistemas de acionamento. Controle de posição. Armazenamento das informações, etc. Equipamentos que utilizam sistemas de Comando Numérico. Diversos tipos de aplicações. Características peculiares  dos componentes mecânicos e eletrônicos. Manutenção. Noções de interligação entre diversos equipamentos e com sistemas de informação. Noções de programação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5227":{"codigo":"EMC5227","nome":"Automação de Processos de Soldagem","ementa":"Fundamentos dos processos de soldagem e suas variantes modernas, com ênfase em processos a arco elétrico: revisão dos processos de soldagem clássicos; inovações construtivas e eletrônicas e eletromecânicas dos processos; aplicações dos processos modernos e suas limitações; processos híbridos. Sistemas de mecanização \/ automação da soldagem e monitoração: fontes de soldagem e acessórios para alimentação de material, panorama geral sobre sistemas de automação da soldagem, programação e funcionalidades especiais de manipuladores para soldagem, integração\/ sincronização fonte de energia e manipuladores, aplicações e limitações de diferentes manipuladores e robôs para soldagem, sistemas sensoreados para soldagem adaptativa. Técnicas de monitoração \/ inspeção da solda, do sistema de soldagem e do movimento: ultrassom, radiografia, e vídeo-termografia, sensor tátil e filmagem de alta velocidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5246":{"codigo":"EMC5246","nome":"Administração de Operações de Manufatura","ementa":"Visão de engenharia da Gerência Operacional da Produção com ênfase na manufatura. Aspectos de Engenharia de Manufatura. Administração Operacional da Produção. Papel Estratégico e Objetivo da Produção. Apresentação do Jogo da Produção. Projeto da Rede de Operações Produtivas. Arranjo Físico e Fluxo. Tecnologia de Processo. Planejamento e Controle.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC5257 e EPS5220","prerequisito":"EMC5245 ou EMC5258","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5260":{"codigo":"EMC5260","nome":"Tópicos Especiais em Automação Industrial","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5301":{"codigo":"EMC5301","nome":"Introdução ao Projeto Manufatura-computador","ementa":"Esta disciplina tem como objetivo, fornecer um entendimento geral sobre os conceitos fundamentais que envolvem a área de CAE\/CAD\/CAM. O aluno deverá usar um software CAD\/CAM comercial, aplicando os conceitos aprendidos na área do projeto mecânico em geral. O uso das ferramentas de CAD\/CAM e o exercício dos conceitos de projeto mecânico lhe facultará o desenvolvimento de habilidades necessárias nos diversos estágios do projeto e manafatura de um produto.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EPS5313","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5415":{"codigo":"EMC5415","nome":"Trocadores de Calor","ementa":"Introdução  aos  trocadores  de  calor;  Conceitos  fundamentais;  Metodologia  de  projeto,  Projeto  termo-hidráulico  de  trocadores  bitubulares,  casco-e-tubos,  de  placas  e  compactos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5444":{"codigo":"EMC5444","nome":"Projeto de Sistemas Térmicos","ementa":"Metodologia do projeto. Noções de economia aplicada à análise de investimentos. Ajustes de equações. Modelação. Simulação. Otimização. Técnicas de otimização aplicadas ao projeto de sistemas térmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS2351":{"codigo":"EPS2351","nome":"Gerenciamento de Projetos","ementa":"Conceito de projeto. Fases e componentes de um projeto. Estruturas organizacionais e o gerenciamento de projetos. Planejamento e controle de projetos. O gerente de projeto e as competências interpessoais. Portfólio em gestão de projetos. Modelos de gerenciamento ágil e tradicional de projetos. Ferramentas computacionais de apoio ao projeto. Tendências e oportunidades em gerenciamento de projetos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"ECZ5102 e INE5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"FSC7152":{"codigo":"FSC7152","nome":"Computação Quântica I","ementa":"Álgebra linear com a notação de Dirac. Postulados da Mecânica Quântica. Conceitos básicos de computação clássica. Portas lógicas clássicas. Portas lógicas quânticas. Circuitos quânticos. Protocolos e algoritmos quânticos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM3112 ou MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5413":{"codigo":"INE5413","nome":"Grafos","ementa":"Grafos e grafos orientados. Representação de problemas com grafos. Caminhos, ciclos e caminho de custo mínimo. Conexidade e alcançabilidade. Árvores e árvore de custo mínimo. Coloração e planaridade de grafos. Grafos hamiltonianos e eulerianos. Fluxo máximo em redes. Estabilidade e emparelhamento em grafos. Problemas de cobertura e de travessia. Representações computacionais e complexidade de algoritmos em grafos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5423":{"codigo":"INE5423","nome":"Banco de Dados I","ementa":"Banco de Dados (BD). Sistema de Gerência de BD: funcionalidades, módulos principais, categorias de usuários, dicionário de dados. Modelo relacional: conceitos, restrições de integridade, álgebra relacional, cálculo relacional. Linguagens SQL: DDL, DML, restrições de integridade, visões, autorização de acesso. Modelagem de dados: etapas do projeto de um BD relacional, modelo Entidade-Relacionamento (ER), mapeamento ER-relacional. Teoria da Normalização: objetivo, dependências funcionais, formas normais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5613","prerequisito":"DAS5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5443":{"codigo":"INE5443","nome":"Reconhecimento de Padrões","ementa":"Considerações iniciais sobre padrões. Técnicas simbólicas. Técnicas sub simbólicas: redes neurais. Raciocínio baseado em caso - estendendo RP com um framework de inteligência artificial. Técnicas estatísticas. Geração de padrões: análise de sinais e imagens. Criação de aplicação de reconhecimento de padrões.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5448":{"codigo":"INE5448","nome":"Tópicos Especiais em Aplicações Tecnológicas I","ementa":"Ementa livre para assuntos relevantes na área de Aplicações Tecnológicas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5455":{"codigo":"INE5455","nome":"Testes de Software","ementa":"Conceitos Básicos. Níveis de Testes. Tipos de Testes. Técnicas de Testes. Planejamento e Execução de Testes de Software. Desenvolvimento Orientado a Testes. Automação de Testes. Ferramentas de Testes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5312 ou DAS5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5600":{"codigo":"INE5600","nome":"Bancos de Dados III","ementa":"Aplicações não-convencionais.  Novos desafios de gerenciamento de dados. Bancos de dados pós-relacionais: categorias, conceitos, modelos de dados, manipulação de dados, modelagem","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5616":{"codigo":"INE5616","nome":"Bancos de Dados II","ementa":"Etapas do processamento de uma consulta; otimização algébrica de consultas; plano de execução de consultas; fundamentos de transações: definição e propriedades; recuperação de transações na ocorrência de falhas; controle de concorrência de transações; fundamentos de bancos de dados distribuídos: arquiteturas, projeto, processamento de consultas e gerência de transações; tópicos especiais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5432","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5633":{"codigo":"INE5633","nome":"Sistemas Inteligentes","ementa":"Histórico e conceitos preliminares. Problemas e espaços de problemas. Métodos de solução de problemas. Representação do conhecimento. Sistemas especialistas. Ferramentas de Inteligência Artificial. Aquisição do conhecimento. Linguagem natural. Jogos. Lógica da Inteligência Artificial. Uso de Lógicas em Sistemas Especialistas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5643":{"codigo":"INE5643","nome":"Data Warehouse","ementa":"Conceitos básicos. Os Ecossistemas de Informação. O Ciclo de Vida do DW: Planejamento e Administração, Levantameto de Requisitos, Modelagem Dimensional, Projeto Físico, o Back-Room e o Froon-Room, Metadados, Arquiteturas, Implementação, Segurança e Internet. Implantação, Suporte e Treinamento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5644":{"codigo":"INE5644","nome":"Data Mining","ementa":"Considerações iniciais da área e aplicações. Processos de descoberta do conhecimento (KDD) em base de dados. Análise exploratória de dados. Tipos de variáveis, Técnicas de Data Mining para classificação, estimação, predição, análise de agrupamentos, análise de associação: redes neurais, árvores de decisão, regras de decisão, análise discriminante, regressão linear, regressão logística, análise de cluster, análise de componentes principais. Uso de softwares de data mining. Exercícios. Data Mining de caso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5649":{"codigo":"INE5649","nome":"Técnicas Estatísticas de Predição","ementa":"Estudo de correlações. Análise de regressão linear simples: modelo, inferências, análise de resíduos e transformações. Análise de regressão linear múltipla. Modelo com variáveis independentes categóricas. Séries temporais: componentes da série e técnicas previsão. Utilização de planilha eletrônica e\/ou pacote computacional de estatística.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5681":{"codigo":"INE5681","nome":"Modelagem e Automação de Processos de Negócios","ementa":"Gestão de negócios pela visão de processos de negócio. Modelagem da arquitetura e de regras de negócio. Ciclo da gestão de processos de negócio. Notações e métodos para modelagem de processos. Tópicos avançados em modelagem de processos, incluindo introdução à automação e indicadores de processos e aos sistemas para gestão de processos, e integração com requisitos de sistema e desenvolvimento de software.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5312 ou DAS5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ANT7003":{"codigo":"ANT7003","nome":"Relações Inter-étnicas","ementa":"Grupos  étnicos.  Processos  sócio-culturais  de  construção  de  identidade étnicas. Particularidades históricas e processos de diferenciação. Etnicidades e questões raciais, acomodações e conflitos. Sociedades pluriétnicas, cultura e política.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5100":{"codigo":"DAS5100","nome":"Atividades Complementares","ementa":"Esta disciplina (optativa geral) objetiva validar atividades complementares do estudante como Iniciação Científica, Presidência da Empresa Júnior do Curso ou do Centro Acadêmico do mesmo e representações discente conforme critérios estabelecidos no PPC do Curso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5931":{"codigo":"DAS5931","nome":"Programa de Intercâmbio I","ementa":"Participação em Programa de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agências de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5932":{"codigo":"DAS5932","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programa de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5931","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5037":{"codigo":"EGC5037","nome":"Felicidade e Bem-Estar no Ambiente  Acadêmico","ementa":"Bem-estar e felicidade. Fatores que influenciam no bem-estar e na felicidade. Inteligência Emocional. Emoções positivas. Equilíbrio emocional e atenção plena. Autoconhecimento. Relações humanas. Gestão do estresse e da ansiedade. Hábito: desenvolvendo disciplina. Reconhecendo e trabalhando as crenças.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"}}},"20241":{"id":"701","codigo":20241,"codigo_curso":220,"carga_horaria_ufsc":4464,"carga_horaria_mec":3600,"aulas_semana_min":14,"aulas_semana_esperado":26,"aulas_semana_max":31,"num_periodos_min":8,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao currículo  2024.1","ucs":{"DAS5334":{"codigo":"DAS5334","nome":"Introdução à Informática para Automação","ementa":"Princípios gerais da Informática: princípios gerais de concepção de um programa de computador; técnicas de modularização; linguagens de programação; carcterísticas gerais; aplicação de uma linguagem de alto nível; aplicação da informática à automação industrial.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5412":{"codigo":"DAS5412","nome":"Introdução à Engenharia de Controle e Automação","ementa":"Conceitos básicos de Engenharia de Controle e Automação. Equipamentos básicos. Metodologias e ferramentas de Engenharia. Experimentos de prototipagem. Apresentação e discussão da profissão de Engenharia de Controle e Automação. Funções do engenheiro no contexto tecnológico, humano e social. Apresentação e discussão do curso de Engenharia de Controle e Automação. Visita a  Laboratórios do curso. Desenvolvimento de projeto autoral de engenharia: levantamento de problema  relevante; proposta de solução; desenvolvimento de um protótipo funcional para a solução do Problema.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"ECZ5102":{"codigo":"ECZ5102","nome":"Conservação de Recursos Naturais","ementa":"Estrutura, funcionamento e dinâmica de ecossistemas. Efeito da ação antrópica sobre os ecossistemas. Legislação e Conservação dos recursos naturais.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EGR5606":{"codigo":"EGR5606","nome":"Desenho Técnico para Automação","ementa":"Introdução ao desenho técnico a mão livre. Normas para o Desenho Técnico. Técnicas fundamentais de traçado a mão livre. Sistemas de representação: 1º e 3º diedros. Projeção ortogonal de peças simples. Vistas omitidas. Contagem e proporções. Perspectivas axonométricas, isométricas, bimétrica, trimétrica. Perspectiva cavaleira. Esboços cotados. Introdução ao CAD. Contagem. Noções de cortes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5101":{"codigo":"FSC5101","nome":"Física I","ementa":"Introdução aos conceitos fundamentais da cinemática, dinâmica e estática. Leis de conservação da energia e do momento linear.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3110":{"codigo":"MTM3110","nome":"Cálculo 1","ementa":"Cálculo de funções de uma variável real: limites; continuidade; derivada; aplicações da derivada (taxas de variação, retas tangentes e normais, problemas de otimização e máximos e mínimos); integral definida e indefinida.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101 ou MTM5801","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5102":{"codigo":"DAS5102","nome":"Fundamentos da Estrutura da Informação","ementa":"Estrutura da informação. Vetores; Listas (alocação seqüencial, alocação encadeada); Árvores. Tabelas. Grafos: representações, distâncias, caminho mínimo. Tipos abstratos de dados; programação orientada a objetos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"DAS5334","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5105":{"codigo":"EEL5105","nome":"Circuitos e Técnicas Digitais","ementa":"Sistemas de numeração e códigos numéricos. Álgebra Booleana. Funções e portas lógicas. Portas lógicas CMOS. Síntese e otimização de circuitos lógicos. Circuitos combinacionais. Circuitos sequenciais. Máquinas de estados finitos. Relógio e temporização. Modelo bloco operativo\/bloco de controle. Introdução às linguagens de descrição de hardware (HDL). Dispositivos lógicos programáveis.","carga_horaria":90,"fase_sugestao":2,"equivalencia":"","prerequisito":"DAS5334","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5002":{"codigo":"FSC5002","nome":"Física II","ementa":"Estudo da Cinemática e Dinâmica da rotação de corpos rígidos. Oscilações e ondas Mecânicas(som). Estática e Dinãmica dos Fluídos. Noções sobre temperatura, calor, princípios da Termodiâmica e teoria cinética dos gases.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"FSC5101 e MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5122":{"codigo":"FSC5122","nome":"Física Experimental I","ementa":"Complementação  dos conteúdos de mecânica, acústica, termologia. Obtida através de montagem e realização de experiências, em número de 12 (doze), versando sobre os tópicos acima.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"FSC5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3120":{"codigo":"MTM3120","nome":"Cálculo 2","ementa":"Aplicações da integral definida. Técnicas de integração (por partes, substituição trigonométrica, frações parciais). Integral imprópria. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies. Funções de várias variáveis. Derivadas parciais. Máximos e mínimos de funções de duas variáveis.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"(MTM3102 e MTM3111) ou MTM5803","prerequisito":"MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3121":{"codigo":"MTM3121","nome":"Álgebra Linear","ementa":"Matrizes. Determinantes. Sistemas lineares. Espaço vetorial real. Produto interno. Transformações lineares. Autovalores e autovetores de um operador linear. Diagonalização. Aplicações da Álgebra Linear.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM3112 ou MTM5812","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5210":{"codigo":"DAS5210","nome":"Introdução ao Controle de Processos","ementa":"-Introdução da problemática de controle de processos: visão intuitiva, motivação prática e exemplos de aplicações. Conceitos básicos: modelos estáticos e dinâmicos, variáveis manipuladas e controladas, perturbações, ponto de operação, sinais de referência, realimentação e pré-alimentação. Revisão e introdução de noções básicas de Física e Cálculo aplicadas ao Controle de Processos; noções de linearidade e linearização, máximos e mínimos de funções. Ações de controle básicas: proporcional, integral e derivativa; ajuste de controladores com métodos empíricos; exemplos práticos e simulações numéricas. Outros conceitos e ferramentas: controle por camadas, escolha de referências e pontos de operação baseada em critérios de custo econômico ou de energia. Laboratório: 18 h.a.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"(DAS5412 e FSC5101 e MTM3110) ou (DAS5412 e FSC5101 e MTM3101)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5332":{"codigo":"DAS5332","nome":"Arquitetura e Programação de Sistemas Microcontrolados","ementa":"Arquiteturas de microprocessadores. Programação de microprocessadores: tipos e formatos de instruções, modos de endereçamento, linguagens Assembly ou C. Memória. Entrada\/Saída. Dispositivos periféricos, interrupção, acesso direto a memória. Barramento padrões. Ferramentas para análise, desenvolvimento e depuração. Projetos com microprocessadores. Laboratório: 36 h.a. - Programação, uso de ferramentas de análise, desenvolvimento e depuração. Projeto de aplicações com microprocessadores","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EEL5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ECV5215":{"codigo":"ECV5215","nome":"Mecânica dos Sólidos I","ementa":"Solicitações internas: vinculação, reações, esforços solicitantes, diagramas. Tensão e deformação em carregamentos axiais. Cisalhamento puro: tensão em ligações, distorção. Torção. Flexão simples: propriedades geométricas de seções transversais de vigas, estudo das tensões. Cisalhamento em vigas longas.  Solicitações compostas.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"","prerequisito":"FSC5002 e MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FSC5113":{"codigo":"FSC5113","nome":"Física III","ementa":"Análise dos principais fenômenos da eletricidade  e magnetismo abrangendo o estudo de campo elétrico, potencial elétrico, capacitor, corrente elétrica, força eletromotriz, campo magnético e indução eletromagnética.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"FSC5002","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3103":{"codigo":"MTM3103","nome":"Cálculo 3","ementa":"Integração múltipla: integrais duplas e triplas. Noções de cálculo vetorial: curvas e superfícies. Campos escalares e vetoriais. Integrais de linha e de superfícies. Teoremas de Green, Stokes e da Divergência.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM5804","prerequisito":"MTM3120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MTM3131":{"codigo":"MTM3131","nome":"Equações Diferenciais Ordinárias","ementa":"Equações diferenciais ordinárias de primeira ordem. Equações diferenciais ordinárias lineares homogêneas de ordem n. Equações diferenciais ordinárias lineares não homogêneas de ordem 2. Noções gerais de Transformada de Laplace. Sistemas de Equações Diferenciais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"MTM3102 ou MTM5814","prerequisito":"MTM3120 e MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5103":{"codigo":"DAS5103","nome":"Cálculo Numérico para Controle e Automação","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante.Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Métodos dos mínimos quadrados e otimização quadrática. Integração numérica. Solução numérica de equações diferenciais e simulação numérica. Aplicações a problemas de controle e automação envolvendo implementações computacionais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"DAS5102 e MTM3110 e MTM3121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5214":{"codigo":"DAS5214","nome":"Sinais e Sistemas Lineares","ementa":"Introdução aos sinais e sistemas lineares em tempo contínuo e discreto. Representação matemática de sistemas lineares. Análise no domínio do tempo de sistemas lineares e invariantes no tempo (LIT): resposta total, resposta ao impulso, convolução. Análise de sistemas LIT usando a transformada de Laplace. Função de transferência, polos e zeros. Estabilidade e influência de polos e zeros na resposta temporal. Álgebra de blocos. Resposta em frequência e análise via diagramas de Bode. Aplicações em controle. Transformada de Fourier de sinais em tempo contínuo. Transformada de Fourier de sinais amostrados, aliasing e taxa de amostragem. Equações a diferenças. Transformada Z: definições e propriedades. Análise de sistemas LIT em tempo discreto usando a Transformada Z. Resposta em frequência de sistemas em tempo discreto. Sistemas em tempo contínuo LIT controlados por controladores discretos: equivalente discreto.","carga_horaria":108,"fase_sugestao":4,"equivalencia":"","prerequisito":"(DAS5210 e MTM3131) ou (DAS5210 e MTM3102 e MTM3121) ou (DAS5210 e MTM3102 e MTM3112)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5307":{"codigo":"DAS5307","nome":"Sistemas de Automação Discreta","ementa":"Introdução aos sistemas de produção automatizados: níveis hierárquicos da automação fabril, visão geral dos equipamentos programáveis utilizados em sistemas automatizados de produção. Sensores e atuadores discretos. Componentes eletromecânicos: chaves, solenóides, relés. Lógica de Relés. Controladores Lógicos Programáveis (CLP): arquitetura, programação em LD, exemplos de aplicação. Projeto de programas de CLP (GRAFCET). Outras linguagens de programação: SFC, FBD, ST, IL. Controle de entradas e saídas analógicas com CLP. Dispositivos de IHM. Sistemas SCADA. Comunicação entre PC e CLP. Redes de CLP. Padrão OPC. Sensores e atuadores inteligentes.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"DAS5412 e EEL5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5308":{"codigo":"DAS5308","nome":"Programação de Sistemas Automatizados","ementa":"Computadores tipo PC, IC, tablet e sistemas embarcados na Automação: arquitetura, principais componentes e exemplos de aplicação. Plataformas embarcadas microprocessadas voltadas ao projeto de controladores. Arquiteturas de software voltadas ao projeto de controladores tempo real. Interface entre plataformas embarcadas e sensores e atuadores. Programação de comunicação entre sistema embarcado e IHM. Programação orientada a objetos voltada ao desenvolvimento de sistemas de supervisão e IHM. Boas práticas de programação. Laboratório: 36 h.a.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"DAS5102 e DAS5332","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL7540":{"codigo":"EEL7540","nome":"Circuitos Elétricos para  Automação","ementa":"Análise de circuitos em corrente contínua: Conceitos básicos (carga, corrente, tensão, potência e energia), elementos de circuito, leis de Kirchhoff (análise por nós e por malhas), linearidade, superposição, transformação de fontes, teoremas de Thévenin e de Norton e máxima transferência de potência. Análise de circuitos monofásicos em regimente permanente senoidal: fasores, impedância, valor eficaz, potência ativa, reativa, aparente e complexa, fator de potência, correção de fator de potência, resposta em frequência e filtros. Análise de circuitos trifásicos em regimente permanente senoidal: sistema trifásico balanceado, sequência de fases, ligações em delta e em estrela e potência em sistemas trifásicos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"FSC5113 e MTM3131","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INE5108":{"codigo":"INE5108","nome":"Estatística e Probabilidade para Ciências Exatas","ementa":"Teoria da probabilidade. Variáveis aleatórias e distribuição   de probabilidade. Principais distribuições de  probabilidade    discretas. Distribuição normal. Outras distribuições de probabilidade contínuas. Estimação de parâmetros. Testes de hipóteses.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"MTM3110","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5109":{"codigo":"DAS5109","nome":"Modelagem e Simulação de Processos","ementa":"Processos industriais: modelagem fenomenológica, representação por diagramas de blocos e diagramas de instrumentação. Balanço de massa e energia dos processos de reação química. Processos contínuos e de batelada. Modelagem com parâmetros concentrados e distribuídos. Colunas de destilação. Simulação de processos; uso de simuladores acadêmicos e industriais. Prática: Experimentos em laboratório com plantas piloto e processos simulados em softwares industriais para estudo do comportamento de processos de vários tipos (térmicos, hidráulicos, de fermentação e destilação, etc.).","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"DAS5214 e EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5203":{"codigo":"DAS5203","nome":"Modelagem e Controle de Sistemas e Eventos Discretos","ementa":"Sistemas a Eventos Discretos(SEDs): conceituação, classificação, propriedades, exemplos; Redes de Petri e Verificação: definições, propriedades, análise, implementação, modelagem; verificação de propriedades; Autômatos e controle supervisório: Autômatos de Estados Finitos: conceituação básica, operações, controle supervisório de SEDs baseado em autômatos; Experiências práticas de uso dos formalismos na resolução de problemas de modelagem, análise e síntese de controladores para SEDs.","carga_horaria":90,"fase_sugestao":5,"equivalencia":"","prerequisito":"DAS5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5320":{"codigo":"DAS5320","nome":"Metodologia para Desenvolvimento de Sistemas","ementa":"Requisitos de qualidade de Sistemas e de Software. Metodologias de desenvolvimento de Sistemas e  Software Orientadas a Objetos. Criação de Modelos. Ferramentas para análise, projeto e testes.  Ambientes de desenvolvimento. Aplicação das metodologias, ferramentas e ambientes a problemas de  Automação. Estudo de caso. Laboratório: 18 h-a","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EEL7550":{"codigo":"EEL7550","nome":"Eletrônica Aplicada","ementa":"Circuitos lineares com amplificador operacional: amplificadores e modelos; o amplificador operacional ideal; principais aplicações do amplificador operacional. Não-idealidades do amplificador operacional e suas influências no desempenho de circuitos com amplificador operacional. Diodos: o diodo ideal; diodo de junção e suas características terminais; modelos pequenos sinais; diodos Zener; diodos emissores de luz; optoacopladores e sua aplicação em isolação de circuitos digitais; análise de circuitos com diodo (retificador, roda livre, limitador, detector de pico). Transistores BJT e MOSFET: princípios de operação e características estáticas; modelos pequenos sinais; aplicação como chave, como fonte de corrente e como amplificador de potência.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5235":{"codigo":"EMC5235","nome":"Metrologia Industrial","ementa":"Processo de medição. Vocabulário típico da área de metrologia; características metrológicas. Sistema internacional de unidades. Procedimentos padronizados para avaliação de incertezas de medição. Confiabilidade metrológica; rastreabilidade; calibração. Definição de limites de conformidade em medições. Princípio de funcionamento e especificação dos principais transdutores empregados para automação da medição de temperatura (termopares, termistores, termoresistores), deformação (extensômetros de resistência em circuitos de ponte), força (células de carga extensométricas e piezelétricas), pressão (manômetros com saída em grandezas elétricas), rotação (encoders digitais, tacogeradores, relutância variável), vazão (deprimogênios, deslocamento positivo, turbinas, eletromagnéticos, ultrassônicos, vórtices, Coriolis, térmicos), nível (flutuadores, ultrassônicos, radar, capacitivos, baseados em força ou pressão) e deslocamento (resistivos, capacitivos, indutivos, óticos). Principais transdutores com saída discreta aplicados em automação de processos: detectores de presença, termostatos, pressostatos, chaves de nível. Tecnologias emergentes para automação do processo de medição.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5236","prerequisito":"EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5425":{"codigo":"EMC5425","nome":"Fenômenos de Transportes","ementa":"Conceitos fundamentais em mecânica dos fluidos; dimensões e unidades; campos escalar, vetorial e tensorial; viscosidade. Hidrostática; pressão em fluido estático, manômetros; forças sobre superfícies planas e curvas submersas. Análise de escoamento; leis básicas para sistemas e volumes de controle;  conservação da massa; equação da quantidade de movimento linear; primeira lei da termodinâmica; equação de Bernoulli. Escoamento viscoso incompressível; escoamento em tubos;  diagrama de  Moody; perdas de carga distribuidas e localizadas. Conceitos fundamentais em transmissão de calor;  dimensões e unidades; leis básicas  da transmissão de calor; condução, convecção e radiação; mecanismos combinados de transmissão de calor. Condução unidimensional em regime permanente; espessura crítica de isolamento; aletas; estruturas compostas. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"FSC5002 e MTM3103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CNM7820":{"codigo":"CNM7820","nome":"Aspectos Econômicos e Sociais da Automação","ementa":"Os processos de inovação: definições, determinantes, impactos. O desenvolvimento tecnológico como processo social. Paradigmas e trajetórias tecnológicas, revoluções tecnológicas e industriais. A relevância das políticas públicas para o desenvolvimento de capacidades tecnológicas. A sociedade do conhecimento e o atual paradigma tecno-produtivo. Dilemas éticos da inteligência artificial e impactos econômicos e sociais da automação. Inovação e automação no Brasil. O sistema nacional de inovação.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"CNM5111","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5120":{"codigo":"DAS5120","nome":"Sistemas de Controle","ementa":"Revisão de sinais e sistemas. Estruturas de Controle. Controle realimentado. Estabilidade e resposta no tempo de sistemas realimentados. O método de lugar de raízes (LR) como ferramenta de análise; Interpretação frequencial. Diagramas de Bode e polares e estudo de estabilidade. Projeto de controladores por realimentação com o método LR (contínuo e discreto). O controle com dois graus de liberdade. Diagramas polo-zero e sua relação com a resposta no tempo. Rejeição de perturbações em sistemas de controle. Controle por realimentação e pré-alimentação. Controle cascata. Controle por relação. Outras estruturas e configurações de controle de processos. Controle de tanques pulmão, controle de faixa dividida, Preditor de Smith e Preditor de Smith filtrado. PID industriais: configuração; estruturas; métodos de sintonia; aspectos práticos e operacionais.Implementação de controladores digitais. Código de controle. Introdução ao controle robusto. Laboratório com simulação e experimentos que usam a implementação de controladores em microcontroladores, placas AD\/DA e PC e com o uso de PID industriais.","carga_horaria":108,"fase_sugestao":6,"equivalencia":"","prerequisito":"DAS5109","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5151":{"codigo":"DAS5151","nome":"Instrumentação em Controle","ementa":"Medição: definições básicas envolvidas em sistemas de medição; características estáticas e dinâmicas de sistemas de medição; especificação e análise de sistemas de medição para aplicação em sistemas de controle. Condicionamento de sinais de medição: medição de resistência elétrica a dois, três e quatro fios; ponte de Wheatstone; divisores resistivos e shunts; amplificação; isolação; ajuste de impedâncias de entrada e saída; ruídos e interferências. Aquisição de dados: principais tipos de sistemas de aquisição de dados para instrumentação; sample-and-hold; conversores A\/D e D\/A. Atuação: revisão das principais estratégias empregadas para acionamento de cargas (transistor como chave, acionamento por PWM, ponte H, amplificadores proporcionais de potência). Controladores digitais: aspectos de implementação, quantização.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"DAS5109 e EEL7550 e EMC5235","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5314":{"codigo":"DAS5314","nome":"Redes de Computadores para Automação","ementa":"Redes de Computadores: Aspectos arquiteturais; O modelo de referência para interconexão de sistemas abertos (RM-OSI); Estudo de camadas com exemplos de protocolos; Interconexão de redes: repeaters, bridges, routers, gateways; Concentradores: hubs, switches; Redes locais industriais: redes e os níveis hierárquicos de integração; Requisitos das redes industriais; Padrões em redes industriais: IEEE 802, MAP\/TOP; Fieldbus (FIP, PROFIBUS, Foundation Fieldbus); Visão geral de produtos.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"DAS5307 e DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EEL5193":{"codigo":"EEL5193","nome":"Máquinas e Acionamentos Elétricos para Automação","ementa":"CIRCUITOS TRIFÁSICOS: Conceitos básicos, Potências em circuitos trifásicos, Conexão ?Y; \nPRINCÍPIOS DE FUNCIONAMENTO DE CONVERSORES ESTÁTICOS: Conversores CC básicos, unidirecionais e bidirecionais. Retificadores monofásicos e trifásicos (diodo) e controlados (tiristor), Inversores monofásicos e trifásicos; \nPRINCÍPIOS DE MÁQUINAS ELÉTRICAS: Geradores, Motores, Características estáticas; \nO MOTOR CC E SEUS ACIONAMENTOS: Aspectos construtivos, Princípios de operação, Equações de velocidade e torque, Parâmetros; \nO MOTOR DE INDUÇÃO E SEUS ACIONAMENTOS: Aspectos construtivos, Acionamento direto, Chave ?Y, Soft \nStarter, Controle V\/F, Inversores de frequência; \nO MOTOR SÍNCRONO E SEUS ACIONAMENTOS: Aspectos construtivos, Princípios de operação; \nMOTORES ESPECIAIS: Motor-de-passo, Servomotor CC.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5467":{"codigo":"EMC5467","nome":"Acionamentos Hidráulicos e Pneumáticos para Automação","ementa":"Acionamento Hidráulico: Princípios de funcionamento e características principais dos sistemas hidráulicos; Circuitos hidráulicos fundamentais: Servoválvulas; Dinâmica dos sistemas hidráulicos; Noções de especificação. Acionamento Pneumático: Princípios de funcionamento e características principais dos sistemas pneumáticos; Circuitos pneumáticos; Dinâmica dos sistemas pneumáticos; Noções de especificação. Laboratório (equivalente a 18 h.): Experiências sobre circuitos hidráulicos e pneumáticos.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"","prerequisito":"Inválida: DAS5214DAS5307 e EMC5425 e ","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS2351":{"codigo":"EPS2351","nome":"Gerenciamento de Projetos","ementa":"Conceito de projeto. Fases e componentes de um projeto. Estruturas organizacionais e o gerenciamento de projetos. Planejamento e controle de projetos. O gerente de projeto e as competências interpessoais. Portfólio em gestão de projetos. Modelos de gerenciamento ágil e tradicional de projetos. Ferramentas computacionais de apoio ao projeto. Tendências e oportunidades em gerenciamento de projetos.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"ECZ5102 e INE5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"DAS5105":{"codigo":"DAS5105","nome":"Projeto Integrador","ementa":"Estudo da teoria sobre desenvolvimento e gestão de projetos. Revisão sobre metodologias de  desenvolvimento de projetos. Projeto de um sistema automatizado: a cada semestre, será discutido um  problema a ser tratado por cada grupo de trabalho.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5109 e DAS5203 e DAS5320 e EEL7550 e EPS2351","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"DAS5142":{"codigo":"DAS5142","nome":"Sistemas Dinâmicos","ementa":"Sistemas dinâmicos lineares e não lineares. Exemplos em controle de processos, mecatrônica, sistemas biológicos, sistemas de energia. etc. Problemas não lineares na engenharia de controle. Representação matemática por variáveis de estado. Espaço de estados (plano de fase). Análise qualitativa de sistemas dinâmicos (equilíbrios, ciclos limites e comportamento aperiódico). Teorema da linearização de Hartman-Grobman.Estabilidade Estrutural. Bifurcações em sistemas dinâmicos. Diagrama de bifurcações. Não linearidades estáticas em sistemas de controle (saturação, zona morta, histerese, folga, atrito, etc.) Estudo de casos de sistemas de controle com saturação, válvulas de controle industriais não lineares (características estáticas de igual porcentagem e de abertura rápida) e atrito.Métodos de analise no domínio frequêncial para detecção de ciclos limites: método do balanço harmônico (função descritiva) e extensão do critério de Nyquist. Sistemas realimentados com restrições na ação de controle: saturação e métodos de Anti-windup. Análise de estabilidade de sistemas dinâmicos pelo método de Lyapunov. Principais técnicas de projeto de controladores para sistemas dinâmicos: (i) compensação de não linearidades estáticas (folga, quantização, zona morta, atrito); (ii) linearização por realimentação de estado e de saída; (iii) projeto baseado em funções de Lyapunov.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5318":{"codigo":"DAS5318","nome":"Avaliação de Desempenho de Processos de Sistemas Organizacionais","ementa":"Introdução à medição e avaliação de desempenho. Variabilidade de sistemas e distribuições estatísticas. Coleta e tratamento estatístico de dados. Processos organizacionais. Indicadores de desempenho e KPIs. Tipos de Sistemas de Produção e de Manufatura\/Industriais. Seleção de indicadores de desempenho. Construção de indicadores de desempenho. Metodologia de construção de modelos de simulação para avaliação de desempenho. Modelagem de Processos. Análise de Impactos sócio-econômico-ambientais e de Riscos de soluções propostas. Modelagem, implementação e avaliação de desempenho por simulação de sistemas a eventos discretos em empresas. Apresentação de resultados de avaliação de desempenho.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5203 e INE5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EEL5354":{"codigo":"EEL5354","nome":"Eletrotécnica para Automação","ementa":"PRINCÍPIOS DE SISTEMAS ELÉTRICOS: Princípios de geração, transmissão e distribuição de energia elétrica, Noções de tarifação, Princípio da compensação de energia reativa, Transformadores de potência; INSTALAÇÕES DE BAIXA TENSÃO: Princípios da proteção contra choques elétricos, Aterramentos, Projeto de instalações elétricas, Equipamentos elétricos para instalação em baixa tensão, Dispositivos de proteção, Diagrama Unifilar; SELEÇÃO E INSTALAÇÃO DE MOTORES ELÉTRICOS: Dimensionamento de potência, Caixa redutora, Aspectos práticos de partida de motores, Dispositivos de manobra (contatores e relés), Projeto de circuitos alimentadores, Proteção. Laboratório: 18 horas-aula.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EEL5193 e EEL7540","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5251":{"codigo":"EMC5251","nome":"Introdução à Robótica Industrial","ementa":"Componentes dos robôs; Analise de propriedades cinemáticas; Cinemática de robôs; Introdução à estática de robôs; Introdução à dinâmica dos robôs; Geração de trajetórias para robôs; Controle de robôs; Sensores; Programação de robôs; Aplicações de robôs.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMC5258":{"codigo":"EMC5258","nome":"Introdução à Automação da Manufatura","ementa":"Introdução à Manufatura. Automação de Sistemas de Manufatura: Definição, Níveis e Necessidade da Automação. Monitoramento de Segurança, Diagnósticos de Manutenção, Detecção de Erro e Recuperação. Layouts: Funcional, Por Produto, Posicional, Contínuo, Celular. Manufatura Celular: Definição, Tecnologia de Grupo, Formação de Células. Sistemas Flexíveis de Manufatura (FMS). Sistemas Automatizados de Montagem. Sistemas Automatizados de Armazenamento. Veículos Guiados Automaticamente (AGVs). Princípios Básicos de Materiais. Tratamentos Térmicos. Ensaios Mecânicos. Processos de Fabricação: Fundição, Conformação Mecânica, Usinagem, Soldagem. CAD\/CAE (produtos): Modelagem Geométrica, Análise de Propriedades de Massa, Verificação de Interferência, Análise de Tolerâncias. Projeto para a Montagem Automatizada. CAPP\/CAM (processos): Seleção de Processos de Fabricação, Seleção de Máquinas, Ferramentas e Dispositivos de Fixação, Simulação de Trajetórias.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"","prerequisito":"DAS5307","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5402":{"codigo":"DAS5402","nome":"Ética e Aspectos de Segurança em Sistemas de Controle e Automação","ementa":"Ética aplicada a sistemas de engenharia. Segurança em sistemas automatizados. Responsabilidade técnica. Legislação e estatísticas de acidentes de trabalho. Normas regulamentadoras de segurança. Combate a incêndios. Análise probabilística de risco (PRA). Elementos de confiabilidade. Análise de  modos de falha (FMEA). Árvore de falhas FTA. Princípios de manutenção baseada no monitoramento (CBM).","carga_horaria":36,"fase_sugestao":8,"equivalencia":"DAS5401","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2300,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"DAS5502":{"codigo":"DAS5502","nome":"Estágio em Controle e Automação","ementa":"Acompanhamento e participação em projetos de engenharia que envolvam atividades relacionadas (mas não limitadas) às disciplinas desenvolvidas ao longo do curso. Identificação de problemas de Engenharia e propostas de solução. Projeto de Engenharia de Controle e Automação.   Revisão bibliográfica sobre o tema do estágio. Inovação e Atuação Empreendedora em Engenharia. Metodologia de projeto. Desenvolvimento de projeto. Fundamentação teórica. Avaliação crítica dos impactos de soluções de Engenharia nos contextos social, legal, econômico e ambiental. Escrita de  relatório técnico.","carga_horaria":216,"fase_sugestao":8,"equivalencia":"DAS5501","prerequisito":"DAS5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EPS7076":{"codigo":"EPS7076","nome":"Gestão Econômica e de Investimentos","ementa":"Matemática financeira: juros simples e compostos; relações de equivalência; taxas de juros e taxa ajustada à inflação; sistemas de amortização. Análise de investimentos: payback descontado; valor presente líquido; taxa interna de retorno; projeção de fluxo de caixa. Análise de demonstrações financeiras: balanço patrimonial; demonstração de resultado do exercício; indicadores de análise.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"EPS5211","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":900,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT6699":{"codigo":"ZZT6699","nome":"Disciplinas Optativas Profissionalizantes","ementa":"","carga_horaria":144,"fase_sugestao":8,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6700":{"codigo":"ZZT6700","nome":"Disciplinas Optativas Profissionalizantes","ementa":"","carga_horaria":288,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"ZZT6701":{"codigo":"ZZT6701","nome":"Disciplinas Optativas Livres","ementa":"","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"DAS5512":{"codigo":"DAS5512","nome":"Projeto de Fim de Curso","ementa":"Projeto de Engenharia de Controle e Automação. Identificação de problemas de Engenharia. Revisão bibliográfica a respeito do tema de projeto. Inovação e incentivo à atuação empreendedora em Engenharia. Metodologia de projeto. Fundamentação teórica. Desenvolvimento de projeto de automação. Avaliação crítico-reflexiva dos impactos das soluções de engenharia nos contextos social, legal, econômico e ambiental. Defesa de projeto.","carga_horaria":360,"fase_sugestao":10,"equivalencia":"","prerequisito":"DAS5502 ou DAS5501","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"DAS5131":{"codigo":"DAS5131","nome":"Controle Multivariável","ementa":"Representação por variáveis de estado de sistemas contínuos e amostrados. Metodologia de análise e projeto de sistemas de controle multivariável. Controlabilidade e observabilidade. Decomposição canônica de sistemas lineares. Formas canônicas. Relação entre a representação por variáveis de estado e a matriz função de transferência. Pólos e zeros multivariáveis. Controle com o estado mensurável. Realimentação de estados. Propriedades: caso monovariável, extensão de resultados. Conceito de estimador de estado; Observadores; Controle usando realimentação de estado estimado. Teorema da separação; Introdução ao conceito de compensação dinâmica. Laboratório: (18 hs) - Utilização de ferramentas de análise e projeto de sistemas multivariáveis. (PACSC). Aplicação a processos físicos tipicamente multivariáveis. (coluna de destilação, motores ac., etc).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5200":{"codigo":"DAS5200","nome":"Atividades Complementares","ementa":"Esta disciplina (optativa livre) objetiva validar atividades complementares do(a) estudante como Iniciação Científica, monitoria, Presidência da Empresa Júnior ou do Centro Acadêmico do Curso,  representações discentes, etc, conforme critérios estabelecidos no Projeto Pedagógico do Curso.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5300":{"codigo":"DAS5300","nome":"Ações de Extensão","ementa":"Ações de Extensão: I - Projetos , II - Eventos e III - Cursos.","carga_horaria":216,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"DAS5306":{"codigo":"DAS5306","nome":"Programação Concorrente e Sistemas de Tempo Real","ementa":"Programação concorrente: motivação, mecanismos de comunicação e de sincronização. Sistemas operacionais: características e uso, gerência do processador, da memória e de outros recursos, estudos de caso. Sistemas com requisitos de tempo real. Políticas de escalonamento de tempo real. Linguagens com características de programação em tempo-real. Projeto de executivo tempo-real. Laboratório: 18 h.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"DAS5303","prerequisito":"DAS5308","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5315":{"codigo":"DAS5315","nome":"Sistemas Distribuídos para Automação","ementa":"Sistemas Distribuídos: Modelo Cliente\/Servidor; RPC e RMI; Comunicação de Grupo; Servidor de Nomes (DNS, X.500, LDAP); Suportes de Middleware; Estudo de caso: CORBA; Serviço de Arquivos Distribuídos (NFS, Andrews File System); Sincronização em Sistemas Distribuídos (Tempo e Estado Global). Projeto de aplicação distribuída.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"DAS5331","prerequisito":"DAS5314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5319":{"codigo":"DAS5319","nome":"Integração de Sistemas Industriais e Empresariais","ementa":"Integração de sistemas e seus requisitos. Integração de empresas, processos, sistemas, pessoas e máquinas. O modelo de referência ISA-95 pirâmide da automação. CIM e Indústria 4.0. Transformação Digital. Principais sistemas envolvidos em integrações empresariais e industriais (ERP, PIMS\/MES, BPM, sistemas ciberfísicos, IoT). Abordagens, estratégias e patterns de integração e interoperação de sistemas gerais e legados. Arquiteturas e Modelos de integração. Arquiteturas Orientadas a Serviços. ESB (Enterprise Service Bus).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"DAS5316","prerequisito":"Inválida: DAS5314DAS5320 e ","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5341":{"codigo":"DAS5341","nome":"Inteligência Artificial Aplicada a Controle e Automação","ementa":"Algorítmos de procura; árvores de decisão; representação do conhecimento (Sistemas de Produção, Frames). Sistemas Especialistas. Linguagens PROLOG, LISP. Ferramentas de Desenvolvimento de Sistemas Especialistas. Aplicações. Redes Neurais. Laboratório: 36 horas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5430","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2000,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5520":{"codigo":"DAS5520","nome":"Processamento de Sinais","ementa":"Série de Fourier; Transformada de Fourier de sinais contínuos, discretos e amostrados; extração de características de sinais; aplicações em projetos de filtros contínuos e discretos, monitoramento e comunicações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5901":{"codigo":"DAS5901","nome":"Tópicos especiais em Controle: Introdução à Identificação e ao Controle Adaptativo","ementa":"Introdução: modelos de processos contínuo e discreto, modelos com perturbação, equação à diferença linear geral, métodos clássicos de identificação nos domínios do tempo e da freqüência. Métodos de identificação \"off-line\" e \"on-line\": mínimos quadrados, mínimos quadrados generalizado, variável instrumental, aproximação estocástica. Determinação de modelos contínuos a partir de dados amostrados. Processos variantes no tempo: fator de esquecimento variável, reinicialização da matriz de covariância, métodos de detecção de ruptura de modelos, fatorização UD, validação de modelos. Controladores adaptativos: alocação de polos, PID, DeadBeat, Dahlin, auto-ajustável de variância mínima, auto-ajustável de variância mínima generalizada: indireto e direto, PID auto-ajustável com estrutura GMV, preditivos: MAC, DMC, GPC.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL5810","prerequisito":"DAS5120 ou DAS5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5921":{"codigo":"DAS5921","nome":"Tópicos Especiais em Informática Industrial","ementa":"Instrumentação na indústria de P&G: Sensores e atuadores utilizados nas plantas de extração, produção, transporte e refino. Transmissores \"inteligentes\". Controladores industriais. Redes industriais fieldbus para P&G.:Principais padrões de redes tipo fielbus: CAN, ASi, Fieldbus foundation. Redes para áreas de segurança intrínseca (áreas sujeitas a risco de explosão ou incêndio). Aspectos de segurança intrínseca e tolerância a falhas. Algoritmos de escalonamento em tempo real. Controle e supervisão de instalações de P&G: Sistemas de controle baseados em redes industriais tipo fieldbus. Aulas práticas sobre uma planta piloto de laboratório (planta didática da empresa SMAR).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EEL5811","prerequisito":"DAS5214 e DAS5314","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5931":{"codigo":"DAS5931","nome":"Programa de Intercâmbio I","ementa":"Participação em Programa de Intercâmbio Acadêmico - decorrente de convênio assinado com Instituições de Ensino Superior, Agências de Fomento, Centros de Pesquisa e instituições semelhantes - visando a realização de atividades acadêmicas como cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5932":{"codigo":"DAS5932","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programa de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5931","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5944":{"codigo":"DAS5944","nome":"Tópicos Especiais em Controle: Instrumentação Aplicada à Industria de Petróleo e Gás","ementa":"Parte Teórica - Terminologia e definições básicas (alcance, amplitude, resolução, etc.) utilizadas no setor de instrumentação. Funções de instrumentos (indicador, transmissor, controlador, registrador, etc.). Classificação e identificação de instrumentos. Diagramas de processo de instrumentação. Sistemas de transmissão em corrente 4-20 mA. Sensores e transmissores para medir: Pressão, Temperatura e Vazão. Medidores para aplicações especiais: para prospecção, multifásicos, para detecção de vazamento, etc. Elemento final de controle. Válvulas. Tipos de válvulas de controle. Válvulas de segurança e reguladoras de pressão auto-operadas. Válvulas para aplicações específicas: gás-lift, check valve, etc. Bombas. Controladores industriais. Parte Prática - serão realizadas práticas sobre plantas piloto de laboratório (plantas didáticas da empresa ARMFIELD existentes no LCP-DAS).","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5214 e EEL7550","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5945":{"codigo":"DAS5945","nome":"Tópicos Especiais em Controle: Técnicas de Controle Aplicadas à Indústria de Petróleo e Gás","ementa":"Controle Preditivo: introdução; metodologia; algoritmos específicos; aplicações a processos da indústria de petróleo e gás.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5946":{"codigo":"DAS5946","nome":"Tópicos Especiais em Controle e Automação: Introdução à Engenharia do Petróleo e Gás","ementa":"O petróleo: noções de geologia; prospecção; perfuração; avaliação de formações; completação; reservatórios; elevação; processamento primário de fluídos e refino.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5947":{"codigo":"DAS5947","nome":"Tópicos Especiais em Controle e Automação: Introdução ao Controle para Indústria do Petróleo e Gás","ementa":"Aplicação das principais estratégias de controle aos equipamentos e processos da indústria de petróleo e gás. Estudo de casos: Reatores FCC, Fracionadores, Colunas de Destilação, trocadores de calor.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5948":{"codigo":"DAS5948","nome":"Tópicos Especiais em Controle e Automação: Seminário para à Industria do Petróleo e Gás","ementa":"Palestras sobre temas selecionados proferidas por especialistas, tratando de temas como: Geologia do Petróleo, Petrofísica, Perfuração\/Completação, Recuperação Avançada de Petróleo, Simulação de Reservatórios de Petróleo, Dutos, Refino: Separação de Hidrocarbonetos por Destilação, Produção de Biocatalisadores para utilização em biorrefino e biorremediação de áreas contaminadas com petróleo, Geração Termelétrica e Cogeração com Gás Natural, Gás Natural, Meio Ambiente, Política e Economia. Estruturação de seminário sobre o tema de pesquisa na área de petróleo, gás e biocombustíveis.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5214","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5951":{"codigo":"DAS5951","nome":"Tópicos Avançados em Controle e Automação I","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição, sendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e Automação e considerada como avançada no escopo. Deverá passar por análise do coordenador e colegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5952":{"codigo":"DAS5952","nome":"Tópicos Avançados em Controle e Automação II","ementa":"Código  de  disciplina  utilizado  para  fazer  reaproveitamento  de \ndisciplina cursada em outra instituição, sendo a disciplina cursada \nnão  equivalente  a  outra  disciplina  do  curso  de  Engenharia  de \nControle e Automação e considerada como avançada no escopo. \nDeverá passar por análise do coordenador e colegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5953":{"codigo":"DAS5953","nome":"Tópicos Avançados em Controle e Automação III","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5954":{"codigo":"DAS5954","nome":"Tópicos Avançados em Controle e Automação IV","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5955":{"codigo":"DAS5955","nome":"Tópicos Avançados em Controle e Automação V","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5956":{"codigo":"DAS5956","nome":"Tópicos Avançados em Controle e Automação VI","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5957":{"codigo":"DAS5957","nome":"Tópicos Avançados em Controle e Automação VII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5958":{"codigo":"DAS5958","nome":"Tópicos Avançados em Controle e Automação VIII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5959":{"codigo":"DAS5959","nome":"Tópicos Avançados em Controle e Automação IX","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5960":{"codigo":"DAS5960","nome":"Tópicos Avançados em Controle e Automação X","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5961":{"codigo":"DAS5961","nome":"Tópicos Avançados em Controle e Automação XI","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"DAS5962":{"codigo":"DAS5962","nome":"Tópicos Avançados em Controle e Automação XII","ementa":"Código de disciplina utilizado para fazer reaproveitamento de disciplina cursada em outra instituição,\nsendo a disciplina cursada não equivalente a outra disciplina do curso de Engenharia de Controle e\nAutomação e considerada como avançada no escopo. Deverá passar por análise do coordenador e\ncolegiado do curso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7125":{"codigo":"EEL7125","nome":"Instrumentação Biomédica","ementa":"Sensores, Transdutores e Visão Geral de Sistemas de Instrumentação. Circuitos Básicos com Amplificador Operacional. Amplificador Operacional Real, Limitações no Desempenho. Amplificadores para Instrumentação. Cálculo de erros em sistemas de aquisição de dados. Instrumentação eletrônica Sistemas de medição e Instrumentação Biomédica. Origem e medição de Biopotencias. Instrumentação de Laboratório Clínico. Instrumentos em geral utilizados em cardiologia. Equipamentos para o sistema respiratório. Sistemas de Imagem Médica. Tomografia computadorizada. Dispositivos Terapêuticos e Protéticos. O Conceito Integrado de Segurança Elétrica. Novos instrumentos e novas tecnologias. Aplicações e estudos de caso; experiência hands-on com sensores e desenvolvimento de sistemas eletrônicos e dispositivos para medição de sinais biomédicos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7307":{"codigo":"EEL7307","nome":"Introdução a Informática Médica","ementa":"Introdução aos sistemas de informática médica. Registro eletrônico de saúde. Grandezas e sinais biomédicos (ECG, EEG, PPG, EMG, outros). Processamento de sinais biomédicos: domínios do tempo, frequência e análise conjunta. Processamento de sinais biomédicos: PCA e ICA. Métodos de decisão e aprendizagem de máquina: Thresholding, KNN, árvores, RNA. Técnicas de diagnóstico por imagens: oftalmoscopia, ultrassonografia, tomografia computadorizada.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7324":{"codigo":"EEL7324","nome":"Engenharia Clínica para Uso Médico","ementa":"Conceitos de Engenharia Clínica: definição de engenharia clínica, de tecnologias em saúde, de equipamentos médicos-assistenciais, ciclo de vida dos equipamentos; Modelo de gestão e gerenciamento de tecnologias médico-hospitalares:  definição do modelo, domínios, impacto no ciclo de vida, conceitos de qualidade; Equipamentos médicos-assistenciais:  abordagem sobre equipamentos, funcionalidade, aplicação, diagrama de blocos, ensaios de desempenho e segurança. Principais atividades realizadas pela engenharia clínica: especificação, recebimento, instalação, treinamento, manutenção, substituição dos equipamentos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EEL7885":{"codigo":"EEL7885","nome":"Fundamentos de Engenharia Biomédica","ementa":"Áreas da engenharia biomédica: instrumentação biomédica, informática médica, bioengenharia e engenharia clínica; Funcionalidade de Sistemas Biológicos: Função dos sistemas e Tecnologias. Introdução processos fisiológicos e aplicações tecnológicas; Aspectos de Segurança Elétrica e Gerenciamento de Riscos, Biossegurança e proteção Radiológica em ambientes com tecnologias na Saúde; Introdução a instrumentação biomédica: Tecnologias e circuitos com aplicação na Engenharia Biomédica; Principais atividades desenvolvidas pela engenharia clínica: gestão e gerenciamento de tecnologia. Equipamentos médicos-assistenciais. Ensaios de desempenho e segurança.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5037":{"codigo":"EGC5037","nome":"Felicidade e Bem-Estar no Ambiente  Acadêmico","ementa":"Bem-estar e felicidade. Fatores que influenciam no bem-estar e na felicidade. Inteligência Emocional. Emoções positivas. Equilíbrio emocional e atenção plena. Autoconhecimento. Relações humanas. Gestão do estresse e da ansiedade. Hábito: desenvolvendo disciplina. Reconhecendo e trabalhando as crenças.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5123":{"codigo":"EMC5123","nome":"Mecanismos","ementa":"Introdução. Conceitos e notações aplicado a mecanismos. Estudo de tipos de mecanismos. Síntese dimensional de mecanismos articulados. Análise e cinemática de cames planos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"(MTM3120 e MTM3121) ou (MTM3112 e MTM3120) ou (MTM3102 e MTM3111 e MTM3121) ou (MTM3102 e MTM3112)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5219":{"codigo":"EMC5219","nome":"Tecnologia de Comando Numérico","ementa":"Conceituação de um Sistema de Comando Numérico. Princípios de funcionamento. Sistemas de acionamento. Controle de posição. Armazenamento das informações, etc. Equipamentos que utilizam sistemas de Comando Numérico. Diversos tipos de aplicações. Características peculiares  dos componentes mecânicos e eletrônicos. Manutenção. Noções de interligação entre diversos equipamentos e com sistemas de informação. Noções de programação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5227":{"codigo":"EMC5227","nome":"Automação de Processos de Soldagem","ementa":"Fundamentos dos processos de soldagem e suas variantes modernas, com ênfase em processos a arco elétrico: revisão dos processos de soldagem clássicos; inovações construtivas e eletrônicas e eletromecânicas dos processos; aplicações dos processos modernos e suas limitações; processos híbridos. Sistemas de mecanização \/ automação da soldagem e monitoração: fontes de soldagem e acessórios para alimentação de material, panorama geral sobre sistemas de automação da soldagem, programação e funcionalidades especiais de manipuladores para soldagem, integração\/ sincronização fonte de energia e manipuladores, aplicações e limitações de diferentes manipuladores e robôs para soldagem, sistemas sensoreados para soldagem adaptativa. Técnicas de monitoração \/ inspeção da solda, do sistema de soldagem e do movimento: ultrassom, radiografia, e vídeo-termografia, sensor tátil e filmagem de alta velocidade.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5246":{"codigo":"EMC5246","nome":"Administração de Operações de Manufatura","ementa":"Visão de engenharia da Gerência Operacional da Produção com ênfase na manufatura. Aspectos de Engenharia de Manufatura. Administração Operacional da Produção. Papel Estratégico e Objetivo da Produção. Apresentação do Jogo da Produção. Projeto da Rede de Operações Produtivas. Arranjo Físico e Fluxo. Tecnologia de Processo. Planejamento e Controle.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMC5257 e EPS5220","prerequisito":"EMC5258 ou EMC5245","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5301":{"codigo":"EMC5301","nome":"Introdução ao Projeto Manufatura-computador","ementa":"Esta disciplina tem como objetivo, fornecer um entendimento geral sobre os conceitos fundamentais que envolvem a área de CAE\/CAD\/CAM. O aluno deverá usar um software CAD\/CAM comercial, aplicando os conceitos aprendidos na área do projeto mecânico em geral. O uso das ferramentas de CAD\/CAM e o exercício dos conceitos de projeto mecânico lhe facultará o desenvolvimento de habilidades necessárias nos diversos estágios do projeto e manafatura de um produto.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EPS5313","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5415":{"codigo":"EMC5415","nome":"Trocadores de Calor","ementa":"Introdução  aos  trocadores  de  calor;  Conceitos  fundamentais;  Metodologia  de  projeto,  Projeto  termo-hidráulico  de  trocadores  bitubulares,  casco-e-tubos,  de  placas  e  compactos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMC5444":{"codigo":"EMC5444","nome":"Projeto de Sistemas Térmicos","ementa":"Metodologia do projeto. Noções de economia aplicada à análise de investimentos. Ajustes de equações. Modelação. Simulação. Otimização. Técnicas de otimização aplicadas ao projeto de sistemas térmicos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"FSC7152":{"codigo":"FSC7152","nome":"Computação Quântica I","ementa":"Álgebra linear com a notação de Dirac. Postulados da Mecânica Quântica. Conceitos básicos de computação clássica. Portas lógicas clássicas. Portas lógicas quânticas. Circuitos quânticos. Protocolos e algoritmos quânticos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"MTM3121 ou MTM3112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5413":{"codigo":"INE5413","nome":"Grafos","ementa":"Grafos e grafos orientados. Representação de problemas com grafos. Caminhos, ciclos e caminho de custo mínimo. Conexidade e alcançabilidade. Árvores e árvore de custo mínimo. Coloração e planaridade de grafos. Grafos hamiltonianos e eulerianos. Fluxo máximo em redes. Estabilidade e emparelhamento em grafos. Problemas de cobertura e de travessia. Representações computacionais e complexidade de algoritmos em grafos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5423":{"codigo":"INE5423","nome":"Banco de Dados I","ementa":"Banco de Dados (BD). Sistema de Gerência de BD: funcionalidades, módulos principais, categorias de usuários, dicionário de dados. Modelo relacional: conceitos, restrições de integridade, álgebra relacional, cálculo relacional. Linguagens SQL: DDL, DML, restrições de integridade, visões, autorização de acesso. Modelagem de dados: etapas do projeto de um BD relacional, modelo Entidade-Relacionamento (ER), mapeamento ER-relacional. Teoria da Normalização: objetivo, dependências funcionais, formas normais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5613","prerequisito":"DAS5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5443":{"codigo":"INE5443","nome":"Reconhecimento de Padrões","ementa":"Considerações iniciais sobre padrões. Técnicas simbólicas. Técnicas sub simbólicas: redes neurais. Raciocínio baseado em caso - estendendo RP com um framework de inteligência artificial. Técnicas estatísticas. Geração de padrões: análise de sinais e imagens. Criação de aplicação de reconhecimento de padrões.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5448":{"codigo":"INE5448","nome":"Tópicos Especiais em Aplicações Tecnológicas I","ementa":"Ementa livre para assuntos relevantes na área de Aplicações Tecnológicas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5455":{"codigo":"INE5455","nome":"Testes de Software","ementa":"Conceitos Básicos. Níveis de Testes. Tipos de Testes. Técnicas de Testes. Planejamento e Execução de Testes de Software. Desenvolvimento Orientado a Testes. Automação de Testes. Ferramentas de Testes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5600":{"codigo":"INE5600","nome":"Bancos de Dados III","ementa":"Aplicações não-convencionais.  Novos desafios de gerenciamento de dados. Bancos de dados pós-relacionais: categorias, conceitos, modelos de dados, manipulação de dados, modelagem","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5616":{"codigo":"INE5616","nome":"Bancos de Dados II","ementa":"Etapas do processamento de uma consulta; otimização algébrica de consultas; plano de execução de consultas; fundamentos de transações: definição e propriedades; recuperação de transações na ocorrência de falhas; controle de concorrência de transações; fundamentos de bancos de dados distribuídos: arquiteturas, projeto, processamento de consultas e gerência de transações; tópicos especiais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"INE5432","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5633":{"codigo":"INE5633","nome":"Sistemas Inteligentes","ementa":"Histórico e conceitos preliminares. Problemas e espaços de problemas. Métodos de solução de problemas. Representação do conhecimento. Sistemas especialistas. Ferramentas de Inteligência Artificial. Aquisição do conhecimento. Linguagem natural. Jogos. Lógica da Inteligência Artificial. Uso de Lógicas em Sistemas Especialistas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5643":{"codigo":"INE5643","nome":"Data Warehouse","ementa":"Conceitos básicos. Os Ecossistemas de Informação. O Ciclo de Vida do DW: Planejamento e Administração, Levantameto de Requisitos, Modelagem Dimensional, Projeto Físico, o Back-Room e o Froon-Room, Metadados, Arquiteturas, Implementação, Segurança e Internet. Implantação, Suporte e Treinamento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5644":{"codigo":"INE5644","nome":"Data Mining","ementa":"Considerações iniciais da área e aplicações. Processos de descoberta do conhecimento (KDD) em base de dados. Análise exploratória de dados. Tipos de variáveis, Técnicas de Data Mining para classificação, estimação, predição, análise de agrupamentos, análise de associação: redes neurais, árvores de decisão, regras de decisão, análise discriminante, regressão linear, regressão logística, análise de cluster, análise de componentes principais. Uso de softwares de data mining. Exercícios. Data Mining de caso.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5649":{"codigo":"INE5649","nome":"Técnicas Estatísticas de Predição","ementa":"Estudo de correlações. Análise de regressão linear simples: modelo, inferências, análise de resíduos e transformações. Análise de regressão linear múltipla. Modelo com variáveis independentes categóricas. Séries temporais: componentes da série e técnicas previsão. Utilização de planilha eletrônica e\/ou pacote computacional de estatística.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"INE5681":{"codigo":"INE5681","nome":"Modelagem e Automação de Processos de Negócios","ementa":"Gestão de negócios pela visão de processos de negócio. Modelagem da arquitetura e de regras de negócio. Ciclo da gestão de processos de negócio. Notações e métodos para modelagem de processos. Tópicos avançados em modelagem de processos, incluindo introdução à automação e indicadores de processos e aos sistemas para gestão de processos, e integração com requisitos de sistema e desenvolvimento de software.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"DAS5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"ANT7003":{"codigo":"ANT7003","nome":"Relações Inter-étnicas","ementa":"Grupos  étnicos.  Processos  sócio-culturais  de  construção  de  identidade étnicas. Particularidades históricas e processos de diferenciação. Etnicidades e questões raciais, acomodações e conflitos. Sociedades pluriétnicas, cultura e política.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGR5037":{"codigo":"EGR5037","nome":"História e Evolução do Design","ementa":"Introdução ao Design. Aspectos históricos e origens do Design Design e vanguardas artísticas. As influências dos designers de diferentes países. O design moderno e contemporâneo.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LSB7904","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"}}}}}