{"codigo":606,"nome":"ENGENHARIA NAVAL [Campus Joinville]","sigla_centro":"CTJ","sigla_departamento":"EMB","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"20122":20122,"20161":20161,"20251":20251},"situacao":0,"situacao_descricao":"regular","num_vagas_total":250,"num_vagas_primeiro_semestre":50,"num_vagas_segundo_semestre":0,"presencial":true,"curriculos":{"20122":{"id":"510","codigo":20122,"codigo_curso":606,"carga_horaria_ufsc":4320,"carga_horaria_mec":3600,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao curriculo 20122","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5003":{"codigo":"EMB5003","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos, elementos básicos de construção reta, plano e ponto. Construção de objetos envolvendo intersecção, secção, planificação e modelagem. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5035","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5004":{"codigo":"EMB5004","nome":"Introdução a Engenharia","ementa":"Contextualização à vida acadêmica (a universidade, o curso de engenharia da mobilidade, o currículo, serviços de apoio, laboratórios). Contextualização à vida profissional. Funções do engenheiro no contexto tecnológico e social. O mercado de trabalho na engenharia. Métodos científicos na resolução de problemas de engenharia. Introdução à atividade profissional do engenheiro: especificação, projeto, implementação, construção de protótipos e testes para problemas, dispositivos e situações da engenharia da mobilidade. Gestão da inovação e da tecnologia. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. Tutoria na disciplina consciente. A responsabilidade dos estudantes na disciplina consciente. Responsabilidade social. Diferenças vs desigualdades. A igualdade étnico racial na engenharia.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5038 e EMB5731","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3111","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5006":{"codigo":"EMB5006","nome":"Química Tecnológica","ementa":"Estrutura Atômica. Ligações Químicas. Mol. Estequiometria. Combustão e Combustíveis. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Corrosão metálica: Oxidação-redução. Equação de Nernst. Mecanismos de corrosão. Meios corrosivos. Métodos de controle e monitoramento da corrosão. Polímeros: Estrutura química de polímeros. Cristalinidade. Propriedades químicas. Propriedades mecânicas. Principais polímeros de uso geral. Tratamento de águas. Tratamento de efluentes industriais. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EQA5116","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5028":{"codigo":"EMB5028","nome":"Comunicação e Expressão","ementa":"Comunicação e linguagem: diversos tipos de linguagem verbal e não verbal. Aspectos fundamentais para a construção de textos. Estrutura e produção de textos com base em parâmetros da linguagem técnico-científica: resumo, resenha, relatório, artigo. O texto acadêmico e as normas da ABNT. Metodologia científica. Formas de comunicação oral: características. Técnicas de apresentação em público.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5037","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5002":{"codigo":"EMB5002","nome":"Fisica - Introdução à Mecânica","ementa":"Unidades de medida e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação da quantidade de movimento.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5034 ou FSC5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM5245","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5010":{"codigo":"EMB5010","nome":"Estatística e Probabilidade","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"EGR5214","prerequisito":"EMB5003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5013":{"codigo":"EMB5013","nome":"Introdução à Programação de Computadores","ementa":"Componentes básicos de um computador. Sistemas de numeração. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos), tipos de dados, estruturas de seleção e repetição, fluxo de execução (modularização), estruturas de dados homogêneas (vetores e matrizes), manipulação de arquivos. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5600 ou INE5201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5008","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5032":{"codigo":"EMB5032","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EMB5020","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5009":{"codigo":"EMB5009","nome":"Termodinâmica","ementa":"Introdução e conceitos básicos. Trabalho e calor. Propriedades de substâncias puras. Primeira lei da termodinâmica. Primeira lei da termodinâmica aplicada a volumes de controle. Segunda lei da termodinâmica. Entropia e a segunda lei da termodinâmica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5002 ou EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5011":{"codigo":"EMB5011","nome":"Estática","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Cálculo de centróides de áreas e de volumes de figuras simples e compostas. Análise de forças distribuídas como cargas concentradas. Cálculo de momento de inércia de superfície para áreas simples e compostas. Cálculo de momento de inércia de massa para sólidos simples e compostos. Análise de Treliças, Estruturas e Máquinas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5002 e EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5013","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5006","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5008","prerequisito":"EMB5007 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5033":{"codigo":"EMB5033","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características de sistemas de medição; Calibração; Estimativa de incerteza de medição; Especificação geométrica; Medição de comprimento, ângulo, forma e rugosidade.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"EMB5018","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5007 e EMB5016 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5015":{"codigo":"EMB5015","nome":"Dinâmica","ementa":"Estudo da cinemática das partículas e do corpo rígido. Cinemática do \tponto material, Dinâmica do  ponto   material. Trabalho, Energia e Momento linear. Cinemática dos corpos rígidos.  Dinâmica dos corpos rígidos. Energia, Impulso linear e Impulso angular para corpos rígidos.  Vibrações forçadas sem amortecimento. Vibrações forçadas com amortecimento.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5041","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5017":{"codigo":"EMB5017","nome":"Mecânica dos Fluidos","ementa":"Conceitos fundamentais. Estática dos fluidos. Formulação integral e diferencial das leis de conservação. Escoamento invíscido incompressível. Análise dimensional e semelhança. Escoamento interno viscoso incompressível: escoamento laminar completamente desenvolvido e escoamento em tubos e dutos. Escoamento externo viscoso incompressível: teoria da camada limite e forças de arrasto e sustentação sobre corpos imersos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5009 e EMB5030","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5011 e EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5027":{"codigo":"EMB5027","nome":"Metodologia de Projeto de Produto","ementa":"Introdução: A visão do projeto e do produto no contexto histórico, ambiental, e de custo. Importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos. Projeto preliminar: modelagem, análise e simulação de soluções de projeto; projeto detalhado. Construção e teste de protótipos. Aplicações: produtos em engenharia veicular; transporte, infraestrutura, sistemas embarcados em nível de software e hardware. Noções de Engenharia de Sistemas.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5042","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5031":{"codigo":"EMB5031","nome":"Eletromagnetismo","ementa":"Lei de Coulomb. O Campo Elétrico e Potencial Eletrostático. Capacitância e Capacitores. Corrente Elétrica. Campo Magnético. A Lei de Ampere. A Lei da Indução. Circuitos. As Equações de Maxwell.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5043","prerequisito":"EMB5030","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5102":{"codigo":"EMB5102","nome":"Processo de Fabricação","ementa":"Classificação e descrição sumária dos diversos processos de fabricação. Fundamento dos processos de fundição contínua e em moldes: principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamento dos processos de conformação de materiais metálicos (laminação, forjamento, trefilação, extrusão e estampagem): principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamentos de metalurgia do pó: sinterização. Fundamentos dos processos de usinagem: torneamento, furação, fresamento, retificação, eletroerosão. Principais parâmetros dos processos de usinagem. Ferramentas de corte: materiais, revestimentos e geometrias, desgaste. Qualidade de superfícies após processo específico de fabricação, erros dimensionais. Máquinas e equipamentos. Introdução ao Comando Numérico Computadorizado (CNC). Introdução a programação e simulação da usinagem CNC e integração entre sistemas CAD\\CAM\\CNC.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5202","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5103":{"codigo":"EMB5103","nome":"Transmissão de Calor I","ementa":"Mecanismos básicos de transmissão de calor. Princípios básicos da condução de calor. Condução unidimensional em regime permanente. Condução bidimensional em regime permanente. Condução em regime transiente. Métodos numéricos aplicados. Princípios básicos da radiação térmica. Radiação entre superfícies. Introdução à convecção.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5014 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5104":{"codigo":"EMB5104","nome":"Mecânica dos Sólidos II","ementa":"Cisalhamento em Vigas Longas \u0096 tensões de cisalhamento em vigas; cisalhamento em estruturas compostas. Cargas Combinadas - Campos de tensão em cascas cilíndricas e esféricas delgadas. Vasos de Pressão. Transformação de Tensão \u0096 Estado Plano de Tensão, Tensões Principais, Círculo de Mohr. Deflexão Transversal em Vigas \u0096 Linha Elástica, Equações de Equilíbrio, Vigas estaticamente indeterminadas. Flambagem de Colunas \u0096 Carga Crítica; Flambagem elástica e inelástica de vigas. Critérios de Falhas Estáticas para Materiais Dúcteis \u0096 Teoria da Tensão Cisalhante Máxima; Teoria da Energia de Distorção, Tensão Equivalente de von Mises, Fator de segurança. Critério de Falha Estática para Materiais Frágeis \u0096 Teoria da Tensão Normal Máxima. Métodos de Energia.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5138","prerequisito":"EMB5021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5105":{"codigo":"EMB5105","nome":"Mecanismos","ementa":"Conceitos e notações aplicadas a mecanismos. Estudo de tipos de mecanismos. Conceitos elementares de síntese dimensional de mecanismos articulados. Análise cinemática de cames planos e engrenagens de dentes retos e helicoidais.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5108":{"codigo":"EMB5108","nome":"Circuitos Elétricos","ementa":"Conceitos básicos e leis fundamentais. Circuitos de corrente contínua. Circuitos de corrente alternada. Análise de potência em circuitos de corrente alternada. Circuitos trifásicos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5025","prerequisito":"EMB5031","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5733":{"codigo":"EMB5733","nome":"Arquitetura Naval I","ementa":"Tipos de embarcações e sistemas oceânicos, funções, características principais, formas de propulsão, descrição da estrutura, materiais utilizados na construção. Sociedades Classificadoras, regulamentações e normas técnicas. Geometria do casco, dimensões principais, coeficientes de forma, plano de linhas, desenho do casco. Deslocamento, peso leve, deadweight e arqueação. Introdução á visão sistêmica e a metodologia clássica de projeto naval. Modelos computacionais, curvas e superfícies paramétricas, variação geométrica. Modelagem computacional do casco e convés utilizando ferramentas CAD.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5702","prerequisito":"EMB5003","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5109":{"codigo":"EMB5109","nome":"Gestão Industrial","ementa":"A empresa como sistema, Evolução do pensamento administrativo, Planejamento Estratégico, Gestão de recursos materiais e humanos. Planejamento e Controle da Produção, Empreendedorismo. Noções de Economia.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5110":{"codigo":"EMB5110","nome":"Elementos de Máquinas","ementa":"Estudo de uniões por parafusos. Molas helicoidais. Eixos e árvores. Ligações entre cubo e eixo. Mancais de rolamento e escorregamento. Engrenagens cilíndricas. Redutores. Acoplamentos. Freios e embreagens.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5335","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5115":{"codigo":"EMB5115","nome":"Vibrações","ementa":"Introdução aos problemas de vibração em engenharia. Terminologia. Princípios Básicos. Sistemas com um grau de liberdade: vibração livre, métodos de energia, amortecimento e vibração forçada. Sistemas com dois graus de liberdade: vibração livre e forçada. Sistemas com múltiplos graus de liberdade. Introdução aos sistemas contínuos. Introdução aos sistemas de medição de vibrações.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5140","prerequisito":"EMB5014 e EMB5015","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5701":{"codigo":"EMB5701","nome":"Transporte Marítimo","ementa":"Conceitos básicos de transporte aquaviários. Caracterização de uma embarcação de carga. Organização do transporte marítimo internacional. Contratação de navios para transporte marítimo. Sistema de transporte aquaviário: transporte de carga geral solta, refrigerada, neogranéis, contêineres, granéis sólidos, granéis líquidos e cruzeiros marítimos). Transporte aquaviário no Brasil: hidrovias, rotas marítimas.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5771","prerequisito":"EMB5010 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5710":{"codigo":"EMB5710","nome":"Hidrodinâmica Aplicada I","ementa":"Resistência ao avanço: natureza de resistência e determinação da resistência. Métodos teóricos, experimentais e estatísticos. Propulsores: tipos de propulsores, propulsor tipo hélice, geometria do hélice, análise de propulsores, diagramas Kt, Kq, J, séries sistemáticas, interação casco\u0096propulsor, cavitação e seleção de propulsores. Prova de mar. Ensaio de autopropulsão.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5017 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5734":{"codigo":"EMB5734","nome":"Arquitetura Naval II","ementa":"Conceitos básicos: centro de gravidade; momentos de inércia; pressão hidrostática; empuxo; deslocamento; equilíbrio hidrostático e condições de equilíbrio. Curvas hidrostáticas. Estabilidade intacta e avariada. Comprimento alagável e compartimentagem. Conceitos de estabilidade dinâmica. Normas, regulamentos e critérios de estabilidade","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5702","prerequisito":"EMB5011 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5703":{"codigo":"EMB5703","nome":"Projeto Estrutural de Sistemas Navais I","ementa":"1. Conceito de estruturas primária, secundária e terciária. 2. Estrutura primária. 3. Colocação do navio na onda.  4. Forças agindo sobre o navio. 5. Campos de Tensão Primária 6. Composição das Tensões Primárias. 7. Critérios de projeto. Carregamento, modelo de cálculo e tensões admissíveis. 8. Nomenclatura dos elementos estruturais. 9. Princípios de projeto e análise de estruturas navais e oceânicas, incluindo utilização de regras de Sociedade Classificadoras.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5765","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5705":{"codigo":"EMB5705","nome":"Materiais e Processos de Construção Naval I","ementa":"Características dos materiais empregados na construção naval. Materiais metálicos: \nCaracterísticas e propriedades físicas. Tratamento térmico dos materiais metálicos. Materiais não ferrosos. Principais materiais metálicos empregados no setor naval. Corrosão. Conceitos gerais. Aspectos físicos e químicos dos diversos tipos de corrosão. Formas de proteção contra corrosão. Revestimentos metálicos e não metálicos. Processos de proteção catódica e anódica dos materiais metálicos.","carga_horaria":54,"fase_sugestao":7,"equivalencia":"EMB5742 e EMB5772","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5706":{"codigo":"EMB5706","nome":"Ligações Permanentes","ementa":"Classificação dos processos de união. União por conformação: Tipos de dobras, técnicas operacionais e aplicações. União por processo de rebitagem: Tipos de rebites e aplicações. Processos de soldagem a arco: Técnicas operacionais, terminologia, tipos de juntas, física do arco voltaico e fontes de energia. Fundamentos de metalurgia da soldagem. Processo oxi-acetilênico. Brasagem. Soldagem por resistência. Modernos processos de união: Laser, feixe de elétrons e soldagem por atrito. Processos híbridos e derivativos: Plasma-MIG, TIG com múltiplos catodos, curto-circuito controlado, Laser-MIG e Laser-TIG. Aplicações das técnicas de união no âmbito da engenharia da mobilidade.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5307 ou EMB5502 ou EMB5724","prerequisito":"EMB5022 e EMB5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5707":{"codigo":"EMB5707","nome":"Máquinas Marítimas","ementa":"Introdução às instalações de máquinas. Descrição geral das instalações de máquinas, incluindo os principais sistemas de praça de máquinas de navios, embarcações, e plantas de utilidades de unidades de produção offshore. Sistemas térmicos de navios embarcações e planta de utilidades. Ciclos básicos de operação de máquinas térmicas. Ciclo Otto, Diesel, Rankine, Brayton. Ciclos combinados de co-geração. Ciclos reais. Combustíveis. Motores de combustão interna, e Turbinas a GAS. Princípios de funcionamento. Tipos e aplicações. Trocadores de calor. Turbinas a vapor. Princípios do balanço térmico em navios e plataformas. Caldeiras e aquecedores de fluido térmico.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5708":{"codigo":"EMB5708","nome":"Projetos de Navio I","ementa":"Por meio da elaboração de um projeto, os alunos exercitam de maneira interdisciplinar a integração dos seguintes conceitos: Filosofia e metodologia de projeto. Elaboração da espiral e planejamento de projeto; Análise técnica-econômica, requisitos e condições de projeto, Sociedades Classificadoras, figuras de mérito e critérios de projeto; Definição da forma e dimensões principais; Modelagem das principais funcionalidades do navio como resistência ao avanço, pesos e centros, estabilidade, estruturas, capacidade de carga, etc. de acordo com a precisão necessária nos diferentes ciclos da espiral; Formulações, modelos matemáticos e utilização de aplicativos disponíveis; Análise paramétrica e tomada de decisão; Desenho do casco e arranjo interno. Exercitam-se ainda o trabalho em grupo, planejamento, ética e conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"EMB5735","prerequisito":"EMB5027 e EMB5734","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5716":{"codigo":"EMB5716","nome":"Hidrodinâmica Aplicada II","ementa":"Estudar o comportamento no mar de sistemas navais e oceânicos e introduzir noções de manobra de embarcações de superfície. Capacitar o aluno a analisar problemas desta natureza através de técnicas analíticas, numéricas e\/ou experimentais apropriadas. Teoria de ondas. Ondas do mar. Excitação aleatória. Espectro de mar. Momentos espectrais e parâmetros característicos do mar. Massa adicional. Resposta de sistemas em excitação aleatória. Critérios para comportamento em ondas. Introdução ao princípio de manobra de navios de superfície. Equações de movimento de navios durante a manobra. Manobras padrões avaliadas em prova de mar.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5734","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5709":{"codigo":"EMB5709","nome":"Projeto  Estrutural de Sistemas Navais II","ementa":"1. Estrutura secundária. Longitudinais leves e pesados. 2.  Estrutura terciária. 3. Anéis e cavernas  transversais. 4. Composição de tensões locais e globais. 5. Análise computacional de estruturas navais 6. Vibração da viga navio. 7. Vibração de estruturas locais. 8. Análise computacional de vibração de embarcações. 9. Flambagem de estruturas navais: modo global. 10. Instabilidade de painéis (chapeamento) reforçados. 11. Fundamentos sobre a fadiga de estruturas oceânicas.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5764","prerequisito":"EMB5115 e EMB5703","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5711":{"codigo":"EMB5711","nome":"Materiais e Processos de Construção Naval II","ementa":"Introdução aos materiais compósitos. Vantagens em relação aos materiais tradicionais. Introdução aos materiais compósitos. Vantagens em relação aos materiais tradicionais. Tipos de matriz\/reforço e suas propriedades. Estruturas sanduíche; tipos de núcleos e suas propriedades. Processos de construção naval utilizando materiais compósitos.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5744 e EMB5772","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5713":{"codigo":"EMB5713","nome":"Métodos Computacionais para Engenharia","ementa":"Introdução aos métodos de diferenças finitas e elementos finitos. Aspectos matemáticos das equações governantes. Método das diferenças finitas. Método dos elementos finitos. Método dos resíduos ponderados. Problemas unidimensionais. Problemas bidimensionais. Principais tipos de elementos utilizados em análise estrutural e suas aplicações.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5117 ou EMB5302 ou EMB5411 ou EMB5515","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5714":{"codigo":"EMB5714","nome":"Projetos de Navio II","ementa":"Por meio da continuação do projeto desenvolvido na disciplina Projeto de Navio I, os alunos exercitam de maneira interdisciplinar a integração dos seguintes conceitos: Análise de estabilidade para grandes ângulos. Estabilidade avariada e compartimentagem. Desenho do casco usando técnicas computacionais. Arranjo tridimensional do navio. Projeto da instalação propulsora. Estimativas preliminares de comportamento no mar e manobra. Construção. Exercitam-se ainda o trabalho em grupo, planejamento, ética e conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5703 e EMB5708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5720":{"codigo":"EMB5720","nome":"Planejamento do Trabalho de Conclusão de Curso","ementa":"A pesquisa e o método científico. Formulação do problema de pesquisa. Construção de hipóteses. Tipos e características da pesquisa. Elaboração de projetos de pesquisa. Elaboração de relatórios. Nesta etapa será proposto o projeto para o trabalho de conclusão do curso, tendo o seguinte conteúdo: título, tema, problematização, hipóteses, objetivos, justificativa, metodologia, resultados esperados, cronograma, relação das principais referência bibliográficas, aprovação do professor orientador.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5044 ou EMB5420 ou EMB5521 ou EMB5618 ou EMB5821 ou EMB5919","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2952,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5717":{"codigo":"EMB5717","nome":"Processo de Construção Naval","ementa":"A indústria de construção naval. Características do Produto. Os estaleiros. Processo de Projeto usando sistemas CAE\/CAD\/CAM. Modelagem Geométrica Tridimensional. Desenhos para a Linha de Produção. Troca e Comunicação de Dados. Seleção e Gerenciamento de Sistema CAE\/CAD\/CAM. A sequência típica de fabricação. O estoque de chapas e perfis. Pré-tratamento. Marcação, corte e conformação. Sistemas de prevenção e combate a incêncio. Vias de escape. Transporte de cargas perigosas. Controle de qualidade. Planejamento e programação da produção. O planejamento geral do estaleiro. O plano mestre de construção do navio. A sequência de fabricação e montagem. Principais eventos. Plano de suprimentos. Planejamento do trabalho. Sistemas de informação e controle.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5109 e EMB5705 e EMB5706","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5718":{"codigo":"EMB5718","nome":"Gestão  Portuária","ementa":"Matemática financeira. Engenharia Econômica. Custos. História dos portos no Brasil. Legislação brasileira pertinente aos portos. Arranjo geral portuário. Dimensões de canais e bacias portuárias. Tipos de estruturas acostáveis. Instalações de movimentação e armazenamento de carga. Caracterização de um porto. Organização,  \ngerenciamento e operação portuária.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5961 ou EPS7019","prerequisito":"EMB5010 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5719":{"codigo":"EMB5719","nome":"Sistemas Embarcados para Navios","ementa":"Propulsão elétrica para embarcações. Geração, distribuição e proteção de energia elétrica. Instrumentação. Sistemas de comunicação.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5763","prerequisito":"EMB5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5721":{"codigo":"EMB5721","nome":"Trabalho de Conclusão de Curso (TCC)","ementa":"Consolidação dos conhecimentos obtidos no Curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações da área da mobilidade.","carga_horaria":72,"fase_sugestao":9,"equivalencia":"EMB5791","prerequisito":"EMB5720","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5722":{"codigo":"EMB5722","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":396,"fase_sugestao":10,"equivalencia":"EMB5046","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3420,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5098","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5097","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EMB5739":{"codigo":"EMB5739","nome":"Tópicos Especiais em Construção Naval III","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5745":{"codigo":"EMB5745","nome":"Tópicos Especiais em Construção Naval IV","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5746":{"codigo":"EMB5746","nome":"Tópicos Especiais em Construção Naval v","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5754":{"codigo":"EMB5754","nome":"Tópicos Especiais em Projetos Navais I","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5755":{"codigo":"EMB5755","nome":"Tópicos Especiais em Projetos Navais II","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5756":{"codigo":"EMB5756","nome":"Tópicos Especiais em Projetos Navais III","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5782":{"codigo":"EMB5782","nome":"Tópicos Especiais em Transporte Marítimo II","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5783":{"codigo":"EMB5783","nome":"Tópicos Especiais em Transporte Marítimo III","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5095":{"codigo":"EMB5095","nome":"Intercâmbio IV","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5096","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5019":{"codigo":"EMB5019","nome":"Ética e Disciplina Consciente","ementa":"Ética, Moral, Valores, e Ética Profissional. O Código de Ética como ferramenta para o fortalecimento da Cultura Organizacional. Disciplina Consciente. Tutoria na Disciplina Consciente. A Responsabilidade dos Alunos na Disciplina Consciente. Responsabilidade Social.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5023":{"codigo":"EMB5023","nome":"Fundamentos em Engenharia da Mobilidade","ementa":"Conceito de engenharia da mobilidade: veicular e de transporte. Processo global da engenharia de transportes e de infraestrutura. O planejamento, projeto e operação de transportes. Caracterização dos sistemas veiculares: Sistemas motrizes; estruturas; sistemas de navegação; embarcados; acessórios; e de comunicação. Caracterização dos sistemas de transporte: armazenar, transportar, distribuir, operar, manter e gerenciar.  Fatores de integração dos modais de transporte: portos, aeroportos, ferrovias, hidrovias e vias terrestres, sistemas de controle, comunicação, e integração de pessoas e de cargas. Fatores ambientais: riscos e impactos decorrentes da presença do mobiliário na operação sistemas, para o meio ambiente e para as populações","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5038":{"codigo":"EMB5038","nome":"Ciência, Tecnologia e Sociedade","ementa":"Definições de ciência, tecnologia e técnica. Desenvolvimento tecnológico e social. Relações entre ciência, tecnologia e sociedade. Desafios para o perfil do engenheiro contemporâneo. Funções do engenheiro no contexto tecnológico e social. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. A igualdade étnico racial na engenharia. Direitos humanos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5053":{"codigo":"EMB5053","nome":"Aprimoramento da Escrita Acadêmica","ementa":"Norma culta e escrita acadêmica. Sintaxe e Gramática aplicadas à redação acadêmica. Análise de textos acadêmicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5054":{"codigo":"EMB5054","nome":"Relações Interpessoais nas Organizações","ementa":"Formação da personalidade e dos papéis organizacionais. A importância do autoconhecimento na \ndinâmica cognitiva e emocional das relações interpessoais. Inteligência emocional. Historicidade, \ncontemporaneidade e características sociais na construção do eu. As atividades laborais e os papéis \nsociais. A importância da comunicação na constituição dos indivíduos e dentro das organizações. \nRelações interpessoais e dinâmica organizacional. Ética e Moralidade. Líderes e Liderança.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5113":{"codigo":"EMB5113","nome":"Modelagem de Sistemas","ementa":"Introdução à engenharia de sistemas. Formalismos de modelagem de sistemas discretos. Formalismos de modelagem de software (UML).","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5208":{"codigo":"EMB5208","nome":"Legislação de Concessões e Contratos","ementa":"Aspectos da concessão de serviço público. Os poderes do poder concedente. Espécies de contratos administrativos. Legislação das licitações e das concessões. Espécies de concessões. Responsabilidades do poder concedente e do concessionário. As concessões no sistema de transportes. Equilíbrio econômico financeiro dos contratos de concessão. A intervenção judicial. Controles administrativos. Controles de qualidade do serviço.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5214":{"codigo":"EMB5214","nome":"Custos e Orçamentação","ementa":"Fundamentos de contabilidade. Principais demonstrações. Princípios e métodos de custos. Análise de custo-volume-lucro. Custo padrão. Custeio baseado em atividades. Método das unidades de esforço de produção. Gestão por atividades. Custos unitários de serviços de infraestrutura: terraplenagem, pavimentação, conservação e restauração. Custos de Operação de veículos. Orçamentos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5308":{"codigo":"EMB5308","nome":"Materiais Avançados","ementa":"Processos de obtenção de pós. Caracterização e propriedades dos pós. Métodos de compactação e moldagem. Processos de sinterização e homogeneização. Principais ensaios em materiais  sinterizados. Peças estruturais - Produção em grandes séries Materiais porosos. Materiais de alto ponto de fusão. Materiais conjugados. Materiais sinterizados magnéticos Produção e propriedades de materiais cerâmicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5310":{"codigo":"EMB5310","nome":"Processos Especiais de Fabricação","ementa":"Processamento de polímeros. Moldagem por extrusão, moldagem por sopro, moldagem por injeção, termoformagem. Confecção de moldes e matrizes empregando sistemas computacionais CAD\\CAM\\CNC\\CAI. Fundamentos de mecânica e metalurgia da conformação plástica. Tecnologia dos processos de laminação, forjamento, trefilação e extrusão para fins automotivos. Tecnologia dos processos de conformação de chapas para fins automotivos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5314":{"codigo":"EMB5314","nome":"Sistemas Embarcados","ementa":"Sistemas baseados em microprocessadores. Dispositivos lógico programáveis. Sensores e Transdutores. Conversores A\/D e D\/A. Arquitetura automotiva. Noções de sistemas de tempo real.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5318":{"codigo":"EMB5318","nome":"Ferramentas e Dispositivos para a Indústria Automotiva","ementa":"Principais tipos, componentes e classificação de moldes, matrizes e dispositivos para a indústria automotiva; Princípios básicos de projeto de moldes, matrizes e dispositivos, visando a melhoria dos componentes veiculares; Manutenção, materiais,  tratamentos térmicos e de superfície utilizados nos ferramentais e  dispositivos. Moldes protótipos e híbridos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5320":{"codigo":"EMB5320","nome":"Empreendedorismo e Inovação","ementa":"Conceito de inovação. Tipos de inovação. Estratégias de Inovação. A inovação como um processo organizacional. Mecanismos de fomento e cooperação em pesquisa e desenvolvimento. Empreendedorismo. Características, tipos e habilidades do empreendedor. Plano de Negócios: etapas, processos e elaboração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5353":{"codigo":"EMB5353","nome":"Manufatura Auxiliada por Computador","ementa":"Manufatura Integrada por Computador CIM-Computer Aided Manufacturing Aplicação de sistemas CAD\\CAM para a geração de programas CNC e simulação do processo de usinagem. Operações de usinagem e estratégias de corte. Métodos para cálculo de trajetórias de ferramenta em sistemas CAM. Pós-processamento de programas CNC. Processos de usinagem de formas geométricas complexas nas indústrias veiculares. Transferência e execução do programa CNC em máquinas CNC. Utilização de máquinas CNC e geração de programas CNC manual e via sistemas CAD\/CAM. Desvios geométricos e qualidade de superfícies usinadas em máquinas CNC.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5355":{"codigo":"EMB5355","nome":"Materiais e Processos de Construção Veicular I","ementa":"Classificação dos materiais metálicos utilizados na fabricação de componentes veiculares. Os aços AHSS \u0096 Advanced High Strength Steel na construção automotivos. Mecanismos de endurecimento em aços para fins veiculares. O processamento termomecânico e sua influência no controle da microestrutura e das propriedades destes materiais. Fundamentos dos processos de laminação a frio, recozimento, resfriamento controlado e tratamentos superficiais. Fundamentos da teoria e tecnologia dos processos de conformação de chapas e de tubos para fins veiculares: estampagem a frio e a quente. Fundamentos do processo de Tailored Blank de chapas e tubos. Fundamentos do processo de hidroconformação de chapas e tubos. Forjamento de elementos de máquinas em aços especiais. Critério para a seleção dos processos de fabricação de componentes veiculares. Procedimentos para a manufatura de componentes veiculares: folhas de processo e folhas de operação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5402":{"codigo":"EMB5402","nome":"Escoamentos Compressíveis e Teoria da Camada Limite","ementa":"Introdução e classificação; escoamento unidimensional; choque oblíquo e ondas de expansão; escoamento quasi-unidimensional; ondas em regime transiente; equação potencial compressível e equações linearizadas; escoamento cônico; métodos numéricos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5404":{"codigo":"EMB5404","nome":"Transmissão de Calor II","ementa":"Introdução  à  convecção,  equações  de  conservação;  a  convecção  forçada  em  escoamentos  externos,  conceitos  e  soluções  para  a  camada  limite térmica e hidrodinâmica  sobre  superfícies  planas;  correlações  para  escoamentos  externos;  convecção  forçada  em  escoamentos  internos,  fluidodinâmica  do  escoamento  interno;  transferência  de  calor  em  escoamento  interno,  correlações  para  o  escoamento  interno;  convecção  natural;  correlações  para  convecção  natural;  convecção  com  mudança  de  fase,  princípios  de  ebulição  e  condensação;  correlações  para  ebulição  e  condensação,  introdução  aos  trocadores  de  calor; métodos LMTD (média logarítmica das diferenças de temperatura) e NTU (ou da efetividade); tipos de trocadores de calor. Transferência de massa por difusão.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5405":{"codigo":"EMB5405","nome":"Mecânica do Vôo","ementa":"Atmosfera\t padrão,\t sistemas\t de referência,  performance de  aeronaves, equações de movimento, equações\tlinearizadas, Movimento Longitudinal desacoplado, Movimento Latero-Direcional\tdesacoplado, Simulação\tNumérica\tde Vôo, controle de\taeronaves.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5407":{"codigo":"EMB5407","nome":"Ambiente Espacial","ementa":"Contrastes entre o ambiente terrestre e o ambiente espacial. O campo magnético solar. Vento solar. Atividade Solar: emissões de prótons, elétrons, raios-X e íons. Sazonalidade da atividade solar. Tempestades solares. O campo magnético terrestre (Geomagnetismo). A atmosfera terrestre. Interação entre o campo magnético terrestre e o solar. Radiação eletromagnética e de partículas nas imediações da Terra. Albedo terrestre. Radiação de Prótons e elétrons. Cinturões de Radiação. Plasma ionosférico. Bolhas ionosféricas. Radiação cósmica. Tempestades Magnéticas (seus efeitos sobre satélites). Detritos espaciais e micro-meteoritos. Ambiente no espaço intra-galáctico (deep space). Ambiente em outros planetas: Mercúrio, Vênus e Marte. Efeitos da radiação sobre seres vivos. Efeitos da radiação sobre partes e materiais. A especificação de missões espaciais e o ambiente espacial. Segurança de plataformas orbitais, cargas úteis e astronautas. Descrição do ambiente espacial para missões LEO, GEO e DS (deep space).","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5507":{"codigo":"EMB5507","nome":"Veículos de Tração I","ementa":"Locomotiva a vapor e a diesel: princípios de funcionamento. Motor Diesel: características e componentes. Ciclos de Trabalho: Motor de Quatro Tempos, Motor de Dois Tempos, rendimento, potência, consumo de combustível, conjugado. Sistemas do Motor Diesel:. Injetores de combustível, características do Óleo Diesel, governador e Controle da Rotação e equipamentos de proteção do Motor Diesel. Sistema de Injeção Eletrônica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5627":{"codigo":"EMB5627","nome":"Sistemas Motrizes I","ementa":"Circuitos Magnéticos. Transformadores: tipos, ensaios, circuito equivalente, regulação e rendimento. Transformadores trifásicos. Autotransformadores. Introdução e princípios de máquinas elétricas.Fundamentos da conversão eletromecânica da energia. Campos Girantes. Máquina de corrente contínua. Máquina síncrona.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMB5112","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5704":{"codigo":"EMB5704","nome":"Hidrodinâmica","ementa":"Escoamento potencial e viscoso em torno de corpos submersos. Conceitos de camada limite. Equação de Navier-Stokes. Equação de Euler. Cálculo dos coeficientes de arrasto e de sustentação. Teoria de ondas progressivas; ondas harmônicas em águas rasas e profundas; Equação de Laplace; resistência de ondas; propagação da energia da onda.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5732":{"codigo":"EMB5732","nome":"Laboratório de Engenharia Naval","ementa":"Apresentar aos alunos os principais fenômenos associados a Engenharia Naval, por meio da realização de ensaios e experimentos. Experiências nas sub-áreas de Hidrostática, Hidrodinâmica, Estruturas, Propulsão e Manobra. Teoria da semelhança e modelagem; técnicas experimentais típicas em Engenharia Naval; noções sobre medição e instrumentação em Engenharia Naval. Atividades Laboratoriais.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5774":{"codigo":"EMB5774","nome":"Disciplinas de Pós Graduação 1A","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5775":{"codigo":"EMB5775","nome":"Disciplinas de Pós Graduação 1B","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5776":{"codigo":"EMB5776","nome":"Disciplinas de Pós Graduação 1C","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5801":{"codigo":"EMB5801","nome":"Mecânica dos Solos I","ementa":"Origem e formação dos solos. Índices físicos. Estrutura. Plasticidade e consistência. \nCompacidade. Classificação (TRB, MCT). Classificação dos solos tropicais e subtropicais. Uso da \npedologia na estimativa de comportamento geotécnico. Características e propriedades de \nengenharia de horizontes lateríticos e saprolíticos. Comportamento dos solos residuais das \nprincipais rochas brasileiras. Permeabilidade. Percolação. Pressões dos solos. Compressibilidade \ne adensamento dos solos. Exploração do subsolo. Ensaios de laboratório.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5803":{"codigo":"EMB5803","nome":"Estruturas de Concreto Armado I","ementa":"Concreto armado. Estado limite último. Dimensionamento de vigas à flexão simples e cisalhamento. Cálculo e distribuição de armaduras e detalhamento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5804":{"codigo":"EMB5804","nome":"Hidráulica Geral","ementa":"Conceito de hidrostática e hidrodinâmica. Escoamento em condutos forçado e condutos livres, Máquinas hidráulicas: bombas e turbinas. Orifícios, bocais, bueiros, tubos curtos e vertedores. Medição de vazão","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5815":{"codigo":"EMB5815","nome":"Obras Portuárias e Aeroviárias","ementa":"(Aeroportos) Noções Gerais da Aviação Civil. Características da aeronave relacionadas com o projeto do aeroporto. Controle de Tráfego Aéreo. Planejamento do Aeroporto. Projeto Geométrico da área de pouso. Planejamento da área terminal. Sinalização. Dimensionamento de pavimentos. Drenagem. Impactos no meio ambiente. (Portos) Morfologia Fluvial. Hidrometria e batimetria fluviais. Hidráulica de canais aplicada a projetos de navegação fluvial. Melhoramento dos cursos d'água naturais para navegação: obras de melhoramentos gerais ou de normalização, obras de regularização do leito, obras de canalização, obras de transposição de desníveis (eclusas e outras), canais artificiais. Proteção de margens de hidrovias. Embarcações e comboios para navegação fluvial. Projeto de hidrovias. Estruturas de atracação interiores e portos fluviais. Exploração e conservação das vias de navegação interior. Tráfego nos portos. Regime dos rios. Portos marítimos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5838":{"codigo":"EMB5838","nome":"Hidráulica Geral","ementa":"Conceito de hidrostática e hidrodinâmica. Escoamento em condutos forçado e condutos livres, Máquinas hidráulicas: bombas e turbinas. Orifícios, bocais, bueiros, tubos curtos e vertedores. Medição de vazão","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5840":{"codigo":"EMB5840","nome":"Custos e Orçamentação","ementa":"Metodologia de implementação de custos. Análise de preços. Custos diretos e indiretos. Elaboração e análise de custos unitários. Elaboração de orçamentos. Uso de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5843":{"codigo":"EMB5843","nome":"Hidrologia Aplicada","ementa":"Ciclo hidrológico e bacia hidrográfica. Noções de climatologia.  Precipitação. Intercepção, evaporação e evapotranspiração. Infiltração e Percolação. Águas subterrâneas. Escoamento superficial. Estimativa de vazões máximas e mínimas. Controle e previsão de enchentes Regularização de vazões. Desastres naturais ligados à hidrologia e climatologia (alagamentos, enxurradas, inundação, ciclones, furacões, tornados, tempestades e estiagem)","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5850":{"codigo":"EMB5850","nome":"Instalações Hidráulicas Prediais","ementa":"-Sistema Predial de Água Fria, Água Quente, de Proteção e Combate a Incêndio, Esgotamento Sanitário, Águas Pluviais, Gás Combustível (GLP e GN) e Condicionamento de Ar. Noções sobre construções bioclimáticas. Conservação e uso racional de água em edificações. Compatibilização entre projetos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5855":{"codigo":"EMB5855","nome":"Legislação Profissional e Fundamentos de Engenharia de Segurança","ementa":"Legislação Profissional: Fundamentação filosófica, social e política do trabalho. O Sistema profissional. Normas e legislação profissional. Remuneração profissional. Ética e disciplina profissional. Formas de exercício profissional. Campo de trabalho. Segurança do Trabalho: Conceituação de segurança na Engenharia. Controle do ambiente. Proteção coletiva e individual. Proteção contra incêndio. Riscos específicos nas várias habilitações da Engenharia. Controle de perdas e produtividade. Segurança no projeto. Análise e estatísticas de acidentes, seleção, treinamento, motivação do pessoal. Normalização e legislação específica. Organização da segurança do trabalho na empresa. Segurança em atividades extra empresa. Visitas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5862":{"codigo":"EMB5862","nome":"Estruturas Metálicas e de Madeira","ementa":"Características das estruturas de aço. Métodos de segurança e Método dos Estados Limites. Propriedades mecânicas do aço estrutural. Dimensionamento de elementos em aço. Peças tracionadas, comprimidas e fletidas. Ligações. Normas técnicas. Estruturas metálicas em situação de incêndio. A madeira como material estrutural; propriedades físicas e mecânicas; compressão simples; instabilidade de coluna; ligações tipo sambladura, por parafusos e por pregos; flexão normal simples e composta; coberturas convencionais e industriais; e projeto e execução de estruturas de madeira. Detalhes construtivos. Normas técnicas. Estruturas de madeira em situação de incêndio.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1080,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5024":{"codigo":"EMB5024","nome":"Sistemas Hidráulicos e Pneumáticos","ementa":"Definição de sistemas hidráulicos e pneumáticos. Campo de aplicação e características. SISTEMAS HIDRÁULICOS: Estrutura típica dos circuitos hidráulicos. Características construtivas e comportamentais dos principais componentes: bombas e atuadores lineares e rotativos, válvulas de controle direcional, de pressão e de vazão. Circuitos hidráulicos básicos. SISTEMAS PNEUMÁTICOS: Estrutura típica dos circuitos pneumáticos. Características construtivas e modelos comportamentais dos principais componentes: atuadores lineares e rotativos e ventosas, válvulas de controle direcional, de pressão e de vazão. Circuitos pneumáticos básicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5026":{"codigo":"EMB5026","nome":"Ergonomia e Segurança","ementa":"Conceitos básicos. Fisiologia do trabalho. Antropometria e Biomecânica. Variáveis ambientais: iluminação e cores, ruído, vibrações, temperatura. Introdução à análise ergonômica do trabalho. Cognição no trabalho. Ergonomia do produto. Segurança no trabalho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5047":{"codigo":"EMB5047","nome":"Sistemas Hidráulicos e Pneumáticos","ementa":"Definição, campo de aplicação e características dos sistemas hidráulicos. Revisão dos conceitos da mecânica de fluidos aplicados aos sistemas hidráulicos. Componentes de sistemas hidráulicos. Acionamentos hidrostáticos e sistemas hidráulicos básicos. Dimensionamento. Fundamentos da modelagem dinâmica de sistemas de controle hidráulicos. Estudo de sistemas de controle de posição. \nDefinição, campo de aplicação e características dos sistemas pneumáticos. Estrutura típica dos sistemas pneumáticos. Caracterização e princípio de funcionamento de componentes para automação pneumática. Circuitos de comando fundamentais. Álgebra Booleana aplicada à pneumática. Projeto de comandos combinatórios e seqüenciais. Dimensionamento de atuadores e válvulas de comando. Projeto para o uso de elementos pneumáticos, eletropneumáticos e controladores lógicos programáveis.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5106":{"codigo":"EMB5106","nome":"Máquinas de Fluxo e Propulsão","ementa":"Introdução às máquinas de fluxo; Elementos construtivos, classificação das máquinas e convenções; Leis de conservação aplicadas às máquinas de fluxo; Escoamento compressível em máquinas de fluxo; Triângulos de velocidades e cálculo de torque e potência ; Cavitação, perdas e eficiência em máquinas de fluxo; Análise dimensional, similaridade e velocidade específica; Máquinas movidas e máquinas motoras; Instalações hidráulicas; Anteprojeto","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5107":{"codigo":"EMB5107","nome":"Manutenção e Confiabilidade","ementa":"Atribuição da engenharia de manutenção e conceitos de mantenabilidade. Gestão da manutenção: manutenção para produtividade total (TPM), manutenção centrada em confiabilidade (MCC), manutenção classe mundial, outros modelos. Ferramentas para análise de falha: Árvore de falha (FTA), análise dos modos de falha e dos efeitos (FMEA), análise dos modos de falha, dos efeitos e da criticidade (FMECA), árvore de eventos (ET). Técnicas de análise na manutenção, monitoração visual, da integridade estrutural, de ruído, de vibrações, de óleos, de lubrificantes, de partículas de desgaste e monitoração dos instrumentos e de suas medidas. Função de variável aleatória. Confiabilidade Funcional. Confiabilidade em Sistemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5111":{"codigo":"EMB5111","nome":"Introdução ao Controle","ementa":"Modelagem de sistemas de 1ª e de 2ª ordem. Resposta de sistemas lineares no domínio do tempo. Funções de transferência e diagramas de bloco. Resposta de sistemas de 1ª e de 2ª ordem. Estabilidade. Controladores básicos. Lugar das raízes. Método das frequências. Projeto de compensadores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5116":{"codigo":"EMB5116","nome":"Eletrônica Analógica","ementa":"Introdução à eletrônica. Junção PN. Diodos. Circuitos com diodos: ceifadores, grampeadores retificadores. Transistor de junção bipolar. Polarização e circuitos amplificadores com transistores bipolares. Transistores de efeito de campo (FETs) e suas aplicações. Amplificadores Operacionais. Circuitos com amplificadores operacionais operando em malha aberta e em malha fechada com realimentação positiva e negativa. Filtros analógicos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5204":{"codigo":"EMB5204","nome":"Sistemas de Transportes","ementa":"Concepções da estrutura urbana e transporte urbano. Planejamento de transportes. Qualidade e Produtividade nos transportes. Aspectos técnicos e econômicos das modalidades de transportes. Coordenação das modalidades de transportes. Viabilidade econômica de projetos rodoviários. Transportes especializados. Os transportes no Brasil e novas perspectivas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5213":{"codigo":"EMB5213","nome":"Logística","ementa":"Conceitos básicos. Gerenciamento de cadeia de suprimentos. Gerenciamento de cadeias de distribuição. Custos logísticos. Avaliação de desempenho logístico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5215":{"codigo":"EMB5215","nome":"Logística I","ementa":"Conceitos: Logística, Logística de Suprimentos, Logística de Distribuição e Logística Integrada. Cadeia de Suprimentos. Processos da Cadeia de Suprimentos. Gestão da Cadeia de Suprimentos. Nível de Serviço Logístico. Indicadores de Desempenho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5304":{"codigo":"EMB5304","nome":"Motores de Combustão Interna I","ementa":"Conceitos fundamentais, definição, classificação e aplicações típicas de MCI. Ciclos termodinâmicos ideais e reais (teóricos e indicados). Parâmetros e curvas características de MCI (Desempenho de motores). Sistemas de dosagem de combustível e sistemas de distribuição. Carga e movimentação de gases no cilindro - Sobrealimentação. Combustão em motores de ignição por faísca. Combustão em motores de ignição por compressão. Sistemas de lubrificação de refrigeração em motores. Combustíveis de origem fóssil e combustíveis alternativos. Produção e mitigação de emissões poluentes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5311":{"codigo":"EMB5311","nome":"Controle Estatístico da Qualidade","ementa":"Ferramentas da qualidade aplicadas na metodologia de solução de problemas; métodos de controle estatístico do processo e análise da capacidade: gráficos de controle para variáveis, gráficos de controle para atributos, índices de capacidade; planejamento de experimentos: diretrizes gerais; planejamento fatorial: análise estatística; análise dos resíduos; análise dos sistemas de medição: medidas de tendência e de variação, avaliação gráfica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5328":{"codigo":"EMB5328","nome":"Motores de Combustão Interna II","ementa":"Combustão, termoquímica de misturas reagentes e propriedades de fluidos de trabalho em MCI. Fluidodinâmica do processo de carga e descarga de gases em MCI. Transmissão de calor em MCI (Balanço energético em motores). Princípios de modelagem fluidodinâmica e térmica de escoamento em MCI. Detecção de defeitos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5304","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5352":{"codigo":"EMB5352","nome":"Mecânica da Fratura","ementa":"Projeto para Falha: tipos de falhas mecânicas, tipos de fratura; Critério de Falhas para Materiais Frágeis; Mecânica da Fratura Linear Elástica: fator de intensidade de tensão, tenacidade à fratura; Mecânica da Fratura Elasto-Plástica: raio de plastificação, determinação da tenacidade à fratura; Falha por Fadiga: tipos de carregamentos cíclicos, projeto para vida finita, projeto para vida infinita, crescimento de trinca por fadiga, projeto com tolerância ao dano.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5357":{"codigo":"EMB5357","nome":"Gestão da qualidade Automotiva","ementa":"Melhoria da qualidade no contexto da indústria automotiva; dimensões da qualidade; normas de sistema de gestão da qualidade automotiva; qualificação e avaliação de fornecedores; indicadores gerenciais: técnicas de elaboração, acompanhamento e análise; principais ferramentas da qualidade requeridas pela indústria automotiva.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5109 ou EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5385":{"codigo":"EMB5385","nome":"Controle Estatístico da Qualidade","ementa":"Ferramentas da qualidade aplicadas na metodologia de solução de problemas; métodos de controle estatístico do processo e análise da capacidade: gráficos de controle para variáveis, gráficos de controle para atributos, índices de capacidade; planejamento de experimentos: diretrizes gerais; planejamento fatorial: análise estatística; análise dos resíduos; análise dos sistemas de medição: medidas de tendência e de variação, avaliação gráfica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5409":{"codigo":"EMB5409","nome":"Fundamentos de Combustão","ementa":"Introdução e definições fundamentais; termoquímica; cinética química; acoplamento térmico-químico de sistemas reativos; chamas pré-misturadas laminares; chamas de difusão laminares; combustão de líquidos; introdução à combustão turbulenta.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5413":{"codigo":"EMB5413","nome":"Mecânica dos Fluidos Computacional","ementa":"Introdução à mecânica dos fluidos computacional. Equações de transporte de massa, energia e quantidade de movimento. Equação genérica de transporte de escalar. Método dos volumes finitos \u0096 MVF. Solução de problemas difusivos pelo MVF. Solução de problemas convectivos e difusivos pelo MVF. Métodos de interpolação. Condições de contorno. Solução das Equações de Navier-Stokes. Acoplamento Pressão-velocidade. Validação e verificação de resultados numéricos. Análise de erro e incerteza numérica. Tópicos avançados: Malhas em coordenadas generalizadas e malhas não estruturadas. Introdução e modelagem da Combustão. Introdução e modelagem da Turbulência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5016 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5431":{"codigo":"EMB5431","nome":"Fundamentos de Combustão","ementa":"Introdução e definições fundamentais; termoquímica; cinética química; acoplamento térmico-químico de sistemas reativos; chamas pré-misturadas laminares; chamas de difusão laminares; combustão de líquidos; introdução à combustão turbulenta.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5432":{"codigo":"EMB5432","nome":"Mecânica dos Fluídos Computacional","ementa":"Introdução à mecânica dos fluidos computacional. Equações de transporte de massa, energia e quantidade de movimento. Equação genérica de transporte de escalar. Método dos volumes finitos - MVF. Solução de problemas difusivos pelo MVF. Solução de problemas convectivos e difusivos pelo MVF. Métodos de interpolação. Condições de contorno. Solução das Equações de Navier-Stokes. Acoplamento Pressão-velocidade. Validação e verificação de resultados numéricos. Análise de erro e incerteza numérica. Tópicos avançados: Malhas em coordenadas generalizadas e malhas não estruturadas. Introdução e modelagem da Turbulência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5016 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5433":{"codigo":"EMB5433","nome":"Transferência de Calor II","ementa":"Introdução à convecção, equações de conservação; a convecção forçada em escoamentos externos, conceitos e soluções para a camada limite térmica e hidrodinâmica sobre superfícies planas; correlações para escoamentos externos; convecção forçada em escoamentos internos, fluidodinâmica do escoamento interno; transferência de calor em escoamento interno, correlações para o escoamento interno; convecção natural; correlações para convecção natural; convecção com mudança de fase, princípios de ebulição e condensação; correlações para ebulição e condensação, introdução aos trocadores de calor; métodos LMTD (média logarítmica das diferenças de temperatura) e NTU (ou da efetividade); tipos de trocadores de calor. Transferência de massa por difusão.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5527":{"codigo":"EMB5527","nome":"Máquinas Elétricas","ementa":"Circuitos Magnéticos. Transformadores monofásicos e trifásicos. Autotransformadores. Introdução e princípios de máquinas elétricas. Fundamentos da conversão eletromecânica da energia. Campos Girantes. Máquina de corrente contínua. Máquina síncrona, Máquina de indução trifásica. Circuitos equivalentes, torque e potência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5604":{"codigo":"EMB5604","nome":"Instrumentação","ementa":"Processamento de sinais em instrumentação, dinâmica de transdutores, introdução aos Sistemas de Medição e Controle, Transdutores e Sensores, Aplicação de Circuitos Ponte, Amplificação,Demodulação e Filtragem, Impedância de Instrumentos, conversores A\/D e D\/A e multiplexação.Medição de deslocamento, medição de força, medição de pressão, medição de rotação, medição de temperatura, métodos ópticos de medição, automação da medição.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5640":{"codigo":"EMB5640","nome":"Sinais e Sistemas","ementa":"Introdução aos Sinais e Sistemas. Análise no domínio no tempo de Sistemas Contínuos e Discretos.Transformada de Laplace. Transformada Z. Séries de Fourier. Transformada de Fourier. Amostragem.Representação em Espaço de Estados.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5712":{"codigo":"EMB5712","nome":"Projeto de Sistemas de Máquina II","ementa":"Sistemas de propulsão: descrição, tipos, características, aplicações, etc. Análise das \ncaracterísticas operacionais dos motores e propulsores marítimos. Integração Casco-Motor-Hélice. Análise do perfil de operação; Dimensionamento e seleção de instalações propulsoras. Instalações de Praça de Máquinas e Plantas de Utilidades. Normas aplicáveis.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5707","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5715":{"codigo":"EMB5715","nome":"Projeto de Embarcações Especiais","ementa":"Caracterização dos tipos de rebocadores\/tratores (trabalho e salvamento) e dos tipos de embarcações de pesca oceânica comercial. Desenvolvimento projetual de embarcações destinadas à pesca oceânica comercial e de rebocadores\/tratores, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geometria de forma, estabilidade, arrasto, motorização e propulsão, bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5703 e EMB5708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5740":{"codigo":"EMB5740","nome":"Teoria da Mecânica dos Compósitos Fibrados Aplicados à Engenharia Naval - Teórica","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Construção Naval.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5713 e EMB5717","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5741":{"codigo":"EMB5741","nome":"Teoria da Mecânica dos Compósitos Fibrados Aplicados à Engenharia Naval - Prática","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Construção Naval","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5713 e EMB5717","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5742":{"codigo":"EMB5742","nome":"Materiais Metálicos para Construção Naval","ementa":"Classificação e propriedades físicas dos principais materiais metálicos empregados nos diferentes segmentos da engenharia naval: ligas ferrosas e não ferrosas. Tratamentos térmicos. Importância econômica da corrosão no setor naval. Processos de Corrosão. Controle de Corrosão. Introdução à pintura de embarcações. Camadas anticorrosivas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5743":{"codigo":"EMB5743","nome":"Processo de Construção Naval II","ementa":"Sistemas de abastecimento de água e tratamento de esgoto. Tubulações, sistemas e componentes. Descarte de água de lastro. Bombas de porão. Mecanismos de manobra, navegação e controle de movimento. Preservação do casco. Sistemas de segurança e combate a incêndio. Estruturação do casco e costado. Sistemas de ventilação, refrigeração e isolamentos. Sistemas de ancoragem e atracação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5750":{"codigo":"EMB5750","nome":"Projeto de Embarcações de Serviço","ementa":"Caracterização dos tipos de rebocadores\/tratores (trabalho e salvamento) e dos tipos de embarcações de pesca oceânica comercial. Desenvolvimento projetual de embarcações destinadas à pesca oceânica comercial e de rebocadores\/tratores, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geometria de forma, estabilidade, arrasto, motorização e propulsão, bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5703 e EMB5708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5751":{"codigo":"EMB5751","nome":"Projeto de Veleiros","ementa":"Caracterização de embarcações monocascos e multicascos movidas a vela. Desenvolvimento projetual de embarcações movidas a vela com motorização auxiliar, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geração de formas, dimensionamento estrutural, estabilidade, arrasto, mastreação, estaiamento, motorização e propulsão, dinâmica de manobras, aero e hidrodinâmica bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5703 e EMB5708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5752":{"codigo":"EMB5752","nome":"Projetos de Lancha","ementa":"Mercado nacional e internacional. Geometria das Lanchas. Nomenclatura Básica e Geometria do Casco. Representação da Geometria do Casco. As Diferentes Formas do Casco. Os Principais Sistemas (Sistema de Combate a Incêndio, Controle, Propulsão,Elétrico, Navegação, Drenagem, Esgoto, Sistema de Segurança, Amarração e Fundeio, Acomodações, Água e Combustível). Tipos e Classificação das Lanchas. O Estaleiro Náutico. Cadeia de suprimentos na indústria náutica. Construção náutica (materiais e processos). Setores presentes dentro da produção de uma lancha. Testes de performance. Regulamentos, normas e órgãos do setor náutico no Brasil e no mundo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5703 e EMB5708","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5760":{"codigo":"EMB5760","nome":"Tópicos Especiais em Ciências Navais I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5761":{"codigo":"EMB5761","nome":"Tópicos Especiais em Ciências Navais II","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5762":{"codigo":"EMB5762","nome":"Tópicos Especiaisd em Ciências Navais III","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5777":{"codigo":"EMB5777","nome":"Disciplinas de Pós Graduação 2A","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5778":{"codigo":"EMB5778","nome":"Disciplinas de Pós Graduação 2B","ementa":"","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5779":{"codigo":"EMB5779","nome":"Disciplinas de Pós Graduação 2C","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5781":{"codigo":"EMB5781","nome":"Tópicos Especiais em Transporte Marítimo I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5849":{"codigo":"EMB5849","nome":"Instalaçoes Elétricas","ementa":"-Introdução sobre sistema elétrico. Concepção de um projeto elétrico. Previsão de carga. Características e dimensionamento de condutores, dutos e proteção. Tipos de tomadas, comandos e disjuntores. Cálculo de demanda. Padrão de entrada de energia. Segurança em eletricidade. Circuito elétrico e quadro de distribuição. Normas técnicas sobre instalações. Montagem de circuitos com proteção, iluminação e tomada. Luminotécnia. Projeto de uma instalação elétrica predial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5913":{"codigo":"EMB5913","nome":"Impactos Ambientais dos Transportes","ementa":"Poluição Ambiental, Estudos de Impactos Ambientais, Métodos de Avaliação de Impactos Ambientais, Transporte e Meio Ambiente, Impactos no Modal Rodoviário, Impactos no Modal Ferroviário, Impactos no Modal Aquaviário, Impactos no Modal Dutoviário e Legislação Ambiental aplicada ao setor de Transporte.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5917":{"codigo":"EMB5917","nome":"Economia dos Transportes","ementa":"Fundamentos de economia aplicada aos transportes: teoria do consumidor, teoria da demanda, teoria da firma. Fundamentos de macroeconomia: renda, juros, políticas econômicas, crescimento econômico, estabilidade de preço, moeda, sistema monetário financeiro, inflação e relações internacionais. Estrutura de mercado: modelo de concorrência perfeita, modelo do monopólio, modelos de oligopólios. Economia regional e urbana. Economia ambiental.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5931","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5918":{"codigo":"EMB5918","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e \nOperacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5962","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5923":{"codigo":"EMB5923","nome":"Projeto e Operação de Terminais","ementa":"Conceituação geral e função dos terminais de transportes. Caracterização e especificidades dos terminais e estações de cargas e de passageiros dos modais rodoviário, ferroviário, metroviário, dutoviário, aquaviário e aéreo. Áreas de estacionamentos. Estudos de Localização. Componentes físicos: edificações e supraestrutura. Regulamentos e normas para o projeto de terminais. Relação entre o dimensionamento das instalações, o arranjo físico e as capacidades de armazenamento e de transporte. Tecnologias e equipamentos de movimentação de cargas e pessoas. Nível de serviço do transporte de cargas e de passageiros. Indicadores de desempenho de terminais. Terminais intermodais. Aspectos relacionados à expansão das instalações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5931":{"codigo":"EMB5931","nome":"Gestão de Custos em Transportes","ementa":"Fundamentos de contabilidade e gestão de custos. Principais demonstrações de resultado. Princípios e métodos de custos. Análise de custo-volume-lucro. Custo padrão. Custeio baseado em atividades. Método das unidades de esforço de produção. Estrutura de custos aplicados aos transportes. Tarifação em transportes. Custos Logísticos. Formação de preço de venda. Estudos de casos de custos em transportes.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5932":{"codigo":"EMB5932","nome":"Logística II","ementa":"Gestão de materiais. Fundamentos planejamento e controle de produção (PCP). Dimensionamento e controle de e estoque. Compras. Negociação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5934":{"codigo":"EMB5934","nome":"Logística III","ementa":"Armazenagem. Unidades de estocagem e movimentação de armazéns. Distribuição física. A interrelação entre o marketing e a distribuição física. Canais de distribuição. Modalidades de entrega. Supply chain management e o relacionamento com a demanda. Alinhamento da cadeia de suprimentos. Tópicos em logística urbana.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5937":{"codigo":"EMB5937","nome":"Impactos Ambientais dos Transportes","ementa":"Transporte de Produtos Perigosos. Impactos Ambientais nos Diferentes Modais. Licenciamento Ambiental e Legislação Ambiental Aplicada ao Setor de transporte. Logística reversa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5940":{"codigo":"EMB5940","nome":"Processos Estocásticos","ementa":"Definição, cadeias de Markov e matriz de transição. Teoria de Filas: sistemas M\/M\/1,M\/M\/c e M\/M\/c\/k. Geração de variáveis pseudo-aleatórias. Formulação de modelos de simulação. Interpretação de resultados","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010 e EMB5951","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5950":{"codigo":"EMB5950","nome":"Pesquisa Operacional I","ementa":"Formulação de modelos. Solução gráfica. Solução algébrica. Método simplex. Dualidade. Análise de sensibilidade. Problema de transportes. Problema de atribuição. Problema de caminho mínimo. Problema de fluxo máximo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5007","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5951":{"codigo":"EMB5951","nome":"Pesquisa Operacional II","ementa":"Formulação de modelos. Programação não linear: condições de otimalidade, otimização irrestrita, otimização restrita. Programação Quadrática. Programação Separável. Programação dinâmica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5950","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5952":{"codigo":"EMB5952","nome":"Pesquisa Operacional III","ementa":"Formulação de modelos. Programação Inteira, Binária e Mista: modelos e algorítmos. Técnicas de relaxação lagrangeana. Métodos Heurísticos. Meta heurísticas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5950","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20161":{"id":"537","codigo":20161,"codigo_curso":606,"carga_horaria_ufsc":4356,"carga_horaria_mec":4320,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao Curriculo 20161","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"MTM3111","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5034":{"codigo":"EMB5034","nome":"Física I","ementa":"Unidades de medida e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação da quantidade de movimento. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5002 ou FSC5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5035":{"codigo":"EMB5035","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos, elementos básicos de construção reta, plano e ponto. Construção de objetos envolvendo intersecção, secção, planificação e modelagem. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5003","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5037":{"codigo":"EMB5037","nome":"Comunicação e Expressão","ementa":"Componentes da linguagem científica e elementos para pesquisa bibliográfica. Estrutura do trabalho técnico e de pesquisa segundo normas ABNT. Aspectos fundamentais para a construção de textos. Gêneros textuais acadêmicos. Leitura e interpretação de textos.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5028","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5600":{"codigo":"EMB5600","nome":"Programação I","ementa":"Introdução a arquitetura de computadores. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos) e fluxograma, tipos de dados, estruturas de seleção e repetição, fluxo de execução, modularização (funções e procedimentos), estruturas de dados homogêneas (vetores e matrizes). Introdução a apontadores. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5013 ou INE5201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5731":{"codigo":"EMB5731","nome":"Introdução à Engenharia Naval","ementa":"Apresentar aos alunos a primeira visão do que é engenharia fazendo os alunos participarem de atividades que são o cotidiano da engenharia. Introduzir os alunos aos problemas de engenharia, ao conceito de engenharia, às funções do engenheiro e ao papel do engenheiro na sociedade. Enfatizar o trabalho em equipe na atividade do engenheiro. Valorizar a comunicação na atividade do engenheiro: preparação de relatórios, exposição e defesa oral do trabalho. Ética profissional, formação e exercício da cidadania. Apresentar aos alunos as áreas de pesquisa e atuação profissional de um Engenheiro Naval.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5004","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5006":{"codigo":"EMB5006","nome":"Química Tecnológica","ementa":"Estrutura Atômica. Ligações Químicas. Mol. Estequiometria. Combustão e Combustíveis. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Corrosão metálica: Oxidação-redução. Equação de Nernst. Mecanismos de corrosão. Meios corrosivos. Métodos de controle e monitoramento da corrosão. Polímeros: Estrutura química de polímeros. Cristalinidade. Propriedades químicas. Propriedades mecânicas. Principais polímeros de uso geral. Tratamento de águas. Tratamento de efluentes industriais. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EQA5116","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"MTM5245","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"EGR5214","prerequisito":"EMB5035","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5038":{"codigo":"EMB5038","nome":"Ciência, Tecnologia e Sociedade","ementa":"Definições de ciência, tecnologia e técnica. Desenvolvimento tecnológico e social. Relações entre ciência, tecnologia e sociedade. Desafios para o perfil do engenheiro contemporâneo. Funções do engenheiro no contexto tecnológico e social. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. A igualdade étnico racial na engenharia. Direitos humanos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EMB5004","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5039":{"codigo":"EMB5039","nome":"Física II","ementa":"Gravitação. Estática e dinâmica de fluidos. Oscilações. Ondas mecânicas e acústicas. Temperatura. Calor. Teoria cinética dos gases. Leis da termodinâmica. Máquinas térmicas. Refrigeradores. Entropia. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001 e EMB5034","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5732":{"codigo":"EMB5732","nome":"Laboratório de Engenharia Naval","ementa":"Apresentar aos alunos os principais fenômenos associados a Engenharia Naval, por meio da realização de ensaios e experimentos. Experiências nas sub-áreas de Hidrostática, Hidrodinâmica, Estruturas, Propulsão e Manobra. Teoria da semelhança e modelagem; técnicas experimentais típicas em Engenharia Naval; noções sobre medição e instrumentação em Engenharia Naval. Atividades Laboratoriais.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5009":{"codigo":"EMB5009","nome":"Termodinâmica","ementa":"Introdução e conceitos básicos. Trabalho e calor. Propriedades de substâncias puras. Primeira lei da termodinâmica. Primeira lei da termodinâmica aplicada a volumes de controle. Segunda lei da termodinâmica. Entropia e a segunda lei da termodinâmica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5029 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5010":{"codigo":"EMB5010","nome":"Estatística e Probabilidade","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5011":{"codigo":"EMB5011","nome":"Estática","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Cálculo de centróides de áreas e de volumes de figuras simples e compostas. Análise de forças distribuídas como cargas concentradas. Cálculo de momento de inércia de superfície para áreas simples e compostas. Cálculo de momento de inércia de massa para sólidos simples e compostos. Análise de Treliças, Estruturas e Máquinas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5005 e EMB5034","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5600","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5006","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5007 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5007 e EMB5016 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5017":{"codigo":"EMB5017","nome":"Mecânica dos Fluidos","ementa":"Conceitos fundamentais. Estática dos fluidos. Formulação integral e diferencial das leis de conservação. Escoamento invíscido incompressível. Análise dimensional e semelhança. Escoamento interno viscoso incompressível: escoamento laminar completamente desenvolvido e escoamento em tubos e dutos. Escoamento externo viscoso incompressível: teoria da camada limite e forças de arrasto e sustentação sobre corpos imersos.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5009 e EMB5030","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5011 e EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5041":{"codigo":"EMB5041","nome":"Dinâmica","ementa":"Cinemática dos corpos rígidos. Dinâmica dos corpos rígidos. Princípio do trabalho e energia, quantidade de movimento, impulso linear e angular para corpos rígidos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"EMB5015","prerequisito":"EMB5011","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5043":{"codigo":"EMB5043","nome":"Física III","ementa":"Lei de Coulomb. O Campo Elétrico e Potencial Eletrostático. Capacitância e Capacitores. Corrente Elétrica. Campo Magnético. A Lei de Ampere. A Lei da Indução. Circuitos. As Equações de Maxwell. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5031","prerequisito":"EMB5030 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5102":{"codigo":"EMB5102","nome":"Processo de Fabricação","ementa":"Classificação e descrição sumária dos diversos processos de fabricação. Fundamento dos processos de fundição contínua e em moldes: principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamento dos processos de conformação de materiais metálicos (laminação, forjamento, trefilação, extrusão e estampagem): principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamentos de metalurgia do pó: sinterização. Fundamentos dos processos de usinagem: torneamento, furação, fresamento, retificação, eletroerosão. Principais parâmetros dos processos de usinagem. Ferramentas de corte: materiais, revestimentos e geometrias, desgaste. Qualidade de superfícies após processo específico de fabricação, erros dimensionais. Máquinas e equipamentos. Introdução ao Comando Numérico Computadorizado (CNC). Introdução a programação e simulação da usinagem CNC e integração entre sistemas CAD\\CAM\\CNC.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"EMB5202","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5033":{"codigo":"EMB5033","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características de sistemas de medição; Calibração; Estimativa de incerteza de medição; Especificação geométrica; Medição de comprimento, ângulo, forma e rugosidade.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5103":{"codigo":"EMB5103","nome":"Transmissão de Calor I","ementa":"Mecanismos básicos de transmissão de calor. Princípios básicos da condução de calor. Condução unidimensional em regime permanente. Condução bidimensional em regime permanente. Condução em regime transiente. Métodos numéricos aplicados. Princípios básicos da radiação térmica. Radiação entre superfícies. Introdução à convecção.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5014 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5104":{"codigo":"EMB5104","nome":"Mecânica dos Sólidos II","ementa":"Cisalhamento em Vigas Longas \u0096 tensões de cisalhamento em vigas; cisalhamento em estruturas compostas. Cargas Combinadas - Campos de tensão em cascas cilíndricas e esféricas delgadas. Vasos de Pressão. Transformação de Tensão \u0096 Estado Plano de Tensão, Tensões Principais, Círculo de Mohr. Deflexão Transversal em Vigas \u0096 Linha Elástica, Equações de Equilíbrio, Vigas estaticamente indeterminadas. Flambagem de Colunas \u0096 Carga Crítica; Flambagem elástica e inelástica de vigas. Critérios de Falhas Estáticas para Materiais Dúcteis \u0096 Teoria da Tensão Cisalhante Máxima; Teoria da Energia de Distorção, Tensão Equivalente de von Mises, Fator de segurança. Critério de Falha Estática para Materiais Frágeis \u0096 Teoria da Tensão Normal Máxima. Métodos de Energia.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMC5138","prerequisito":"EMB5021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5120":{"codigo":"EMB5120","nome":"Gestão e Organização","ementa":"Histórico da teoria geral da administração. Abordagens básicas e evolução do pensamento administrativo. Conceito de Administração e funções administrativas. Gestão da Produção e Operações. Estratégia de Produção e Operações. Noções de Planejamento e Controle da Produção. Just in Time e Operações Enxutas. Gestão da Qualidade. Gestão de Pessoas. Noções de Empreendedorismo.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5109","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5643":{"codigo":"EMB5643","nome":"Eletricidade Aplicada","ementa":"Circuitos em Corrente Contínua e Corrente Alternada. Noções sobre geração, transmissão e distribuição de energia elétrica. Circuitos Trifásicos. Segurança em instalações elétricas e serviços com eletricidade. Instrumentos e Medidas Elétricas","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5043","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5733":{"codigo":"EMB5733","nome":"Arquitetura Naval I","ementa":"Tipos de embarcações e sistemas oceânicos, funções, características principais, formas de propulsão, descrição da estrutura, materiais utilizados na construção. Sociedades Classificadoras, regulamentações e normas técnicas. Geometria do casco, dimensões principais, coeficientes de forma, plano de linhas, desenho do casco. Deslocamento, peso leve, deadweight e arqueação. Introdução á visão sistêmica e a metodologia clássica de projeto naval. Modelos computacionais, curvas e superfícies paramétricas, variação geométrica. Modelagem computacional do casco e convés utilizando ferramentas CAD.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5702","prerequisito":"EMB5035","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5032":{"codigo":"EMB5032","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5110":{"codigo":"EMB5110","nome":"Elementos de Máquinas","ementa":"Estudo de uniões por parafusos. Molas helicoidais. Eixos e árvores. Ligações entre cubo e eixo. Mancais de rolamento e escorregamento. Engrenagens cilíndricas. Redutores. Acoplamentos. Freios e embreagens.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5335","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5115":{"codigo":"EMB5115","nome":"Vibrações","ementa":"Introdução aos problemas de vibração em engenharia. Terminologia. Princípios Básicos. Sistemas com um grau de liberdade: vibração livre, métodos de energia, amortecimento e vibração forçada. Sistemas com dois graus de liberdade: vibração livre e forçada. Sistemas com múltiplos graus de liberdade. Introdução aos sistemas contínuos. Introdução aos sistemas de medição de vibrações.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMC5140","prerequisito":"EMB5014 e EMB5041","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5710":{"codigo":"EMB5710","nome":"Hidrodinâmica Aplicada I","ementa":"Resistência ao avanço: natureza de resistência e determinação da resistência. Métodos teóricos, experimentais e estatísticos. Propulsores: tipos de propulsores, propulsor tipo hélice, geometria do hélice, análise de propulsores, diagramas Kt, Kq, J, séries sistemáticas, interação casco\u0096propulsor, cavitação e seleção de propulsores. Prova de mar. Ensaio de autopropulsão.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5017 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5734":{"codigo":"EMB5734","nome":"Arquitetura Naval II","ementa":"Conceitos básicos: centro de gravidade; momentos de inércia; pressão hidrostática; empuxo; deslocamento; equilíbrio hidrostático e condições de equilíbrio. Curvas hidrostáticas. Estabilidade intacta e avariada. Comprimento alagável e compartimentagem. Conceitos de estabilidade dinâmica. Normas, regulamentos e critérios de estabilidade","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5702","prerequisito":"EMB5011 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5763":{"codigo":"EMB5763","nome":"Sistemas Eletroeletrônicos a Bordo","ementa":"Arquitetura de sistemas elétricos a bordo. Geradores. Baterias. Motores. Iluminação. Cabos elétricos. Sistemas de distribuição. Sistemas de proteção. Sistemas de ajuda à navegação e operação. Sistemas de comunicação.","carga_horaria":54,"fase_sugestao":6,"equivalencia":"EMB5719","prerequisito":"EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5780":{"codigo":"EMB5780","nome":"Transporte Marítimo e de Cabotagem","ementa":"Inserção do transporte aquaviário na cadeia logística. Transporte marítimo. Evolução do comércio internacional e do transporte de longo curso. Transporte de cabotagem (noções de intermodalidade de transportes, características dos outros modais de transporte). Tipos de navios e cargas associadas. Tipos de operações de navios (tramp, liner, industrial e passageiros). Características físicas, operacionais, econômicas e de mercado do transporte aquaviário. Aspectos legais pertinentes ao transporte marítimo e aos portos. Caracterização de portos públicos e terminais privados","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5701 ou EMB5771","prerequisito":"EMB5010 e EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5707":{"codigo":"EMB5707","nome":"Máquinas Marítimas","ementa":"Introdução às instalações de máquinas. Descrição geral das instalações de máquinas, incluindo os principais sistemas de praça de máquinas de navios, embarcações, e plantas de utilidades de unidades de produção offshore. Sistemas térmicos de navios embarcações e planta de utilidades. Ciclos básicos de operação de máquinas térmicas. Ciclo Otto, Diesel, Rankine, Brayton. Ciclos combinados de co-geração. Ciclos reais. Combustíveis. Motores de combustão interna, e Turbinas a GAS. Princípios de funcionamento. Tipos e aplicações. Trocadores de calor. Turbinas a vapor. Princípios do balanço térmico em navios e plataformas. Caldeiras e aquecedores de fluido térmico.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5716":{"codigo":"EMB5716","nome":"Hidrodinâmica Aplicada II","ementa":"Estudar o comportamento no mar de sistemas navais e oceânicos e introduzir noções de manobra de embarcações de superfície. Capacitar o aluno a analisar problemas desta natureza através de técnicas analíticas, numéricas e\/ou experimentais apropriadas. Teoria de ondas. Ondas do mar. Excitação aleatória. Espectro de mar. Momentos espectrais e parâmetros característicos do mar. Massa adicional. Resposta de sistemas em excitação aleatória. Critérios para comportamento em ondas. Introdução ao princípio de manobra de navios de superfície. Equações de movimento de navios durante a manobra. Manobras padrões avaliadas em prova de mar.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5734","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5724":{"codigo":"EMB5724","nome":"Processos de Soldagem para Engenharia Naval","ementa":"Classificação dos processos de união. Fundamentos da soldagem a arco: Técnicas operacionais, terminologia, tipos de juntas, física do arco voltaico e fontes de energia. Fundamentos de metalurgia da soldagem. Processos de soldagem: Eletrodo Revestido, MIG, TIG, Arco submerso, Eletroescória, Eletrogás, e oxi-acetilênico. Brasagem. Oxicorte. Aplicações no âmbito da engenharia naval.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5706","prerequisito":"EMB5022 e EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5735":{"codigo":"EMB5735","nome":"Projeto de Navio I","ementa":"Por meio da elaboração de um projeto, os alunos exercitam de maneira interdisciplinar a integração dos seguintes conceitos: Filosofia e metodologia de projeto. Elaboração da espiral e planejamento de projeto; Análise técnica-econômica, requisitos e condições de projeto, Sociedades Classificadoras, figuras de mérito e critérios de projeto; Definição da forma e dimensões principais; Modelagem das principais funcionalidades do navio como resistência ao avanço, pesos e centros, estabilidade, estruturas, capacidade de carga, etc. de acordo com a precisão necessária nos diferentes ciclos da espiral; Formulações, modelos matemáticos e utilização de aplicativos disponíveis; Análise paramétrica e tomada de decisão; Desenho do casco e arranjo interno. Exercitam-se ainda o trabalho em grupo, planejamento, ética e conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5708","prerequisito":"EMB5710 e EMB5734","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5765":{"codigo":"EMB5765","nome":"Estruturas Navais I","ementa":"Conceito de estruturas primária, secundária e terciária. Estrutura primária. Colocação do navio na onda. Forças agindo sobre o navio. Campos de Tensão Primária. Composição das Tensões Primárias. Critérios de projeto: Carregamento, modelo de cálculo e tensões admissíveis; Princípios de projeto e análise de estruturas navais e oceânicas, incluindo utilização de regras de Sociedade Classificadoras. Flambagem de estruturas navais: modo global. Instabilidade de painéis (chapeamento) reforçados.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5703","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5772":{"codigo":"EMB5772","nome":"Materiais de Construção Naval","ementa":"Materiais metálicos: Características e propriedades físicas. Materiais não ferrosos. Principais materiais metálicos empregados no setor naval. Corrosão. Conceitos gerais. Aspectos físicos e químicos dos diversos tipos de corrosão. Formas de proteção contra corrosão. Introdução sobre materiais compósitos; principais tipos de reforços e matrizes e suas propriedades; núcleos inerciais: materiais e propriedades; Processo de laminação manual, processo de laminação a vácuo, processo de laminação por infusão.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5705 e EMB5711","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5044":{"codigo":"EMB5044","nome":"Planejamento do Trabalho de Conclusão de Curso","ementa":"A pesquisa e o método científico. Formulação do problema de pesquisa. Construção de hipóteses. Tipos e características de pesquisa. Elaboração de projetos de pesquisa. Elaboração de relatórios. Nesta etapa será proposto o projeto para o trabalho de conclusão do curso, tendo o seguinte conteúdo: Título, tema, problematização, hipóteses, objetivos, justificativa, metodologia, resultados esperados, cronograma, relação das principais referências.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5321 ou EMB5521 ou EMB5618 ou EMB5720 ou EMB5821 ou EMB5919","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2592,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5117":{"codigo":"EMB5117","nome":"Introdução ao Método de Elementos Finitos","ementa":"Sistemas CAE (Computer Aided Engineering). Matriz de rigidez e montagem do sistema de equações. Problemas lineares unidimensionais e bidimensionais. Graus de liberdade e funções de interpolação dos elementos. Modelo constitutivo do material. Análise de tensões e curva de convergência. Elementos isoparamétricos. Integração numérica. Aplicação em softwares comerciais.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5302 ou EMB5411 ou EMB5515 ou EMB5713","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5714":{"codigo":"EMB5714","nome":"Projetos de Navio II","ementa":"Por meio da continuação do projeto desenvolvido na disciplina Projeto de Navio I, os alunos exercitam de maneira interdisciplinar a integração dos seguintes conceitos: Análise de estabilidade para grandes ângulos. Estabilidade avariada e compartimentagem. Desenho do casco usando técnicas computacionais. Arranjo tridimensional do navio. Projeto da instalação propulsora. Estimativas preliminares de comportamento no mar e manobra. Construção. Exercitam-se ainda o trabalho em grupo, planejamento, ética e conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5735 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5717":{"codigo":"EMB5717","nome":"Processo de Construção Naval","ementa":"A indústria de construção naval. Características do Produto. Os estaleiros. Processo de Projeto usando sistemas CAE\/CAD\/CAM. Modelagem Geométrica Tridimensional. Desenhos para a Linha de Produção. Troca e Comunicação de Dados. Seleção e Gerenciamento de Sistema CAE\/CAD\/CAM. A sequência típica de fabricação. O estoque de chapas e perfis. Pré-tratamento. Marcação, corte e conformação. Sistemas de prevenção e combate a incêncio. Vias de escape. Transporte de cargas perigosas. Controle de qualidade. Planejamento e programação da produção. O planejamento geral do estaleiro. O plano mestre de construção do navio. A sequência de fabricação e montagem. Principais eventos. Plano de suprimentos. Planejamento do trabalho. Sistemas de informação e controle.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5120 e EMB5724 e EMB5772","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5764":{"codigo":"EMB5764","nome":"Estruturas Navais II","ementa":"Estrutura secundária. Longitudinais leves e pesados. Estrutura terciária. Anéis e cavernas transversais. Composição de tensões locais e globais. Análise computacional de estruturas navais. Vibração da viga navio e de estruturas locais. Análise computacional de vibração de embarcações. Fundamentos sobre a fadiga de estruturas oceânicas.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"EMB5709","prerequisito":"EMB5115 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5791":{"codigo":"EMB5791","nome":"Trabalho de Conclusão de Curso","ementa":"Consolidação dos conhecimentos obtidos no Curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações da área da Engenharia Naval, ou áreas correlatas.","carga_horaria":108,"fase_sugestao":9,"equivalencia":"","prerequisito":"EMB5044","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5961":{"codigo":"EMB5961","nome":"Engenharia Econômica","ementa":"Fundamentos de economia. Princípios básicos de Engenharia Econômica. Matemática financeira. Investimento e modalidades de financiamento. Bases para comparação de alternativas de investimento. Impostos e depreciação. Análise da relação: custo x volume x lucro (ACVL). Análise de sensibilidade. Análise de substituição de equipamentos. Análise de alternativas sob condições de risco e incerteza. Tópicos de Finanças e investimentos. Utilização de simulação na Engenharia Econômica em estudo de caso.","carga_horaria":54,"fase_sugestao":9,"equivalencia":"EMB5718 ou EPS7019","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5046":{"codigo":"EMB5046","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":396,"fase_sugestao":10,"equivalencia":"EMB5722 ou (EMB5794 e EMB5795)","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5794":{"codigo":"EMB5794","nome":"Estágio Curricular Obrigatório I","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":198,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5795":{"codigo":"EMB5795","nome":"Estágio Curricular Obrigatório II","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":198,"fase_sugestao":10,"equivalencia":"","prerequisito":"EMB5794","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5107":{"codigo":"EMB5107","nome":"Manutenção e Confiabilidade","ementa":"Atribuição da engenharia de manutenção e conceitos de mantenabilidade. Gestão da manutenção: manutenção para produtividade total (TPM), manutenção centrada em confiabilidade (MCC), manutenção classe mundial, outros modelos. Ferramentas para análise de falha: Árvore de falha (FTA), análise dos modos de falha e dos efeitos (FMEA), análise dos modos de falha, dos efeitos e da criticidade (FMECA), árvore de eventos (ET). Técnicas de análise na manutenção, monitoração visual, da integridade estrutural, de ruído, de vibrações, de óleos, de lubrificantes, de partículas de desgaste e monitoração dos instrumentos e de suas medidas. Função de variável aleatória. Confiabilidade Funcional. Confiabilidade em Sistemas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5353":{"codigo":"EMB5353","nome":"Manufatura Auxiliada por Computador","ementa":"Manufatura Integrada por Computador CIM-Computer Aided Manufacturing Aplicação de sistemas CAD\\CAM para a geração de programas CNC e simulação do processo de usinagem. Operações de usinagem e estratégias de corte. Métodos para cálculo de trajetórias de ferramenta em sistemas CAM. Pós-processamento de programas CNC. Processos de usinagem de formas geométricas complexas nas indústrias veiculares. Transferência e execução do programa CNC em máquinas CNC. Utilização de máquinas CNC e geração de programas CNC manual e via sistemas CAD\/CAM. Desvios geométricos e qualidade de superfícies usinadas em máquinas CNC.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5102","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5357":{"codigo":"EMB5357","nome":"Gestão da qualidade Automotiva","ementa":"Melhoria da qualidade no contexto da indústria automotiva; dimensões da qualidade; normas de sistema de gestão da qualidade automotiva; qualificação e avaliação de fornecedores; indicadores gerenciais: técnicas de elaboração, acompanhamento e análise; principais ferramentas da qualidade requeridas pela indústria automotiva.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5109 ou EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5385":{"codigo":"EMB5385","nome":"Controle Estatístico da Qualidade","ementa":"Ferramentas da qualidade aplicadas na metodologia de solução de problemas; métodos de controle estatístico do processo e análise da capacidade: gráficos de controle para variáveis, gráficos de controle para atributos, índices de capacidade; planejamento de experimentos: diretrizes gerais; planejamento fatorial: análise estatística; análise dos resíduos; análise dos sistemas de medição: medidas de tendência e de variação, avaliação gráfica.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5739":{"codigo":"EMB5739","nome":"Tópicos Especiais em Construção Naval III","ementa":"","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5740":{"codigo":"EMB5740","nome":"Teoria da Mecânica dos Compósitos Fibrados Aplicados à Engenharia Naval - Teórica","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Construção Naval.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5713 e EMB5717","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5741":{"codigo":"EMB5741","nome":"Teoria da Mecânica dos Compósitos Fibrados Aplicados à Engenharia Naval - Prática","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Construção Naval","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5713 e EMB5717","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5742":{"codigo":"EMB5742","nome":"Materiais Metálicos para Construção Naval","ementa":"Classificação e propriedades físicas dos principais materiais metálicos empregados nos diferentes segmentos da engenharia naval: ligas ferrosas e não ferrosas. Tratamentos térmicos. Importância econômica da corrosão no setor naval. Processos de Corrosão. Controle de Corrosão. Introdução à pintura de embarcações. Camadas anticorrosivas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5743":{"codigo":"EMB5743","nome":"Processo de Construção Naval II","ementa":"Sistemas de abastecimento de água e tratamento de esgoto. Tubulações, sistemas e componentes. Descarte de água de lastro. Bombas de porão. Mecanismos de manobra, navegação e controle de movimento. Preservação do casco. Sistemas de segurança e combate a incêndio. Estruturação do casco e costado. Sistemas de ventilação, refrigeração e isolamentos. Sistemas de ancoragem e atracação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5744":{"codigo":"EMB5744","nome":"Materiais Compósitos Fibrados","ementa":"Tipos de resinas e sua obtenção: resina de poliéster, estervinilica, fenólica, epóxi; tipos de fibras e sua obtenção: fibra de vidro, fibra de carbono, fibra de aramida, fibras naturais. Polimerização\/Cura e técnicas de análises; Gelcoat e suas propriedades; atividade práticas de laminação manual, laminação a vácuo e laminação por infusão; Outras rotas de processamento de materiais compósitos fibrados","carga_horaria":36,"fase_sugestao":999,"equivalencia":"EMB5711","prerequisito":"EMB5772","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5747":{"codigo":"EMB5747","nome":"Disciplina de Pós-Graduação C1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5748":{"codigo":"EMB5748","nome":"Disciplina de Pós-Graduação C2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5749":{"codigo":"EMB5749","nome":"Disciplina de Pós-Graduação C3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5026":{"codigo":"EMB5026","nome":"Ergonomia e Segurança","ementa":"Conceitos básicos. Fisiologia do trabalho. Antropometria e Biomecânica. Variáveis ambientais: iluminação e cores, ruído, vibrações, temperatura. Introdução à análise ergonômica do trabalho. Cognição no trabalho. Ergonomia do produto. Segurança no trabalho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5042":{"codigo":"EMB5042","nome":"Metodologia de Projeto de Produto","ementa":"Introdução: A visão do projeto e do produto no contexto histórico, ambiental, e de custo. Importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos. Projeto preliminar: modelagem, análise e simulação de soluções de projeto; projeto detalhado. Construção e teste de protótipos. Aplicações: produtos em engenharia veicular; transporte, infraestrutura, sistemas embarcados em nível de software e hardware. Noções de Engenharia de Sistemas.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5027","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5047":{"codigo":"EMB5047","nome":"Sistemas Hidráulicos e Pneumáticos","ementa":"Definição, campo de aplicação e características dos sistemas hidráulicos. Revisão dos conceitos da mecânica de fluidos aplicados aos sistemas hidráulicos. Componentes de sistemas hidráulicos. Acionamentos hidrostáticos e sistemas hidráulicos básicos. Dimensionamento. Fundamentos da modelagem dinâmica de sistemas de controle hidráulicos. Estudo de sistemas de controle de posição. \nDefinição, campo de aplicação e características dos sistemas pneumáticos. Estrutura típica dos sistemas pneumáticos. Caracterização e princípio de funcionamento de componentes para automação pneumática. Circuitos de comando fundamentais. Álgebra Booleana aplicada à pneumática. Projeto de comandos combinatórios e seqüenciais. Dimensionamento de atuadores e válvulas de comando. Projeto para o uso de elementos pneumáticos, eletropneumáticos e controladores lógicos programáveis.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5105":{"codigo":"EMB5105","nome":"Mecanismos","ementa":"Conceitos e notações aplicadas a mecanismos. Estudo de tipos de mecanismos. Conceitos elementares de síntese dimensional de mecanismos articulados. Análise cinemática de cames planos e engrenagens de dentes retos e helicoidais.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5041","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5352":{"codigo":"EMB5352","nome":"Mecânica da Fratura","ementa":"Projeto para Falha: tipos de falhas mecânicas, tipos de fratura; Critério de Falhas para Materiais Frágeis; Mecânica da Fratura Linear Elástica: fator de intensidade de tensão, tenacidade à fratura; Mecânica da Fratura Elasto-Plástica: raio de plastificação, determinação da tenacidade à fratura; Falha por Fadiga: tipos de carregamentos cíclicos, projeto para vida finita, projeto para vida infinita, crescimento de trinca por fadiga, projeto com tolerância ao dano.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5712":{"codigo":"EMB5712","nome":"Projeto de Sistemas de Máquina II","ementa":"Sistemas de propulsão: descrição, tipos, características, aplicações, etc. Análise das \ncaracterísticas operacionais dos motores e propulsores marítimos. Integração Casco-Motor-Hélice. Análise do perfil de operação; Dimensionamento e seleção de instalações propulsoras. Instalações de Praça de Máquinas e Plantas de Utilidades. Normas aplicáveis.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5707","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5715":{"codigo":"EMB5715","nome":"Projeto de Embarcações Especiais","ementa":"Caracterização dos tipos de rebocadores\/tratores (trabalho e salvamento) e dos tipos de embarcações de pesca oceânica comercial. Desenvolvimento projetual de embarcações destinadas à pesca oceânica comercial e de rebocadores\/tratores, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geometria de forma, estabilidade, arrasto, motorização e propulsão, bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5735 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5750":{"codigo":"EMB5750","nome":"Projeto de Embarcações de Serviço","ementa":"Caracterização dos tipos de rebocadores\/tratores (trabalho e salvamento) e dos tipos de embarcações de pesca oceânica comercial. Desenvolvimento projetual de embarcações destinadas à pesca oceânica comercial e de rebocadores\/tratores, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geometria de forma, estabilidade, arrasto, motorização e propulsão, bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5735 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5751":{"codigo":"EMB5751","nome":"Projeto de Veleiros","ementa":"Caracterização de embarcações monocascos e multicascos movidas a vela. Desenvolvimento projetual de embarcações movidas a vela com motorização auxiliar, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geração de formas, dimensionamento estrutural, estabilidade, arrasto, mastreação, estaiamento, motorização e propulsão, dinâmica de manobras, aero e hidrodinâmica bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5735 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5752":{"codigo":"EMB5752","nome":"Projetos de Lancha","ementa":"Mercado nacional e internacional. Geometria das Lanchas. Nomenclatura Básica e Geometria do Casco. Representação da Geometria do Casco. As Diferentes Formas do Casco. Os Principais Sistemas (Sistema de Combate a Incêndio, Controle, Propulsão,Elétrico, Navegação, Drenagem, Esgoto, Sistema de Segurança, Amarração e Fundeio, Acomodações, Água e Combustível). Tipos e Classificação das Lanchas. O Estaleiro Náutico. Cadeia de suprimentos na indústria náutica. Construção náutica (materiais e processos). Setores presentes dentro da produção de uma lancha. Testes de performance. Regulamentos, normas e órgãos do setor náutico no Brasil e no mundo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5735 e EMB5765","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5757":{"codigo":"EMB5757","nome":"Disciplina de Pós-Graduação p1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5758":{"codigo":"EMB5758","nome":"Disciplina de Pós-Graduação P2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5759":{"codigo":"EMB5759","nome":"Disciplina de Pós-Graduação P3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5849":{"codigo":"EMB5849","nome":"Instalaçoes Elétricas","ementa":"-Introdução sobre sistema elétrico. Concepção de um projeto elétrico. Previsão de carga. Características e dimensionamento de condutores, dutos e proteção. Tipos de tomadas, comandos e disjuntores. Cálculo de demanda. Padrão de entrada de energia. Segurança em eletricidade. Circuito elétrico e quadro de distribuição. Normas técnicas sobre instalações. Montagem de circuitos com proteção, iluminação e tomada. Luminotécnia. Projeto de uma instalação elétrica predial.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5850":{"codigo":"EMB5850","nome":"Instalações Hidráulicas Prediais","ementa":"-Sistema Predial de Água Fria, Água Quente, de Proteção e Combate a Incêndio, Esgotamento Sanitário, Águas Pluviais, Gás Combustível (GLP e GN) e Condicionamento de Ar. Noções sobre construções bioclimáticas. Conservação e uso racional de água em edificações. Compatibilização entre projetos.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5106":{"codigo":"EMB5106","nome":"Máquinas de Fluxo e Propulsão","ementa":"Introdução às máquinas de fluxo; Elementos construtivos, classificação das máquinas e convenções; Leis de conservação aplicadas às máquinas de fluxo; Escoamento compressível em máquinas de fluxo; Triângulos de velocidades e cálculo de torque e potência ; Cavitação, perdas e eficiência em máquinas de fluxo; Análise dimensional, similaridade e velocidade específica; Máquinas movidas e máquinas motoras; Instalações hidráulicas; Anteprojeto","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5111":{"codigo":"EMB5111","nome":"Introdução ao Controle","ementa":"Modelagem de sistemas de 1ª e de 2ª ordem. Resposta de sistemas lineares no domínio do tempo. Funções de transferência e diagramas de bloco. Resposta de sistemas de 1ª e de 2ª ordem. Estabilidade. Controladores básicos. Lugar das raízes. Método das frequências. Projeto de compensadores.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5116":{"codigo":"EMB5116","nome":"Eletrônica Analógica","ementa":"Introdução à eletrônica. Junção PN. Diodos. Circuitos com diodos: ceifadores, grampeadores retificadores. Transistor de junção bipolar. Polarização e circuitos amplificadores com transistores bipolares. Transistores de efeito de campo (FETs) e suas aplicações. Amplificadores Operacionais. Circuitos com amplificadores operacionais operando em malha aberta e em malha fechada com realimentação positiva e negativa. Filtros analógicos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5643","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5304":{"codigo":"EMB5304","nome":"Motores de Combustão Interna I","ementa":"Conceitos fundamentais, definição, classificação e aplicações típicas de MCI. Ciclos termodinâmicos ideais e reais (teóricos e indicados). Parâmetros e curvas características de MCI (Desempenho de motores). Sistemas de dosagem de combustível e sistemas de distribuição. Carga e movimentação de gases no cilindro - Sobrealimentação. Combustão em motores de ignição por faísca. Combustão em motores de ignição por compressão. Sistemas de lubrificação de refrigeração em motores. Combustíveis de origem fóssil e combustíveis alternativos. Produção e mitigação de emissões poluentes.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5103 e EMB5431","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5328":{"codigo":"EMB5328","nome":"Motores de Combustão Interna II","ementa":"Combustão, termoquímica de misturas reagentes e propriedades de fluidos de trabalho em MCI. Fluidodinâmica do processo de carga e descarga de gases em MCI. Transmissão de calor em MCI (Balanço energético em motores). Princípios de modelagem fluidodinâmica e térmica de escoamento em MCI. Detecção de defeitos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5304","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5413":{"codigo":"EMB5413","nome":"Mecânica dos Fluidos Computacional","ementa":"Introdução à mecânica dos fluidos computacional. Equações de transporte de massa, energia e quantidade de movimento. Equação genérica de transporte de escalar. Método dos volumes finitos \u0096 MVF. Solução de problemas difusivos pelo MVF. Solução de problemas convectivos e difusivos pelo MVF. Métodos de interpolação. Condições de contorno. Solução das Equações de Navier-Stokes. Acoplamento Pressão-velocidade. Validação e verificação de resultados numéricos. Análise de erro e incerteza numérica. Tópicos avançados: Malhas em coordenadas generalizadas e malhas não estruturadas. Introdução e modelagem da Combustão. Introdução e modelagem da Turbulência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5431":{"codigo":"EMB5431","nome":"Fundamentos de Combustão","ementa":"Introdução e definições fundamentais; termoquímica; cinética química; acoplamento térmico-químico de sistemas reativos; chamas pré-misturadas laminares; chamas de difusão laminares; combustão de líquidos; introdução à combustão turbulenta.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5409","prerequisito":"EMB5014 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5432":{"codigo":"EMB5432","nome":"Mecânica dos Fluídos Computacional","ementa":"Introdução à mecânica dos fluidos computacional. Equações de transporte de massa, energia e quantidade de movimento. Equação genérica de transporte de escalar. Método dos volumes finitos - MVF. Solução de problemas difusivos pelo MVF. Solução de problemas convectivos e difusivos pelo MVF. Métodos de interpolação. Condições de contorno. Solução das Equações de Navier-Stokes. Acoplamento Pressão-velocidade. Validação e verificação de resultados numéricos. Análise de erro e incerteza numérica. Tópicos avançados: Malhas em coordenadas generalizadas e malhas não estruturadas. Introdução e modelagem da Turbulência.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5016 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5433":{"codigo":"EMB5433","nome":"Transferência de Calor II","ementa":"Introdução à convecção, equações de conservação; a convecção forçada em escoamentos externos, conceitos e soluções para a camada limite térmica e hidrodinâmica sobre superfícies planas; correlações para escoamentos externos; convecção forçada em escoamentos internos, fluidodinâmica do escoamento interno; transferência de calor em escoamento interno, correlações para o escoamento interno; convecção natural; correlações para convecção natural; convecção com mudança de fase, princípios de ebulição e condensação; correlações para ebulição e condensação, introdução aos trocadores de calor; métodos LMTD (média logarítmica das diferenças de temperatura) e NTU (ou da efetividade); tipos de trocadores de calor. Transferência de massa por difusão.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5527":{"codigo":"EMB5527","nome":"Máquinas Elétricas","ementa":"Circuitos Magnéticos. Transformadores monofásicos e trifásicos. Autotransformadores. Introdução e princípios de máquinas elétricas. Fundamentos da conversão eletromecânica da energia. Campos Girantes. Máquina de corrente contínua. Máquina síncrona, Máquina de indução trifásica. Circuitos equivalentes, torque e potência.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5108","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5604":{"codigo":"EMB5604","nome":"Instrumentação","ementa":"Processamento de sinais em instrumentação, dinâmica de transdutores, introdução aos Sistemas de Medição e Controle, Transdutores e Sensores, Aplicação de Circuitos Ponte, Amplificação,Demodulação e Filtragem, Impedância de Instrumentos, conversores A\/D e D\/A e multiplexação.Medição de deslocamento, medição de força, medição de pressão, medição de rotação, medição de temperatura, métodos ópticos de medição, automação da medição.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5116","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5640":{"codigo":"EMB5640","nome":"Sinais e Sistemas","ementa":"Introdução aos Sinais e Sistemas. Análise no domínio no tempo de Sistemas Contínuos e Discretos.Transformada de Laplace. Transformada Z. Séries de Fourier. Transformada de Fourier. Amostragem.Representação em Espaço de Estados.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5014","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5760":{"codigo":"EMB5760","nome":"Tópicos Especiais em Ciências Navais I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5761":{"codigo":"EMB5761","nome":"Tópicos Especiais em Ciências Navais II","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5762":{"codigo":"EMB5762","nome":"Tópicos Especiaisd em Ciências Navais III","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5767":{"codigo":"EMB5767","nome":"Disciplina de Pós-Graduação N1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5768":{"codigo":"EMB5768","nome":"Disciplina de Pós-Graduação N2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5769":{"codigo":"EMB5769","nome":"Disciplina de Pós-Graduação N3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5204":{"codigo":"EMB5204","nome":"Sistemas de Transportes","ementa":"Concepções da estrutura urbana e transporte urbano. Planejamento de transportes. Qualidade e Produtividade nos transportes. Aspectos técnicos e econômicos das modalidades de transportes. Coordenação das modalidades de transportes. Viabilidade econômica de projetos rodoviários. Transportes especializados. Os transportes no Brasil e novas perspectivas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5213":{"codigo":"EMB5213","nome":"Logística","ementa":"Conceitos básicos. Gerenciamento de cadeia de suprimentos. Gerenciamento de cadeias de distribuição. Custos logísticos. Avaliação de desempenho logístico.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5215":{"codigo":"EMB5215","nome":"Logística I","ementa":"Conceitos: Logística, Logística de Suprimentos, Logística de Distribuição e Logística Integrada. Cadeia de Suprimentos. Processos da Cadeia de Suprimentos. Gestão da Cadeia de Suprimentos. Nível de Serviço Logístico. Indicadores de Desempenho.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5781":{"codigo":"EMB5781","nome":"Tópicos Especiais em Transporte Marítimo I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5787":{"codigo":"EMB5787","nome":"Disciplina de Pós-Graduação T1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5788":{"codigo":"EMB5788","nome":"Disciplina de Pós-Graduação T2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5789":{"codigo":"EMB5789","nome":"Disciplina de Pós-Graduação T3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5913":{"codigo":"EMB5913","nome":"Impactos Ambientais dos Transportes","ementa":"Poluição Ambiental, Estudos de Impactos Ambientais, Métodos de Avaliação de Impactos Ambientais, Transporte e Meio Ambiente, Impactos no Modal Rodoviário, Impactos no Modal Ferroviário, Impactos no Modal Aquaviário, Impactos no Modal Dutoviário e Legislação Ambiental aplicada ao setor de Transporte.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5917":{"codigo":"EMB5917","nome":"Economia dos Transportes","ementa":"Fundamentos de economia aplicada aos transportes: teoria do consumidor, teoria da demanda, teoria da firma. Fundamentos de macroeconomia: renda, juros, políticas econômicas, crescimento econômico, estabilidade de preço, moeda, sistema monetário financeiro, inflação e relações internacionais. Estrutura de mercado: modelo de concorrência perfeita, modelo do monopólio, modelos de oligopólios. Economia regional e urbana. Economia ambiental.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5931","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5918":{"codigo":"EMB5918","nome":"Planejamento Estratégico","ementa":"Contextualização e definição de Estratégia. Teorias de Estratégia. Planejamento Estratégico, Tático e \nOperacional. Modelos para a formulação, implementação e avaliação do Planejamento Estratégico.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"EMB5962","prerequisito":"EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5923":{"codigo":"EMB5923","nome":"Projeto e Operação de Terminais","ementa":"Conceituação geral e função dos terminais de transportes. Caracterização e especificidades dos terminais e estações de cargas e de passageiros dos modais rodoviário, ferroviário, metroviário, dutoviário, aquaviário e aéreo. Áreas de estacionamentos. Estudos de Localização. Componentes físicos: edificações e supraestrutura. Regulamentos e normas para o projeto de terminais. Relação entre o dimensionamento das instalações, o arranjo físico e as capacidades de armazenamento e de transporte. Tecnologias e equipamentos de movimentação de cargas e pessoas. Nível de serviço do transporte de cargas e de passageiros. Indicadores de desempenho de terminais. Terminais intermodais. Aspectos relacionados à expansão das instalações.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5931":{"codigo":"EMB5931","nome":"Gestão de Custos em Transportes","ementa":"Fundamentos de contabilidade e gestão de custos. Principais demonstrações de resultado. Princípios e métodos de custos. Análise de custo-volume-lucro. Custo padrão. Custeio baseado em atividades. Método das unidades de esforço de produção. Estrutura de custos aplicados aos transportes. Tarifação em transportes. Custos Logísticos. Formação de preço de venda. Estudos de casos de custos em transportes.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5010 e EMB5120","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5932":{"codigo":"EMB5932","nome":"Logística II","ementa":"Gestão de materiais. Fundamentos planejamento e controle de produção (PCP). Dimensionamento e controle de e estoque. Compras. Negociação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5934":{"codigo":"EMB5934","nome":"Logística III","ementa":"Armazenagem. Unidades de estocagem e movimentação de armazéns. Distribuição física. A interrelação entre o marketing e a distribuição física. Canais de distribuição. Modalidades de entrega. Supply chain management e o relacionamento com a demanda. Alinhamento da cadeia de suprimentos. Tópicos em logística urbana.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5215","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5937":{"codigo":"EMB5937","nome":"Impactos Ambientais dos Transportes","ementa":"Transporte de Produtos Perigosos. Impactos Ambientais nos Diferentes Modais. Licenciamento Ambiental e Legislação Ambiental Aplicada ao Setor de transporte. Logística reversa.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5940":{"codigo":"EMB5940","nome":"Processos Estocásticos","ementa":"Definição, cadeias de Markov e matriz de transição. Teoria de Filas: sistemas M\/M\/1,M\/M\/c e M\/M\/c\/k. Geração de variáveis pseudo-aleatórias. Formulação de modelos de simulação. Interpretação de resultados","carga_horaria":72,"fase_sugestao":999,"equivalencia":"EMB5907","prerequisito":"EMB5010 e EMB5951","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5950":{"codigo":"EMB5950","nome":"Pesquisa Operacional I","ementa":"Formulação de modelos. Solução gráfica. Solução algébrica. Método simplex. Dualidade. Análise de sensibilidade. Problema de transportes. Problema de atribuição. Problema de caminho mínimo. Problema de fluxo máximo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5007","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5951":{"codigo":"EMB5951","nome":"Pesquisa Operacional II","ementa":"Formulação de modelos. Programação não linear: condições de otimalidade, otimização irrestrita, otimização restrita. Programação Quadrática. Programação Separável. Programação dinâmica.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5950","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5952":{"codigo":"EMB5952","nome":"Pesquisa Operacional III","ementa":"Formulação de modelos. Programação Inteira, Binária e Mista: modelos e algorítmos. Técnicas de relaxação lagrangeana. Métodos Heurísticos. Meta heurísticas.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5950","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EPS7042":{"codigo":"EPS7042","nome":"Introdução a Pesquisa Operacional","ementa":"Programação Linear: formulação de modelos; solução gráfica; solução algébrica; método simplex; Problema de transportes; Problema de atribuição. Dualidades. Programação de Projetos: PERT\/CPM, conceitos fundamentais; montagem de redes; análise do caminho crítico; durações probabilísticas. Utilização do Computador. Introdução à Simulação.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5007","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1800,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EGC5018":{"codigo":"EGC5018","nome":"Introdução a Gestão da Inovação","ementa":"Conceitos, tipos e metodologias de inovação. Gestão de mudanças e planejamento estratégico da inovação. Cultura e liderança para inovação. A tecnologia da inovação. Gestão integrada da inovação. Conhecimento como fator de inovação. Metodologias e ferramentas da gestão. Da idéia à inovação. Modelos de negócio para inovação. Conceitos básicos de gerenciamento de projetos. Planejamento e estruturação de um projeto. Análise da viabilidade de um projeto. Agências de fomento. Cases","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5040":{"codigo":"EMB5040","nome":"Fenômenos de Transporte","ementa":"Conceitos fundamentais em mecânica dos fluidos. Hidrostàtica. Análise Integral. Equacão de Bernoulli. Escoamento viscoso incompressível. Conceitos fundamentais em transmissão de calor: Condução unidimensional em regime permanente, Convecção e Radiação. Difusão molecular e transporte de massa.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5053":{"codigo":"EMB5053","nome":"Aprimoramento da Escrita Acadêmica","ementa":"Norma culta e escrita acadêmica. Sintaxe e Gramática aplicadas à redação acadêmica. Análise de textos acadêmicos.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5054":{"codigo":"EMB5054","nome":"Relações Interpessoais nas Organizações","ementa":"Formação da personalidade e dos papéis organizacionais. A importância do autoconhecimento na \ndinâmica cognitiva e emocional das relações interpessoais. Inteligência emocional. Historicidade, \ncontemporaneidade e características sociais na construção do eu. As atividades laborais e os papéis \nsociais. A importância da comunicação na constituição dos indivíduos e dentro das organizações. \nRelações interpessoais e dinâmica organizacional. Ética e Moralidade. Líderes e Liderança.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5095":{"codigo":"EMB5095","nome":"Intercâmbio IV","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5096","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5098","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5097","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5320":{"codigo":"EMB5320","nome":"Empreendedorismo e Inovação","ementa":"Conceito de inovação. Tipos de inovação. Estratégias de Inovação. A inovação como um processo organizacional. Mecanismos de fomento e cooperação em pesquisa e desenvolvimento. Empreendedorismo. Características, tipos e habilidades do empreendedor. Plano de Negócios: etapas, processos e elaboração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5423":{"codigo":"EMB5423","nome":"Aerodinâmica","ementa":"Forças aerodinâmicas, escoamentos potencial, potencial complexo, geração de sustentação, teoria de aerofólio fino, transformação conforme, teoria da asa finita, linha da sustentação de Prandtl, vórtices, aplicação à asa finita, equação fundamental da asa finita, asa flechada, teoria da asa esbelta, método de painéis. Camada limite incompressível laminar: equações de Prandtl, solução de Blasius, separação; Transição do regime laminar para o turbulento.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5526":{"codigo":"EMB5526","nome":"Introdução à Engenharia Ferroviária e Metroviária","ementa":"História das ferrovias. Mercado ferroviário\/ metroviário. Via permanente. Locomotivas a vapor, diesel, diesel-elétrica, elétrica. Vagões de carga. Trens de passageiro. Sinalização ferroviária e metroviária. Manutenção ferroviária. Conceitos básicos sobre investigação de acidentes ferroviários. A Regulamentação das Ferrovias. Seminários sobre Tecnologias de sistemas ferroviários e metroviários.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5683":{"codigo":"EMB5683","nome":"Introdução à Engenharia Mecatrônica","ementa":"Contextualização à vida acadêmica (a universidade, o curso de engenharia de Engenharia Mecatrônica, o currículo, serviços de apoio, laboratórios). Funções do engenheiro no contexto tecnológico e social. Fundamentos básicos da Engenharia Mecatrônica: Sistemas Elétricos, Sistemas Mecânicos e Sistemas Computacionais. O mercado de trabalho e atribuições profissionais para o Engenheiro Mecatrônico. Prevenção e combate a incêndio e desastres.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5792":{"codigo":"EMB5792","nome":"Disciplina de Pós-Graduação L1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo de interesse do(a) discente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5793":{"codigo":"EMB5793","nome":"Disciplina de Pós-Graduação L2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo de interesse do(a) discente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5836":{"codigo":"EMB5836","nome":"Estudos de Impactos Ambientais","ementa":"-Avaliação de Impacto Ambiental (AIA). Licenciamento Ambiental. Estudos de Impacto Ambiental (EIA\/RIMA, EAS, RAP) Estudo de Impacto de Vizinhança. Áreas Protegidas por Lei. Legislação Ambiental","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5840":{"codigo":"EMB5840","nome":"Custos e Orçamentação","ementa":"Metodologia de implementação de custos. Análise de preços. Custos diretos e indiretos. Elaboração e análise de custos unitários. Elaboração de orçamentos. Uso de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5855":{"codigo":"EMB5855","nome":"Legislação Profissional e Fundamentos de Engenharia de Segurança","ementa":"Legislação Profissional: Fundamentação filosófica, social e política do trabalho. O Sistema profissional. Normas e legislação profissional. Remuneração profissional. Ética e disciplina profissional. Formas de exercício profissional. Campo de trabalho. Segurança do Trabalho: Conceituação de segurança na Engenharia. Controle do ambiente. Proteção coletiva e individual. Proteção contra incêndio. Riscos específicos nas várias habilitações da Engenharia. Controle de perdas e produtividade. Segurança no projeto. Análise e estatísticas de acidentes, seleção, treinamento, motivação do pessoal. Normalização e legislação específica. Organização da segurança do trabalho na empresa. Segurança em atividades extra empresa. Visitas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5927":{"codigo":"EMB5927","nome":"Engenharia de Tráfego I","ementa":"Introdução à Engenharia de Tráfego. Elementos da Engenharia de Tráfego. Modelagem de tráfego. Correntes de Tráfego. Capacidade e níveis de serviço de tráfego. Estacionamentos. Segurança viária.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7904":{"codigo":"LSB7904","nome":"Língua Brasileira de Sinais I","ementa":"Desmistificação de idéias recebidas relativamente às línguas de sinais. A língua de sinais enquanto língua utilizada pela comunidade surda brasileira. Introdução à língua brasileira de sinais: usar a língua em contextos que exigem comunicação básica, como se apresentar, realizar perguntas, responder perguntas e dar informações sobre alguns aspectos pessoais (nome, endereço, telefone). Conhecer aspectos culturais específicos da comunidade surda brasileira.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EMB5799":{"codigo":"EMB5799","nome":"Atividades Complementares","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":288,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":288,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20251":{"id":"716","codigo":20251,"codigo_curso":606,"carga_horaria_ufsc":4464,"carga_horaria_mec":3600,"aulas_semana_min":16,"aulas_semana_esperado":26,"aulas_semana_max":28,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":18,"descricao":"Referente ao Curriculo 20251","ucs":{"EMB5001":{"codigo":"EMB5001","nome":"Cálculo Diferencial e Integral I","ementa":"Noções sobre funções de uma variável real. Limite e continuidade. Derivada. Aplicações de Derivada. Integral definida e indefinida - Método da substituição e Integração por partes.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5005":{"codigo":"EMB5005","nome":"Geometria Analítica","ementa":"Matrizes. Determinantes. Sistemas lineares. Álgebra vetorial. Estudo da reta e do plano. Curvas planas. Superfícies.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5036":{"codigo":"EMB5036","nome":"Química para engenharia","ementa":"Sistema internacional de unidades. Átomos e moléculas. Ligações químicas e estrutura molecular. Equações químicas. Estequiometria. Soluções aquosas. Termoquímica. Eletroquímica: oxidaçãoredução, células eletroquímicas, equação de Nernst, eletrólise. Siderurgia: Obtenção do ferro gusa e do aço. Aços especiais. Polímeros: estrutura química, propriedades, aplicações. Cerâmicas: cerâmicas tradicionais e avançadas, propriedades, aplicações. Compósitos. Corrosão metálica: tipos e formas, meios corrosivos, mecanismos de proteção, monitoramento. Combustíveis e combustão. Química Ambiental. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5006","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5055":{"codigo":"EMB5055","nome":"Representação Gráfica","ementa":"Noções fundamentais para elaboração e interpretação de esboços e desenhos técnicos. Fundamentos de Desenho Geométrico. Desenho Projetivo. Normas para desenho (ABNT). Cotagem. Escalas. Desenho de objetos no 1º e 3º diedros. Perspectiva Isométrica. Aplicação das projeções nos desenhos de engenharia por meio manual e computacional.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"EMB5035","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5062":{"codigo":"EMB5062","nome":"Comunicação e Expressão","ementa":"Leitura e interpretação de textos técnicos e científicos da área da Engenharia. Estudo teórico e prático de textos técnicos e científicos relevantes à execução de atividades acadêmicas, como: fichamento, resumo, resenha, artigo, seminário. Normas da ABNT relevantes à produção\/elaboração de textos acadêmicos. Linguagem técnica e científica. Normas gramaticais vigentes. Exercício de apropriação de textos da área da Engenharia.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5037","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5648":{"codigo":"EMB5648","nome":"Programação I","ementa":"Introdução a arquitetura de computadores. Lógica de programação: formalização de problemas com representação em pseudocódigo (algoritmos) e fluxograma, tipos de dados, estruturas de seleção e repetição, fluxo de execução, modularização (funções e procedimentos), estruturas de dados homogêneas (vetores e matrizes). Introdução a apontadores. Arquivos. Implementação prática de algoritmos em uma linguagem de alto nível.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"EMB5600","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5729":{"codigo":"EMB5729","nome":"Introdução à Engenharia Naval","ementa":"Apresentar aos alunos a primeira visão do que é engenharia fazendo os alunos participarem de atividades que são o cotidiano da engenharia. Introduzir os alunos aos problemas de engenharia, ao conceito de engenharia, às funções do engenheiro e ao papel do engenheiro na sociedade. Enfatizar o trabalho em equipe na atividade do engenheiro. Valorizar a comunicação na atividade do engenheiro: preparação de relatórios, exposição e defesa oral do trabalho. Ética profissional, formação e exercício da cidadania. Apresentar aos alunos as áreas de pesquisa e atuação profissional de um Engenheiro Naval. Prevenção e combate a incêndio e a desastres em estabelecimentos, edificações e áreas de reunião de público.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"EMB5731","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5007":{"codigo":"EMB5007","nome":"Álgebra Linear","ementa":"Espaços vetoriais. Transformações lineares. Mudança de base. Produto interno. Transformações ortogonais. Autovalores e autovetores de um operador. Diagonalização.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5005","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5012":{"codigo":"EMB5012","nome":"Desenho e Modelagem Geométrica","ementa":"Sistemas CAD, metodologia para modelamento de produtos tridimensionais. Práticas com software CAD. Técnicas de modelamento sólido. Modelamento de produtos, geração de desenho de engenharia, normas de desenho técnico, desenho de conjunto, montagem, lista de materiais.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5055","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5022":{"codigo":"EMB5022","nome":"Ciência dos Materiais","ementa":"Introdução a Ciência e Engenharia dos Materiais \u0096 materiais aplicados na engenharia. Tipos, classificação e aplicações dos diversos materiais. Estrutura atômica e ligações inter-atômicas. Materiais cristalinos e não cristalinos. Imperfeições nos sólidos. Difusão. Processos metalográficos. Diagramas de equilíbrio. Comportamento mecânico e dinâmico dos materiais. Falhas, fratura, fadiga e fluência. Estrutura e propriedades dos materiais metálicos, cerâmicos e poliméricos. Introdução a compósitos.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001 e EMB5036","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5029":{"codigo":"EMB5029","nome":"Cálculo Diferencial e Integral II","ementa":"Métodos de integração. Aplicações da integral definida. Integrais impróprias. Funções de várias variáveis. Derivadas parciais. Aplicações das derivadas parciais. Integração múltipla.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5048":{"codigo":"EMB5048","nome":"Física I","ementa":"Unidades de medidas e vetores. Cinemática. Leis de Newton e aplicações. Trabalho e energia potencial. Conservação da energia. Conservação do momento linear e angular. Rotação de corpos rígidos e rolamento. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"EMB5034","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5063":{"codigo":"EMB5063","nome":"Ciência, Tecnologia e Sociedade","ementa":"Definições de ciência, tecnologia e técnica. Desenvolvimento tecnológico e social. Relações entre ciência, tecnologia e sociedade. Desafios para o perfil do engenheiro contemporâneo. Funções do engenheiro no contexto tecnológico e social. Ética, moral, valores e ética profissional. O Código de ética como ferramenta para o fortalecimento da cultura organizacional. Disciplina consciente. A igualdade étnico racial na engenharia.História e cultura Afro-Brasileira e Africana. Direitos humanos.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"EMB5038","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5730":{"codigo":"EMB5730","nome":"Laboratório de Engenharia Naval I","ementa":"Caracterização dimensional de embarcações, considerando técnicas de medição direta e indireta, bem como a análise de incertezas. Introdução do conceito de grandeza vetorial e de equilíbrio de corpos no cenário da análise de pesos e centros da embarcação. Apresentação dos cálculos de centro de volume, centro de massa, momento de inércia de área e momento de inércia de massa, todos aplicados na caracterização da embarcação. Apresentação de experimentos típicos da mecânica geral, hidrostática, hidrodinâmica e\/ou estruturas, que explorem os conceitos e métodos de caracterização aprendidos. Introdução uma ferramenta matemática de análise aplicada aos experimentos voltados ao estudo de problemas e\/ou fenômenos da Engenharia Naval.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"EMB5011 e EMB5732","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5016":{"codigo":"EMB5016","nome":"Cálculo Numérico","ementa":"Introdução à matemática computacional, erros e aritmética de ponto flutuante. Solução de equações algébricas e transcendentais. Solução de sistemas de equações lineares, métodos diretos e iterativos. Solução de sistemas de equações não-lineares. Interpolação. Ajuste de curvas. Integração numérica.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5010","prerequisito":"EMB5001 e EMB5005 e EMB5648","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5030":{"codigo":"EMB5030","nome":"Cálculo Vetorial","ementa":"Funções vetoriais. Limites, derivadas e integrais de funções vetoriais. Parametrização de curvas e superfícies. Campos vetoriais. Gradiente, divergente e rotacional. Integrais de linha. Integrais de superfície. Teorema de Green. Teorema de Stokes. Teorema de Gauss.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5005 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5039":{"codigo":"EMB5039","nome":"Física II","ementa":"Gravitação. Estática e dinâmica de fluidos. Oscilações. Ondas mecânicas e acústicas. Temperatura. Calor. Teoria cinética dos gases. Leis da termodinâmica. Máquinas térmicas. Refrigeradores. Entropia. Atividades Laboratoriais.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"","prerequisito":"EMB5001 e EMB5048","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5057":{"codigo":"EMB5057","nome":"Estatística I","ementa":"Estatística descritiva e análise exploratória de dados. Teoria da probabilidade. Variáveis aleatórias discretas e contínuas, e suas principais distribuições de probabilidade. Estimação de parâmetros. Teste de hipóteses para parâmetros: média, proporção e variância. Comparação entre dois tratamentos.","carga_horaria":72,"fase_sugestao":3,"equivalencia":"EMB5010","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5700":{"codigo":"EMB5700","nome":"Estruturas Navais I","ementa":"Estudo do equilíbrio de partículas e corpos rígidos no plano e no espaço. Determinação das reações em apoios padrão utilizados na Engenharia. Análise de Treliças. Conceito de estruturas leves. Conceito de estruturas primária, secundária e terciária. Modelo de viga navio.. Colocação do navio na onda. Forças agindo sobre o navio. Análise de forças distribuídas como cargas concentradas. Determinação de forças axiais, forças cortantes e momentos fletores em estruturas e vigas. Construção de diagramas de força cortante e momento fletor. Introdução ao conceito de tensão. Campos de Tensão Primária. Critérios de projeto: Carregamento, modelo de cálculo e tensões admissíveis. Princípios de projeto e análise de estruturas navais e oceânicas, incluindo utilização de regras de Sociedade Classificadoras. Introdução a flambagem de estruturas navais.","carga_horaria":90,"fase_sugestao":3,"equivalencia":"EMB5011 e EMB5765","prerequisito":"EMB5001","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5736":{"codigo":"EMB5736","nome":"Laboratório de Engenharia Naval II","ementa":"Apresentação da teoria sobre semelhança e redução de escala no contexto da Engenharia Naval. Introdução ou uso de materiais e métodos experimentais para a monitoração, registro e análise de grandezas variantes no tempo e\/ou na posição. Introdução sobre a técnica de tratamento de sinais. Execução de experimentos importantes para a investigação de problemas e\/ou fenômenos que afetam os sistemas navais, particularmente os hidrostáticos, hidrodinâmicos e estruturais. Aprofundamento no uso da ferramenta matemática de análise aplicada aos experimentos navais.","carga_horaria":54,"fase_sugestao":3,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5009":{"codigo":"EMB5009","nome":"Termodinâmica","ementa":"Introdução e conceitos básicos. Trabalho e calor. Propriedades de substâncias puras. Primeira lei da termodinâmica. Primeira lei da termodinâmica aplicada a volumes de controle. Segunda lei da termodinâmica. Entropia e a segunda lei da termodinâmica.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5029 e EMB5039","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5014":{"codigo":"EMB5014","nome":"Séries e Equações Diferenciais","ementa":"Sequências e séries infinitas. Séries de potências. Séries de Taylor. Série de Fourier. Equações diferenciais de 1ª ordem. Equações diferenciais lineares de ordem n. Noções sobre transformada de Laplace. Noções sobre equações diferenciais parciais. Soluções em séries para equações diferencias lineares. Noções sobre métodos numéricos para solução de equações diferenciais.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5007 e EMB5029","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5021":{"codigo":"EMB5021","nome":"Mecânica dos Sólidos I","ementa":"Análise de Tensão \u0096 Conceitos e Definições, Tensão normal média; Tensão cisalhante média; Cisalhamento puro e duplo, Tensão admissível. Análise de Deformação \u0096 Conceitos e Definições; Deformação específica; Deformação por cisalhamento. Relação entre Tensão e Deformação \u0096 Equações Constitutivas; Lei de Hooke; Razão de Poisson; Carga Axial \u0096 Deformação térmica; membros estaticamente indeterminados, Equações de Compatibilidade, concentração de tensão. Torção \u0096 Deformação por torção; fórmula da torção; deflexão torcional; concentração de tensão. Flexão \u0096 Diagrama de Força Cortante (Cisalhamento) e Momento fletor; deformação por flexão, Flexão simples plana, oblíqua, seções assimétricas","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5700 e EMB5730","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5041":{"codigo":"EMB5041","nome":"Dinâmica","ementa":"Cinemática dos corpos rígidos. Dinâmica dos corpos rígidos. Princípio do trabalho e energia, quantidade de movimento, impulso linear e angular para corpos rígidos.","carga_horaria":54,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5700 e EMB5730","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5102":{"codigo":"EMB5102","nome":"Processo de Fabricação","ementa":"Classificação e descrição sumária dos diversos processos de fabricação. Fundamento dos processos de fundição contínua e em moldes: principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamento dos processos de conformação de materiais metálicos (laminação, forjamento, trefilação, extrusão e estampagem): principais parâmetros, ferramentas, máquinas e equipamentos, campo de aplicações. Fundamentos de metalurgia do pó: sinterização. Fundamentos dos processos de usinagem: torneamento, furação, fresamento, retificação, eletroerosão. Principais parâmetros dos processos de usinagem. Ferramentas de corte: materiais, revestimentos e geometrias, desgaste. Qualidade de superfícies após processo específico de fabricação, erros dimensionais. Máquinas e equipamentos. Introdução ao Comando Numérico Computadorizado (CNC). Introdução a programação e simulação da usinagem CNC e integração entre sistemas CAD\\CAM\\CNC.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5733":{"codigo":"EMB5733","nome":"Arquitetura Naval I","ementa":"Tipos de embarcações e sistemas oceânicos, funções, características principais, formas de propulsão, descrição da estrutura, materiais utilizados na construção. Sociedades Classificadoras, regulamentações e normas técnicas. Geometria do casco, dimensões principais, coeficientes de forma, plano de linhas, desenho do casco. Deslocamento, peso leve, deadweight e arqueação. Introdução á visão sistêmica e a metodologia clássica de projeto naval. Modelos computacionais, curvas e superfícies paramétricas, variação geométrica. Modelagem computacional do casco e convés utilizando ferramentas CAD.","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":null,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5017":{"codigo":"EMB5017","nome":"Mecânica dos Fluidos","ementa":"Conceitos fundamentais. Estática dos fluidos. Formulação integral e diferencial das leis de conservação. Escoamento invíscido incompressível. Análise dimensional e semelhança. Escoamento interno viscoso incompressível: escoamento laminar completamente desenvolvido e escoamento em tubos e dutos. Escoamento externo viscoso incompressível: teoria da camada limite e forças de arrasto e sustentação sobre corpos imersos.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5009 e EMB5030","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5059":{"codigo":"EMB5059","nome":"Metodologia de Projeto","ementa":"Introdução: contexto e importância do projeto de produtos. Modelos do processo e planejamento do projeto de produtos\/serviços. Métodos e ferramentas para a especificação de problemas de projeto e de concepção de produtos\/serviços. Projeto preliminar: modelagem, análise e simulação de soluções de projeto. Projeto detalhado. Técnicas de prototipagem. Desenvolvimento de projetos com a Comunidade. Técnicas e conceitos de Desenho Universal em projetos de engenharia.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":800,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5061":{"codigo":"EMB5061","nome":"Metrologia","ementa":"Conceitos fundamentais da metrologia científica e industrial; Sistema Internacional de Unidades; Medições diretas e Indiretas; Erros de medição; Características dos sistemas de medição; Calibração e rastreabilidade metrológica;Estimativa de incerteza de medição; Comprovação metrológica;Práticas em laboratório (grandezas mecânicas e elétricas).","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5033","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5104":{"codigo":"EMB5104","nome":"Mecânica dos Sólidos II","ementa":"Cisalhamento em Vigas Longas \u0096 tensões de cisalhamento em vigas; cisalhamento em estruturas compostas. Cargas Combinadas - Campos de tensão em cascas cilíndricas e esféricas delgadas. Vasos de Pressão. Transformação de Tensão \u0096 Estado Plano de Tensão, Tensões Principais, Círculo de Mohr. Deflexão Transversal em Vigas \u0096 Linha Elástica, Equações de Equilíbrio, Vigas estaticamente indeterminadas. Flambagem de Colunas \u0096 Carga Crítica; Flambagem elástica e inelástica de vigas. Critérios de Falhas Estáticas para Materiais Dúcteis \u0096 Teoria da Tensão Cisalhante Máxima; Teoria da Energia de Distorção, Tensão Equivalente de von Mises, Fator de segurança. Critério de Falha Estática para Materiais Frágeis \u0096 Teoria da Tensão Normal Máxima. Métodos de Energia.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"","prerequisito":"EMB5021","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5121":{"codigo":"EMB5121","nome":"Eletricidade Aplicada","ementa":"Carga elétrica, Campos elétricos e Lei de Gauss; Potencial elétrico e capacitância. Circuitos em Corrente Contínua e Corrente Alternada. Noções sobre geração, transmissão e distribuição de energia elétrica. Circuitos Trifásicos. Segurança em instalações elétricas e serviços com eletricidade. Instrumentos e Medidas elétricas.","carga_horaria":72,"fase_sugestao":5,"equivalencia":"EMB5043 e EMB5643","prerequisito":"EMB5030","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5726":{"codigo":"EMB5726","nome":"Arquitetura Naval II","ementa":"Revisão sobre os conceitos básicos de: deslocamento e centro de gravidade; momentos de inércia de massa e raio de giração; pressão hidrostática e empuxo; equilíbrio hidrostático; e condições de equilíbrio. Curvas hidrostáticas. Estabilidade intacta e avariada. Comprimento alagável e compartimentagem. Conceitos de estabilidade dinâmica. Normas, regulamentos e critérios de estabilidade.","carga_horaria":54,"fase_sugestao":5,"equivalencia":"EMB5734","prerequisito":"EMB5733","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5115":{"codigo":"EMB5115","nome":"Vibrações","ementa":"Introdução aos problemas de vibração em engenharia. Terminologia. Princípios Básicos. Sistemas com um grau de liberdade: vibração livre, métodos de energia, amortecimento e vibração forçada. Sistemas com dois graus de liberdade: vibração livre e forçada. Sistemas com múltiplos graus de liberdade. Introdução aos sistemas contínuos. Introdução aos sistemas de medição de vibrações.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5041 e EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5119":{"codigo":"EMB5119","nome":"Elementos de Máquinas","ementa":"Estudo de uniões por parafusos. Molas helicoidais. Eixos e árvores. Ligações entre cubo e eixo. Mancais de rolamento e escorregamento. Engrenagens cilíndricas. Redutores. Acoplamentos. Elementos mecânicos flexíveis.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5110","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5120":{"codigo":"EMB5120","nome":"Gestão e Organização","ementa":"Histórico da teoria geral da administração. Abordagens básicas e evolução do pensamento administrativo. Conceito de Administração e funções administrativas. Gestão da Produção e Operações. Estratégia de Produção e Operações. Noções de Planejamento e Controle da Produção. Just in Time e Operações Enxutas. Gestão da Qualidade. Gestão de Pessoas. Noções de Empreendedorismo.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1400,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5727":{"codigo":"EMB5727","nome":"Hidrodinâmica Aplicada I","ementa":"Resistência ao avanço: natureza de resistência e determinação da resistência. Métodos teóricos, experimentais e estatísticos. Propulsores: tipos de propulsores, propulsor tipo hélice, geometria do hélice, análise de propulsores, diagramas Kt, Kq, J, séries sistemáticas, interação casco propulsor, cavitação e seleção de propulsores.","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5710","prerequisito":"EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5728":{"codigo":"EMB5728","nome":"Máquinas Marítimas","ementa":"Mecanismos básicos de transmissão de calor: condução e convecção. Sistemas térmicos a bordo de embarcações. Ciclos básicos de operação de máquinas térmicas. Ciclo Otto, Diesel, Rankine, Brayton. Ciclos combinados de cogeração. Ciclos reais. Combustíveis. Motores de combustão interna e Turbinas a gás: princípios de funcionamento, tipos e aplicações (embarcações pequeno e grande porte). Trocadores de calor. Turbinas a vapor. Caldeiras","carga_horaria":72,"fase_sugestao":6,"equivalencia":"EMB5707","prerequisito":"EMB5009","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5780":{"codigo":"EMB5780","nome":"Transporte Marítimo e de Cabotagem","ementa":"Inserção do transporte aquaviário na cadeia logística. Transporte marítimo. Evolução do comércio internacional e do transporte de longo curso. Transporte de cabotagem (noções de intermodalidade de transportes, características dos outros modais de transporte). Tipos de navios e cargas associadas. Tipos de operações de navios (tramp, liner, industrial e passageiros). Características físicas, operacionais, econômicas e de mercado do transporte aquaviário. Aspectos legais pertinentes ao transporte marítimo e aos portos. Caracterização de portos públicos e terminais privados","carga_horaria":72,"fase_sugestao":6,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5725":{"codigo":"EMB5725","nome":"Processos de Soldagem para Engenharia Naval","ementa":"Classificação dos processos de união. Fundamentos dos processos de união: terminologia, tipos de juntas e chanfros, posição de soldagem. Fundamentos de metalurgia da soldagem. Física do arco voltaico e fontes de energia para soldagem. Processos de soldagem a arco: Eletrodo Revestido, MIG\/MAG, TIG, Plasma, Arco submerso e Eletrogás. Soldagem por Eletroescória. Soldagem oxiacetilênica e Oxicorte. Soldagem a laser. Brasagem. Aplicações no âmbito da engenharia naval.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5724","prerequisito":"EMB5022 e EMB5121","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5737":{"codigo":"EMB5737","nome":"Projetos de Navio","ementa":"Por meio da elaboração de um projeto, os alunos exercitam de maneira interdisciplinar os conceitos de metodologia de projeto e projeto conceitual de embarcações. Entre os sistemas estudados, destacam-se: dimensões principais, desenho de casco, pesos e centros, resistência ao avanço, instalação propulsora (tipos, seleção e dimensionamento), estabilidade (inicial e a grandes ângulos), projeto estrutural da seção mestra etc. Formulações, modelos matemáticos e ferramentas disponíveis para o projeto naval. Exercitam-se ainda o trabalho em grupo, o planejamento, a ética e a conduta profissional, além da capacidade de comunicação oral e escrita. Formulações, modelos matemáticos e ferramentas disponíveis para o projeto naval. Exercitam-se ainda o trabalho em grupo, o planejamento, a ética e a conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":108,"fase_sugestao":7,"equivalencia":"EMB5707 e EMB5735","prerequisito":"EMB5700 e EMB5726 e EMB5727","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5738":{"codigo":"EMB5738","nome":"Controle e Manobra de Sistemas navais","ementa":"Introdução à manobrabilidade. Equações lineares do movimento de manobra de um navio de superfície. Estabilidade direcional para embarcações de superfície. Fundamentos de teoria de controle. Controle de manobras. Manobras padronizadas. Critérios IMO para manobras. Manobras de sistemas subaquáticos.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5753":{"codigo":"EMB5753","nome":"Hidrodinâmica Aplicada II","ementa":"Estudar a teoria de ondas de gravidade. Caracterizar os comportamentos dinâmicos, introduzindo os conceitos de estacionariedade e ergodicidade. Caracterizar a excitação aleatória das ondas e definir hipóteses para a sua consideração determinística aproximada. Obter o espectro de mar, seus momentos espectrais e seus parâmetros característicos. Apresentar os espectros padronizados. Aplicações de funções de transferência no contexto da engenharia naval e oceânica. Estudar o cruzamento espectral e a obtenção da resposta do sistema à excitação de onda. Critérios para comportamento em ondas.Capacitar o aluno a analisar problemas de comportamento no mar por intermédio de técnicas analíticas, numéricas e\/ou experimentais apropriadas.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"EMB5716","prerequisito":"EMB5727","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5764":{"codigo":"EMB5764","nome":"Estruturas Navais II","ementa":"Estrutura secundária. Longitudinais leves e pesados. Estrutura terciária. Anéis e cavernas transversais. Composição de tensões locais e globais. Análise computacional de estruturas navais. Vibração da viga navio e de estruturas locais. Análise computacional de vibração de embarcações. Fundamentos sobre a fadiga de estruturas oceânicas.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5115","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5772":{"codigo":"EMB5772","nome":"Materiais de Construção Naval","ementa":"Materiais metálicos: Características e propriedades físicas. Materiais não ferrosos. Principais materiais metálicos empregados no setor naval. Corrosão. Conceitos gerais. Aspectos físicos e químicos dos diversos tipos de corrosão. Formas de proteção contra corrosão. Introdução sobre materiais compósitos; principais tipos de reforços e matrizes e suas propriedades; núcleos inerciais: materiais e propriedades; Processo de laminação manual, processo de laminação a vácuo, processo de laminação por infusão.","carga_horaria":72,"fase_sugestao":7,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5064":{"codigo":"EMB5064","nome":"Avaliação de Impactos Ambientais","ementa":"Poluição Ambiental. Controle de Poluição do Solo, Água e Ar, Impactos Ambientais, Gestão Ambiental. Produção mais Limpa. Riscos e Impactos Tecnológicos.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"EMB5032","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5117":{"codigo":"EMB5117","nome":"Introdução ao Método de Elementos Finitos","ementa":"Sistemas CAE (Computer Aided Engineering). Matriz de rigidez e montagem do sistema de equações. Problemas lineares unidimensionais e bidimensionais. Graus de liberdade e funções de interpolação dos elementos. Modelo constitutivo do material. Análise de tensões e curva de convergência. Elementos isoparamétricos. Integração numérica. Aplicação em softwares comerciais.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5104","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5717":{"codigo":"EMB5717","nome":"Processo de Construção Naval","ementa":"A indústria de construção naval. Características do Produto. Os estaleiros. Processo de Projeto usando sistemas CAE\/CAD\/CAM. Modelagem Geométrica Tridimensional. Desenhos para a Linha de Produção. Troca e Comunicação de Dados. Seleção e Gerenciamento de Sistema CAE\/CAD\/CAM. A sequência típica de fabricação. O estoque de chapas e perfis. Pré-tratamento. Marcação, corte e conformação. Sistemas de prevenção e combate a incêncio. Vias de escape. Transporte de cargas perigosas. Controle de qualidade. Planejamento e programação da produção. O planejamento geral do estaleiro. O plano mestre de construção do navio. A sequência de fabricação e montagem. Principais eventos. Plano de suprimentos. Planejamento do trabalho. Sistemas de informação e controle.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5120 e EMB5725 e EMB5772","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5766":{"codigo":"EMB5766","nome":"Projeto Final de Curso","ementa":"Por meio do desenvolvimento de um projeto integrador, os alunos consolidam a formação de Bacharéis em Engenharia Naval. O trabalho deverá contemplar de maneira interdisciplinar as diversas áreas associadas a Engenharia Naval, entre elas:metodologia de projeto, transporte marítimo, dimensões principais e coeficientes de forma, desenho do casco, arranjo, pesos e centros, análise de estabilidade (inicial e grandes ângulos), resistência ao avanço, instalação propulsora, projeto estrutural, estabilidade avariada e compartimentagem, comportamento no mar, construção, manobra, sistemas elétricos, impacto ambiental e custos. Exercitam-se ainda o trabalho em grupo, o planejamento, a ética e a conduta profissional, além da capacidade de comunicação oral e escrita.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5737","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5770":{"codigo":"EMB5770","nome":"Mecânica dos Fluidos  Computacional Naval","ementa":"Introduzir a mecânica dos fluidos computacional no cenário da engenharia naval. Rever as equações fundamentais que governam o escoamento fluido. Apresentar os principais métodos de determinação numérica das forças e dos momentos causados pelo escoamento fluido no casco do navio. Solução numérica de problemas típicos, que motivam discussões principalmente em relação às hipóteses e simplificações, às discretizações, e às condições de contorno adotadas. Introduzir a metodologia de verificação e validação dos resultados numéricos, a partir da análise de erros e incertezas.","carga_horaria":72,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5016 e EMB5017","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5961":{"codigo":"EMB5961","nome":"Engenharia Econômica","ementa":"Fundamentos de economia. Princípios básicos de Engenharia Econômica. Matemática financeira. Investimento e modalidades de financiamento. Bases para comparação de alternativas de investimento. Impostos e depreciação. Análise da relação: custo x volume x lucro (ACVL). Análise de sensibilidade. Análise de substituição de equipamentos. Análise de alternativas sob condições de risco e incerteza. Tópicos de Finanças e investimentos. Utilização de simulação na Engenharia Econômica em estudo de caso.","carga_horaria":54,"fase_sugestao":8,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":1400,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"ZZT6696":{"codigo":"ZZT6696","nome":"Disciplinas Optativas que integram o núcleo de aperfeiçoamento","ementa":"","carga_horaria":288,"fase_sugestao":9,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":[],"tipo_uc":"Anotação"},"EMB5790":{"codigo":"EMB5790","nome":"Estágio Curricular Obrigatório","ementa":"Vivência em indústrias, ou em instituições de pesquisa, ou em empresas, que se utilizam dos conteúdos técnicos que compõe o curso; Treinamento prático a partir da aplicação dos 103 conhecimentos técnicos adquiridos no curso; Desenvolvimento ou aperfeiçoamento do relacionamento profissional e humano.","carga_horaria":216,"fase_sugestao":10,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":3000,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5058":{"codigo":"EMB5058","nome":"Estatística II","ementa":"Estimação de parâmetros pelo método da máxima verossimilhança. Regressão linear simples e múltipla: estimação de parâmetros e teste de hipóteses, predição para novas observações, analise da adequação do modelo, correlação. Introdução a Modelos Lineares Generalizados (MLG): família exponencial de distribuições, elementos básicos, principais MLGs para dados discretos, Estimação de parâmetros e teste de hipóteses, avaliação do ajuste do modelo. Aplicações com uso de ferramentas computacionais.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5067":{"codigo":"EMB5067","nome":"Gestão da Qualidade","ementa":"A Evolução do conceito e as dimensões da qualidade; Fundamentos e princípios da gestão da qualidade; Abordagem de risco no planejamento estratégico e operacional; Normas de Sistemas de Gestão da Qualidade e o processo de certificação; Auditorias de sistema, de processo e de produto; Manutenção e Melhoria Contínua na gestão da qualidade; Normas setoriais de sistemas de gestão da qualidade.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5095":{"codigo":"EMB5095","nome":"Intercâmbio IV","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5096","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5096":{"codigo":"EMB5096","nome":"Intercâmbio III","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5098","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5097":{"codigo":"EMB5097","nome":"Intercâmbio I","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5098":{"codigo":"EMB5098","nome":"Intercâmbio II","ementa":"Intercâmbio acadêmico efetuado em instituição parceira da UFSC, para desenvolvimento de atividades técnico-científicas em instituições nacionais ou internacionais.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5097","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5100":{"codigo":"EMB5100","nome":"Projeto Empreender e Inovar","ementa":"Processo de concepção de produtos, serviços e negócios. Aplicação de conceitos e ferramentas de gestão. Aplicação de modelos para desenvolvimento de novos negócios","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5320","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","5":"Extensão"},"tipo_uc":"Disciplina"},"EMB5320":{"codigo":"EMB5320","nome":"Empreendedorismo e Inovação","ementa":"Conceito de inovação. Tipos de inovação. Estratégias de Inovação. A inovação como um processo organizacional. Mecanismos de fomento e cooperação em pesquisa e desenvolvimento. Empreendedorismo. Características, tipos e habilidades do empreendedor. Plano de Negócios: etapas, processos e elaboração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5059 e EMB5120 e EMB5961","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5350":{"codigo":"EMB5350","nome":"Controle Estatístico da Qualidade","ementa":"Fundamentos e métodos estatísticos aplicáveis ao controle da qualidade e à melhoria continua. Controle estatístico do processo e análise da capacidade: compreensão da variação, gráficos de controle para variáveis e para atributos, índices de capacidade, gráficos de controle para aplicações específicas. Análise dos sistemas de medição: impacto da variação do sistema de medição na inspeção do produto e no controle do processo, medidas de posição e de variação, avaliação gráfica. Planos de amostragem na inspeção por atributo. Planejamento de experimentos: diretrizes gerais, planejamento fatorial, análise estatística; análise dos resíduos.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5057","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5742":{"codigo":"EMB5742","nome":"Materiais Metálicos para Construção Naval","ementa":"Classificação e propriedades físicas dos principais materiais metálicos empregados nos diferentes segmentos da engenharia naval: ligas ferrosas e não ferrosas. Tratamentos térmicos. Importância econômica da corrosão no setor naval. Processos de Corrosão. Controle de Corrosão. Introdução à pintura de embarcações. Camadas anticorrosivas.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5022","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5743":{"codigo":"EMB5743","nome":"Processo de Construção Naval II","ementa":"Sistemas de abastecimento de água e tratamento de esgoto. Tubulações, sistemas e componentes. Descarte de água de lastro. Bombas de porão. Mecanismos de manobra, navegação e controle de movimento. Preservação do casco. Sistemas de segurança e combate a incêndio. Estruturação do casco e costado. Sistemas de ventilação, refrigeração e isolamentos. Sistemas de ancoragem e atracação.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5744":{"codigo":"EMB5744","nome":"Materiais Compósitos Fibrados","ementa":"Tipos de resinas e sua obtenção: resina de poliéster, estervinilica, fenólica, epóxi; tipos de fibras e sua obtenção: fibra de vidro, fibra de carbono, fibra de aramida, fibras naturais. Polimerização\/Cura e técnicas de análises; Gelcoat e suas propriedades; atividade práticas de laminação manual, laminação a vácuo e laminação por infusão; Outras rotas de processamento de materiais compósitos fibrados","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5772","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5750":{"codigo":"EMB5750","nome":"Projeto de Embarcações de Serviço","ementa":"Caracterização dos tipos de rebocadores\/tratores (trabalho e salvamento) e dos tipos de embarcações de pesca oceânica comercial. Desenvolvimento projetual de embarcações destinadas à pesca oceânica comercial e de rebocadores\/tratores, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geometria de forma, estabilidade, arrasto, motorização e propulsão, bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5700 e EMB5737","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5751":{"codigo":"EMB5751","nome":"Projeto de Veleiros","ementa":"Caracterização de embarcações monocascos e multicascos movidas a vela. Desenvolvimento projetual de embarcações movidas a vela com motorização auxiliar, considerando aspectos normativos e os requisitos funcionais. Serão vistas questões relativas a geração de formas, dimensionamento estrutural, estabilidade, arrasto, mastreação, estaiamento, motorização e propulsão, dinâmica de manobras, aero e hidrodinâmica bem como a funcionalidade operacional.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5727","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5752":{"codigo":"EMB5752","nome":"Projetos de Lancha","ementa":"Mercado nacional e internacional. Geometria das Lanchas. Nomenclatura Básica e Geometria do Casco. Representação da Geometria do Casco. As Diferentes Formas do Casco. Os Principais Sistemas (Sistema de Combate a Incêndio, Controle, Propulsão,Elétrico, Navegação, Drenagem, Esgoto, Sistema de Segurança, Amarração e Fundeio, Acomodações, Água e Combustível). Tipos e Classificação das Lanchas. O Estaleiro Náutico. Cadeia de suprimentos na indústria náutica. Construção náutica (materiais e processos). Setores presentes dentro da produção de uma lancha. Testes de performance. Regulamentos, normas e órgãos do setor náutico no Brasil e no mundo.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"EMB5727","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5757":{"codigo":"EMB5757","nome":"Disciplina de Pós-Graduação p1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5758":{"codigo":"EMB5758","nome":"Disciplina de Pós-Graduação P2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5759":{"codigo":"EMB5759","nome":"Disciplina de Pós-Graduação P3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5760":{"codigo":"EMB5760","nome":"Tópicos Especiais em Ciências Navais I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5761":{"codigo":"EMB5761","nome":"Tópicos Especiais em Ciências Navais II","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5762":{"codigo":"EMB5762","nome":"Tópicos Especiaisd em Ciências Navais III","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5767":{"codigo":"EMB5767","nome":"Disciplina de Pós-Graduação N1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5768":{"codigo":"EMB5768","nome":"Disciplina de Pós-Graduação N2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5769":{"codigo":"EMB5769","nome":"Disciplina de Pós-Graduação N3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5781":{"codigo":"EMB5781","nome":"Tópicos Especiais em Transporte Marítimo I","ementa":"A disciplina não possui ementa pré-definida. O conteúdo a ser abordado versará assuntos visando o aprofundamento de temas relacionados à área de Ciências Navais.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5784":{"codigo":"EMB5784","nome":"Tópicos especiais em Construção Naval I","ementa":"A disciplina versará sobre assuntos visando o aprofundamento de temas relacionados à área de Construção Naval","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5785":{"codigo":"EMB5785","nome":"Tópicos especiais em Construção Naval II","ementa":"A disciplina versará sobre assuntos visando o aprofundamento de temas relacionados à área de Construção Naval.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5786":{"codigo":"EMB5786","nome":"Projeto final de curso II","ementa":"Consolidação dos conhecimentos obtidos no Curso com o objetivo de desenvolver a capacitação do aluno na concepção, implementação e ou avaliação de soluções em situações de diferentes áreas da engenharia.","carga_horaria":108,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5787":{"codigo":"EMB5787","nome":"Disciplina de Pós-Graduação T1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5788":{"codigo":"EMB5788","nome":"Disciplina de Pós-Graduação T2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5789":{"codigo":"EMB5789","nome":"Disciplina de Pós-Graduação T3","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo pertinente à Área de Concentração.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5792":{"codigo":"EMB5792","nome":"Disciplina de Pós-Graduação L1","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo de interesse do(a) discente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"EMB5793":{"codigo":"EMB5793","nome":"Disciplina de Pós-Graduação L2","ementa":"A disciplina não possui ementa pré-definida. Sendo passível de validação disciplina cursada em programas de pós-graduação com conteúdo de interesse do(a) discente.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":2500,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"EMB5999":{"codigo":"EMB5999","nome":"Atividades Complementares","ementa":"Atividades complementares","carga_horaria":180,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"EMB5798":{"codigo":"EMB5798","nome":"Atividades de Extensão","ementa":"Atividades de extensão","carga_horaria":432,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"}}}}}