{"codigo":101,"nome":"ENFERMAGEM","sigla_centro":"CCS","sigla_departamento":"NFR","trimestral":false,"periodo_corrente":20242,"codigos_curriculos":{"19911":19911,"19971":19971,"20041":20041,"20111":20111,"20221":20221},"situacao":0,"situacao_descricao":"regular","num_vagas_total":375,"num_vagas_primeiro_semestre":38,"num_vagas_segundo_semestre":37,"presencial":true,"curriculos":{"19911":{"id":"20","codigo":19911,"codigo_curso":101,"carga_horaria_ufsc":3625,"carga_horaria_mec":2500,"aulas_semana_min":20,"aulas_semana_esperado":26,"aulas_semana_max":34,"num_periodos_min":8,"num_periodos_esperado":8,"num_periodos_max":12,"descricao":"Referente ao curriculo 19911 (EXTINTO)","ucs":[]},"19971":{"id":"21","codigo":19971,"codigo_curso":101,"carga_horaria_ufsc":3625,"carga_horaria_mec":3553,"aulas_semana_min":20,"aulas_semana_esperado":26,"aulas_semana_max":32,"num_periodos_min":8,"num_periodos_esperado":8,"num_periodos_max":12,"descricao":"Referente ao curriculo 19971 (EXTINTO)","ucs":[]},"20041":{"id":"381","codigo":20041,"codigo_curso":101,"carga_horaria_ufsc":4860,"carga_horaria_mec":4050,"aulas_semana_min":20,"aulas_semana_esperado":26,"aulas_semana_max":32,"num_periodos_min":8,"num_periodos_esperado":8,"num_periodos_max":12,"descricao":"Referente ao currículo 20041","ucs":{"BEG5103":{"codigo":"BEG5103","nome":"Biologia Celular Básica","ementa":"Níveis de organização da estrutura biológica. Noções básicas de microscopia de luz e eletrônica. Teoria celular. Organização geral das células procarióticas e eucarióticas. Organização estrutural e funcional das células eucarióticas animais. Ciclo celular. Biogênese. Armazenamento da Informação Genética","carga_horaria":36,"fase_sugestao":1,"equivalencia":"BEG5102 e BEG5303 e BLG1230 e BLG5102","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA5124":{"codigo":"BQA5124","nome":"Bioquímica Aplicada a Enfermagem","ementa":"Importância química e biológica dos carbohidratos, lipídeos, proteínas, enzimas , vitaminas e coenzimas. Metabolismo dos carbohidratos, lipídeos e proteínas. Inter-relações e regulação metabólica do organismo. Energética Bioquímica do metabolismo.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"BQA5101 e BQA5120","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5153":{"codigo":"CFS5153","nome":"Fisiologia I","ementa":"Espectros eletromagnéticos, ultravioletas e infravermelhos. Radiobiologia: uso e higiene das radiações ionizantes e não ionizantes. Biofísica da água. Equilíbrio ácido básico. Homeostasia orgânica. Compartimentos líquidos corporais e edema. Estrutura da membrana, potenciais elétricos transmembrana. Propagação e transmissão sináptica de potenciais de ação. Junção Neuromuscular. Músculo esquelético e Músculo liso.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"CFS5100 e CFS5151 e CFS5152","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5231":{"codigo":"MOR5231","nome":"Anatomia Aplicada a Enfermagem","ementa":"Introdução ao Estudo da Anatomia Humana. Anatomia sistêmica e descritiva. Sistema tegumentar. Sistema esquelético. Sistema articular. Sistema muscular. Sistema nervoso. Sistema endócrino. Sistema circulatório. Sistema respiratório. Sistema digestório. Sistema urinário. Sistema reprodutor masculino e feminino.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"MOR5202 e MOR5230","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5317":{"codigo":"MOR5317","nome":"Histologia","ementa":"Microscopia e técnicas histológicas. Tecido epitelial de revestimento e glandular. Tecido conjuntivo,  ósseo, cartilaginoso e ossificação. Tecido muscular e nervoso.","carga_horaria":72,"fase_sugestao":1,"equivalencia":"(MOR5114 e MOR5316) ou MOR5315","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5101":{"codigo":"NFR5101","nome":"Processo de Viver Humano I","ementa":"O ser humano como ser multidimensional, em seu processo de viver histórico, social e cultural contextualizado, compreendido a partir de conceitos fundamentais e do reconhecimento das expressões e representaçãoes dos próprios indivíduos e grupos. Os diferentes espaços deste viver na sociedade, especialmente a família, a escola, o trabalho e a comunidade. O processo saúde doença como componente deste viver histórico em suas múltiplas dimensões e em sua relação com o ambiente, bem como em modos específicos de conceituação e explicação. O acadêmico na UFSC e no Curso de Enfermagem.","carga_horaria":144,"fase_sugestao":1,"equivalencia":"INT5201","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5111":{"codigo":"NFR5111","nome":"Aprendizagem Vivencial I","ementa":"Dinâmicas de autoconhecimento, desenvolvimento de autopercepção com resgate da sua própria sensibilidade, ressignificando suas emoções e vivências.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5203":{"codigo":"BEG5203","nome":"Embriologia","ementa":"Processos de gametogênese e de fecundação. Caracterização dos períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Organização morfofuncional dos anexos embrionários. Estudo de malformações e de agentes teratogênicos. Morfogênese da face e membros. Desenvolvimento normal e anormal dos sistemas tegumentar, nervoso, locomotor, cardiovascular, digestivo, respiratório, urogenital e endócrino.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"BEG5201 e BLG5201","prerequisito":"CFS5153 e MOR5231 e MOR5317","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5409":{"codigo":"BEG5409","nome":"Genética","ementa":"A enfermagem e os conhecimentos científicos atuais na área de genética humana, no seu contexto histórico, social, cultural e ético. O papel da genética humana no entendimento dos processos de saúde-doença. Doenças genéticas e doenças com componentes genéticos: etiologia, diagnóstico, tratamento, aconselhamento genético, aspectos evolutivos, aspectos éticos. Novas tecnologias em genética: repercussões na profissão de enfermagem.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"BEG5408 e BLG5404","prerequisito":"CFS5153 e MOR5231 e MOR5317","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5154":{"codigo":"CFS5154","nome":"Fisiologia II","ementa":"Funções do Sistema Nervoso Central e Periférico, Sistema Somatossensorial, Somatomotor e Autônomo, Sistema Endócrino e Reprodutor; Funções do Sistema Cardiovascular, Sistema Respiratório, Sistema Urinário e Sistema Digestório.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"CFS5151 ou CFS5100","prerequisito":"CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5103":{"codigo":"FMC5103","nome":"Farmacologia I","ementa":"Conceitos e princípios básicos em Farmacologia. Farmacocinética: Vias de administração, absorção, distribuição, metabolização e eliminação de drogas no organismo. Farmacodinâmica: mecanismo de ação de drogas no organismo (Teoria dos receptores), agonistas e antagonistas. Farmacologia do sistema nervoso autônomo: bloqueadores neuromusculares, drogas colinérgicas e adrenérgicas. Fármacos que interferem com a dor e a inflamação. Fármacos que atuam no sistema cardiovascular. Fármacos Antineoplásicos. Fármacos Antimicrobianos. Fármacos que atuam no sistema gastrointestinal;","carga_horaria":54,"fase_sugestao":2,"equivalencia":"FMC1101 e FMC5101","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5141":{"codigo":"INT5141","nome":"Processo de Viver Humano II","ementa":"Diferentes paradigmas e práticas sanitárias e os modos de intervenção sobre a saúde. As políticas de saúde em seus aspectos históricos e conceituais e o desenvolvimento das profissões de saúde nesta evolução histórica. Elementos para a compreensão do Sistema Único de Saúde e os serviços de saúde em sua configuração atual, no Brasil e em Santa Catarina. O trabahlo da enfermagem nos diferentes campos de atuação e no contexto interdisciplinar. A relação entre sistemas profissionais e não profissionais de atenção à saúde. Fundamentos da educação e sua relação com a área da saúde. As bases da epidemiologia e da informação em saúde e sua aplicação no reconhecimento da situação saúde-doença de grupos sociais e comunidades.","carga_horaria":216,"fase_sugestao":2,"equivalencia":"INT5202","prerequisito":"NFR5101","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5128":{"codigo":"MIP5128","nome":"Microbiologia","ementa":"Morfologia, fisiologia e genética das bactérias. Microbiota indígena. Antimicrobianos. Resistência bacteriana aos antibióticos. Infecções hospitalares. Características gerais dos vírus. Patogenia, isolamento, identificação, classificação, prevenção e controle das doenças infecciosas.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"MIP5110 e MIP5119","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5200":{"codigo":"MIP5200","nome":"Imunologia","ementa":"Propriedades gerais do sistema imune, tecidos e órgão linfóides, imunidade inata e adaptativa, anticorpos (estrutura e função) complemento (vias e função), interações antígeno-anticorpo, imunoensaios para fins diagnósticos, complexo principal de histocompatibilidade e apresentação de antígeno, imunidade medida por células T, citocinas, hipersensibilidades, tumores, autoimunidade, transplante, resistência e imunização às doenças infecciosas.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5311":{"codigo":"MIP5311","nome":"Parasitologia","ementa":"Sistemática em parasitologia. Estudo geral dos protozoários,  helmintos e fungos parasitas humanos e artrópodes causadores e transmissores de doenças ao homem.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"MIP5300 e MIP5301","prerequisito":"BQA5124 e CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5104":{"codigo":"FMC5104","nome":"Farmacologia aplicada à enfermagem","ementa":"Preparações farmacêuticas. Dosagens. Cálculo de dosagem. Armazenamento de drogas. Toxicidade e interações medicamentosas na clínica. Drogas usadas nas principais doenças dos sistemas: cardiovascular\/renal; respiratório; gastrointestinal; músculo-esquelético; endócrino e em doenças infecciosas.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"(FMC1101 e FMC5101) ou FMC5105","prerequisito":"FMC5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5105":{"codigo":"NFR5105","nome":"Fundamentos para o Cuidado Profissional","ementa":"O conhecimento na história humana, em especial o conhecimento e o método científico. As bases e habilidades para a ação investigativa e sua vinculação com a formação e a prática profissional. O trabalho da enfermagem em seus aspectos históricos, conformação e determinantes atuais. As concepções teóricas metodológicas do trabalho de enfermagem nas especificidades do cuidar, gerenciar e educar. O cuidado profissional de enfermagem sob o olhar de diferentes teorias e compreendido a partir de referências sociológicas, psicológicas, antropológicas e históricas. O desenvolvimento de metodologias de cuidado de enfermagem. Semiologia e semiotécnica aplicadas ao cuidado de enfermagem. O desenvolvimento de procedimentos básicos para o cuidar. A ética e a bioética como exigência interdisciplinar no trabalho em saúde","carga_horaria":378,"fase_sugestao":3,"equivalencia":"INT5121 e NFR5129 e NFR5136 e NFR5142","prerequisito":"CFS5154 e FMC5103 e INT5141 e MIP5128 e MOR5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5112":{"codigo":"NFR5112","nome":"Aprendizagem Vivencial II","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Relações interpessoais. Comunicação: fundamentos, comunicação verbal e não-verbal, barreiras da comunicação, a comunicação como instrumento terapêutico","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"NFR5111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PTL5117":{"codigo":"PTL5117","nome":"Patologia Geral","ementa":"Generalidades sobre Patologia: conceito saúde\/doença. Os grandes processos mórbidos (alterações celulares e extracelulares, distúrbios vasculares, processo \ninflamatório, distúrbios de crescimento e diferenciação)","carga_horaria":72,"fase_sugestao":3,"equivalencia":"PTL1110 e PTL5110","prerequisito":"CFS5153 e MOR5231 e MOR5317","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5106":{"codigo":"NFR5106","nome":"O Cuidado no Processo de Viver Humano I","ementa":"O cuidado de enfermagem ao adulto e idoso nas intercorrências clínicas e cirúrgicas, agudas e crônicas do processo de viver, considerando o contexto institucional e familiar, bem como o itinerário terapêutico. Planejamento, implementação e avaliação do cuidado, em ações de promoção e recuperação da saúde, com o desenvolvimento de habilidades relacionadas a este cuidado.","carga_horaria":432,"fase_sugestao":4,"equivalencia":"INT5132 e INT5133","prerequisito":"BEG5203 e BEG5409 e MIP5200 e NFR5105 e PTL5117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5113":{"codigo":"NFR5113","nome":"Aprendizagem Vivencial III","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Dilemas e conflitos gerados pelas atividades do curso. Enfrentamento de diversos limites e condições do trabalho profissional: finitude\/morte, eutanásia, doenças crônico-degenerativas. O cuidado de si \u0096 o profissional que cuida","carga_horaria":36,"fase_sugestao":4,"equivalencia":"","prerequisito":"NFR5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5161":{"codigo":"NFR5161","nome":"Estudos Interdisciplinas I - Sociedade, Saúde e Violência","ementa":"Violência na sociedade contemporânea. Diferentes tipos de violência. A cidade: violência e drogas. Relação entre exclusão, violência e drogas.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"NFR5160","prerequisito":"INT5141","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5107":{"codigo":"NFR5107","nome":"O Cuidado no Processo de Viver Humano II","ementa":"O cuidado da enfermagem no contexto das políticas de atenção à saúde da criança, do adolescente, da mulher e da família. A compreensão do nascimento como processo individual e social e o cuidado de enfermagem à família neste processo. O cuidado à criança, adolescente e sua família no processo de viver, nas intercorrências clínicas e cirúrgicas agudas, prolongadas e crônicas, no contexto da atenção básica, domiciliar e hospitalar, em ações de promoção e prevenção de intercorrências e recuperação da saúde. O cuidado integral à mulher na atenção básica, domiciliar e hospitalar, em sua saúde reprodutiva.","carga_horaria":450,"fase_sugestao":5,"equivalencia":"INT5131 e INT5132 e INT5133 e NFR5306","prerequisito":"NFR5106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5162":{"codigo":"NFR5162","nome":"Estudos Interdisciplinas II - Terapias Complementares","ementa":"Medicina tradicional chinesa. Princípios da medicina ayurvédica e antroposófica. Principais alternativas terapêuticas: homeopatia, acupuntura, reflexologia, fitoterapia, geoterapia, essências florais, aromaterapia, musicoterapia, cromoterapia, toque terapêutico, medicina oriental preventiva, massagens terapêuticas, métodos populares de tratamento e cura.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"NFR1137 ou NFR5137","prerequisito":"NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5163":{"codigo":"NFR5163","nome":"Estudos Interdisciplinas III - Corpo, Gênero e Sexualidade","ementa":"O Corpo: dos gregos até a era pó-moderna; história da sexualidade; da diferença sexual ao paradigma de gênero; gênero e sexualidade; aspectos multidimensionais da sexualidade humana; Sexualidades: construção do paradigma heterossexual, homossexualidade, travestismo; Resposta sexual humana, disfunções sexuais, noções de aconcelhamento sexual na consulta de enfermagem.","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"NFR5106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5145":{"codigo":"INT5145","nome":"O Cuidado no Processo de Viver Humano III","ementa":"Sistema Único de Saúde em seus modelos de gestão e assistência. A epidemiologia como base para o processo de planejamento local de saúde. O processo de distritalização da saúde. Atenção básica à saúde do indivíduo, família e comunidade. A educação popular e saúde e o controle social. Saúde mental e reforma psiquiátrica. O cuidado ao indivíduo, família e comunidade em ações de promoção, e recuperação da saúde mental.","carga_horaria":432,"fase_sugestao":6,"equivalencia":"(INT5131 e INT5132 e NFR5212) ou INT5207","prerequisito":"NFR5107","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5164":{"codigo":"NFR5164","nome":"Estudos Interdisciplinas IV - O Fenômeno das Drogas","ementa":"Globalização e o fenômeno da violência e das drogas. Políticas sociais no campo da violência e drogas: internacional, nacional. Fatores relacionados ao consumo de drogas. Estereótipos, imagens e respostas sociais frente ao fenômeno das drogas. Drogas mais utilizadas no nosso meio. Uso\/abuso de drogas. Segurança e drogas no campus.","carga_horaria":36,"fase_sugestao":6,"equivalencia":"","prerequisito":"NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5146":{"codigo":"INT5146","nome":"Gestão e Gerenciamento em Saúde e Enfermagem","ementa":"Os fundamentos teórico-filosóficos e metodológicos da administração. Desenvolvimento de ações de planejamento em saúde e enfermagem a partir do entendimento de seus diferentes enfoques. Estrutura diretiva e organizativa dos serviços de saúde e enfermagem. Gestão e gerenciamento de recursos humanos, físicos e ambientais, materiais, financeiros, de informação e comunicação e de assistência nos serviços de saúde e na enfermagem. O processo investigativo em administração da saúde e enfermagem.","carga_horaria":90,"fase_sugestao":7,"equivalencia":"(INT5120 e INT5132 e INT5133) ou INT5208","prerequisito":"INT5145","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5161":{"codigo":"INT5161","nome":"Estágio Supervisionado I","ementa":"GESTÃO E GERENCIAMENTO EM SAÚDE E ENFERMAGEM: Préticas de gestão e gerenciamento em saúde e enfermagem. -CUIDADO DE ENFERMAGEM AO INDIVÍDUO ADULTO EM CONDIÇÃO CRÍTICA DE SAÚDE: Planejamento, execução e avaliação de projetos para cuidado de enfermagem a indivíduos, adulto e família em condição crítica de saúde.","carga_horaria":324,"fase_sugestao":7,"equivalencia":"INT5208","prerequisito":"INT5141 e INT5145 e NFR5101 e NFR5105 e NFR5106 e NFR5107","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5165":{"codigo":"NFR5165","nome":"O Cuidado de Enfermagem ao Indivíduo Adulto em condição Critica de Saúde","ementa":"O cuidado intensivo e de emergência do indivíduo adulto e idoso em condição crítica de saúde e sua família. Condições críticas de saúde. Objetivos e características do cuidado de emergência e intensivo. Aspectos éticos vinculados ao cuidado ao adulto e idoso em condição crítica de saúde e sua família. O processo investigativo em condição crítica de saúde.","carga_horaria":126,"fase_sugestao":7,"equivalencia":"INT5133","prerequisito":"INT5141 e INT5145 e NFR5101 e NFR5105 e NFR5106 e NFR5107","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5166":{"codigo":"NFR5166","nome":"Elaboração de Projetos Assistenciais","ementa":"Elementos e etapas para a proposição e desenvolvimento de projetos para o cuidado no processo de viver humano, em sua articulação e impacto no contexto social. A produção de conhecimentos nos diferentes cenários assistenciais. Tendências atuais da prática das diversas profissões da área da saúde, em especial da enfermagem, no contexto técnico, ético, político e social do Brasil.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"NFR5175 ou NFR5412","prerequisito":"INT5145","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5162":{"codigo":"INT5162","nome":"Estágio Supervisionado II","ementa":"Planejamento, execução e avaliação de projetos para cuidado de enfermagem no processo de viver humano, a indivíduos, famílias, grupos e comunidades, nos diferentes cenários do trabalho de enfermagem. Desenvolvimento de projeto sob orientação de um docente, com supervisão de um profissional enfermeiro que atua na instituição escolhida para a atividade de estágio.","carga_horaria":504,"fase_sugestao":8,"equivalencia":"INT5212 e NFR5182","prerequisito":"INT5146 e NFR5165 e NFR5166","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5213":{"codigo":"MIP5213","nome":"Virologia Básica e Clínica","ementa":"Introdução aos vírus, suas naturezas, estruturas, genética e classificação; principais eventos envolvidos na replicação viral: principais estratégias de replicação dos vírus de genoma DNA e RNA; vírus que causam câncer e os mecanismos utilizados para este fim (polioma, herpes, papiloma, hepatite, adenovírus); vírus de RNA que causam câncer (retrovírus); biologia do HIV; medicamentos com ação antiviral; vírus de genoma RNA de transmissão fecal-oral causadores de infecções, incluindo norovírus, rotavírus, astrovírus, enterovírus, vírus da hepatite A e E; vírus do trato respiratório superior (rinovírus) e vírus da síndrome respiratória aguda (SARS). Estrutura dos vírus herpéticos: as doenças causadas pelos vírus herpes simplex tipos 1 e 2, citomegalovírus, vírus da varicella zoster, vírus Epstein-barr e outros vírus herpéticos; defesas específicas e não específicas do hospedeiro envolvidas na resistência e na recuperação das infecções virais; estrutura e propriedades dos vírus do sarampo, caxumba, influenza e rubéola: patogênese e doença, prevenção e tratamento; estrutura e replicação dos vírus causadores das hepatites B e C; rabdovírus e raiva; arbovírus e hantavírus causadores de encefalites febris, hemorrágicas; doenças hemorrágicas com síndromes renal e pulmonar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5167":{"codigo":"NFR5167","nome":"Plantas Medicinais nas Práticas de Saúde","ementa":"As plantas medicinais na história do cuidado humano. O rito do chá. Plantas medicinais e o meio ambiente. Espécies do repertório popular. Cuidados com o cultivo, coleta, secagem, acondicionamento e preparação populares. Noções sobre substâncias bioativas. Interações planta\/medicamento e plantas tóxicas. Legislação que regulamenta o uso de plantas medicinais e políticas públicas para implementações de farmácias vivas","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5168":{"codigo":"NFR5168","nome":"Terapias Corporais","ementa":"O corpo como espelho da mente. Principais tiposde massagens terapêuticas. A dança como técnica de equilíbrio mente-corpo; relaxamento físico-mental; terapia reflexológica; artes marciais e yoga.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5169":{"codigo":"NFR5169","nome":"Mercado de Trabalho em Enfermagem e Novas Modalidades de Prestação de Serviço","ementa":"Fundamentos teóricos e metodológicos sobre estudos e pesquisas de mercado de trabalho. O mercado de Trabalho na Enfermagem e na Saúde. Caracterização de serviços e novas modalidades de organização dos serviços em saúde e enfermagem. Noções de empreendedorismo em saúde. Noções de custos em Saúde. As cooperativas em saúde. As seguradoras em saúde. Controle financeiro e da qualidade da prestação dos serviços de saúde. Aspectos legais e organizacionais de projetos de criação e implementação de uma empresa prestadora de serviços.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5171":{"codigo":"NFR5171","nome":"Informática em Enfermagem I","ementa":"Conceitos básicos de informática (definições, terminologia,  medidas de memória,  periféricos e sotware); introdução ao uso do ambiente Windows® e de softwares livres (reconhecimento e utilização do ambiente); softwares mais utilizados (editor de textos; apresentações gráficas, planilha, banco de dados); noções básicas de utilização da Internet ( browser de navegação, ferramentas de pesquisa, construção de home-pages). Sistemas Nacionais de Informação em Saúde.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5172":{"codigo":"NFR5172","nome":"Informática em Enfermagem II","ementa":"Integração entre os saberes da área de conhecimento da informática e enfermagem. Conceitos básicos que caracterizam o uso da informática como uma ferramenta no trabalho do enfermeiro na assistência, no ensino, na pesquisa e na administração","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5307":{"codigo":"NFR5307","nome":"Enfermagem Gerontogeriatrica","ementa":"O processo de envelhecimento humano no contexto da transição demográfica \/epidemiológica e suas consequências para a sociedade. Fundamentação Gerontogeriátrica. Aspectos bio-psicossocial cultural do envelhecimento humano. A especificidade da assistência de enfermagem gerontogeriátrica. Políticas públicas de saúde, serviços, programas e tecnologias para a assistência ao idoso e sua família no contexto comunitário e institucional.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5308":{"codigo":"NFR5308","nome":"Enfermagem em Oncologia","ementa":"Considerações gerais em oncologia; Epidemiologia; Prevenção, promoção, tratamento, reabilitação e cuidados de enfermagem na atenção oncológica. Políticas de saúde. O cuidado ao cliente adulto e pediátrico e família no contexto da oncologia. Cuidando do cuidador em oncologia. Os sobreviventes em oncologia","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5106","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5421":{"codigo":"NFR5421","nome":"Atividade Extracurricular: Monitoria","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5422":{"codigo":"NFR5422","nome":"Atividade Extracurricular: Estágio","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5423":{"codigo":"NFR5423","nome":"Programa de Intercâmbio I","ementa":"Participação em programa de Intercâmbio Acadêmico decorrente de convênio assinado com Instituições de Ensino Superior, Agências de Fometo, Centros de Pesquisa, e instituições semelhantes, visando a realização de atividades acadêmicas como cursos, estágios  e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5424":{"codigo":"NFR5424","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programa de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5423","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5428":{"codigo":"NFR5428","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5424","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}},"20111":{"id":"330","codigo":20111,"codigo_curso":101,"carga_horaria_ufsc":4980,"carga_horaria_mec":4150,"aulas_semana_min":20,"aulas_semana_esperado":26,"aulas_semana_max":32,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":14,"descricao":"Referente ao currículo 20111","ucs":{"BEG5303":{"codigo":"BEG5303","nome":"Biologia Celular Básica","ementa":"Níveis de organização da estrutura biológica. Noções básicas de microscopia de luz e eletrônica. Teoria celular. Organização geral das células procarióticas e eucarióticas. Organização estrutural e funcional das células eucarióticas animais. Ciclo celular.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"AGC7101 ou BEG5101 ou BEG5103 ou BEG5109 ou BEG7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA5124":{"codigo":"BQA5124","nome":"Bioquímica Aplicada a Enfermagem","ementa":"Importância química e biológica dos carbohidratos, lipídeos, proteínas, enzimas , vitaminas e coenzimas. Metabolismo dos carbohidratos, lipídeos e proteínas. Inter-relações e regulação metabólica do organismo. Energética Bioquímica do metabolismo.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"BQA5114 ou CBV7104","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5153":{"codigo":"CFS5153","nome":"Fisiologia I","ementa":"Espectros eletromagnéticos, ultravioletas e infravermelhos. Radiobiologia: uso e higiene das radiações ionizantes e não ionizantes. Biofísica da água. Equilíbrio ácido básico. Homeostasia orgânica. Compartimentos líquidos corporais e edema. Estrutura da membrana, potenciais elétricos transmembrana. Propagação e transmissão sináptica de potenciais de ação. Junção Neuromuscular. Músculo esquelético e Músculo liso.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5201":{"codigo":"INT5201","nome":"Processo de Viver Humano I - Sociedade, Ambiente e Saúde","ementa":"O ser humano como ser multidimensional, em seu processo de viver histórico, social e culturalmente contextualizado, compreendido a partir de conceitos fundamentais e do reconhecimento das expressões e representações dos próprios indivíduos, grupos, raças e etnias. Os diferentes espaços deste viver na sociedade, especialmente a família, a escola, o trabalho e a comunidade. Determinação sócio ambiental e cultural do processo de viver humano. O processo saúde doença como componente deste viver histórico em suas múltiplas dimensões e em sua relação com o ambiente, raça, cultura e etnia, bem como em modos específicos de compreensão e explicação. O acadêmico na UFSC e no Curso de Enfermagem;","carga_horaria":144,"fase_sugestao":1,"equivalencia":"INT5221 ou NFR5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5231":{"codigo":"MOR5231","nome":"Anatomia Aplicada a Enfermagem","ementa":"Introdução ao Estudo da Anatomia Humana. Anatomia sistêmica e descritiva. Sistema tegumentar. Sistema esquelético. Sistema articular. Sistema muscular. Sistema nervoso. Sistema endócrino. Sistema circulatório. Sistema respiratório. Sistema digestório. Sistema urinário. Sistema reprodutor masculino e feminino.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5315":{"codigo":"MOR5315","nome":"Histologia","ementa":"Noções Básicas sobre Técnicas Histológicas de Rotina. Tipos de Tecidos Fundamentais. Estrutura e Funções Básicas dos Tecidos: Epitelial, Conjuntivo, Ósseo, Sangüíneo, Muscular e Nervoso, Processos de Ossificação. Histofisiologia dos Sistemas: Circulatório, Linfático, Digestório, Respiratório, Urinário, Endócrino, Reprodutor Masculino e Feminino.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"(CBV7604 e CBV7605) ou MOR5317","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5111":{"codigo":"NFR5111","nome":"Aprendizagem Vivencial I","ementa":"Dinâmicas de autoconhecimento, desenvolvimento de autopercepção com resgate da sua própria sensibilidade, ressignificando suas emoções e vivências.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5154":{"codigo":"CFS5154","nome":"Fisiologia II","ementa":"Funções do Sistema Nervoso Central e Periférico, Sistema Somatossensorial, Somatomotor e Autônomo, Sistema Endócrino e Reprodutor; Funções do Sistema Cardiovascular, Sistema Respiratório, Sistema Urinário e Sistema Digestório.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5103":{"codigo":"FMC5103","nome":"Farmacologia I","ementa":"Conceitos e princípios básicos em Farmacologia. Farmacocinética: Vias de administração, absorção, distribuição, metabolização e eliminação de drogas no organismo. Farmacodinâmica: mecanismo de ação de drogas no organismo (Teoria dos receptores), agonistas e antagonistas. Farmacologia do sistema nervoso autônomo: bloqueadores neuromusculares, drogas colinérgicas e adrenérgicas. Fármacos que interferem com a dor e a inflamação. Fármacos que atuam no sistema cardiovascular. Fármacos Antineoplásicos. Fármacos Antimicrobianos. Fármacos que atuam no sistema gastrointestinal;","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124 e CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5202":{"codigo":"INT5202","nome":"Processo de Viver Humano II - As Práticas de Saúde","ementa":"Elementos para a compreensão das políticas de saúde em seus aspectos históricos e conceituais e para o desenvolvimentodas profissões de saúde nesta evolução e histórica. Elementos para a compreensão do Sistema Único de Saúde e os serviços de saúde em sua configuração atual, no Brasil e em Santa Catarina. O trabalho da  \nenfermagem nos diferentes campos de atuação e no contexto interdisciplinar. Diferentes paradigmas modos de intervenção sobre a saúde: a relação entre sistemas profissionais e não profissionais de atenção à saúde; fundamentos da educação e sua relação com a área da saúde; as bases da epidemiologia e da informação em saúde e sua aplicação no reconhecimento da situação de saúde-doença de grupos etnico-raciais, sociais e comunidade. Educação em saúde, educação ambiental, educação para as relações etnico-raciais","carga_horaria":216,"fase_sugestao":2,"equivalencia":"INT5141 ou INT5222","prerequisito":"INT5201 ou INT5221","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5128":{"codigo":"MIP5128","nome":"Microbiologia","ementa":"Morfologia, fisiologia e genética das bactérias. Microbiota indígena. Antimicrobianos. Resistência bacteriana aos antibióticos. Infecções hospitalares. Características gerais dos vírus. Patogenia, isolamento, identificação, classificação, prevenção e controle das doenças infecciosas.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5200":{"codigo":"MIP5200","nome":"Imunologia","ementa":"Propriedades gerais do sistema imune, tecidos e órgão linfóides, imunidade inata e adaptativa, anticorpos (estrutura e função) complemento (vias e função), interações antígeno-anticorpo, imunoensaios para fins diagnósticos, complexo principal de histocompatibilidade e apresentação de antígeno, imunidade medida por células T, citocinas, hipersensibilidades, tumores, autoimunidade, transplante, resistência e imunização às doenças infecciosas.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5311":{"codigo":"MIP5311","nome":"Parasitologia","ementa":"Sistemática em parasitologia. Estudo geral dos protozoários,  helmintos e fungos parasitas humanos e artrópodes causadores e transmissores de doenças ao homem.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124 e CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5409":{"codigo":"BEG5409","nome":"Genética","ementa":"A enfermagem e os conhecimentos científicos atuais na área de genética humana, no seu contexto histórico, social, cultural e ético. O papel da genética humana no entendimento dos processos de saúde-doença. Doenças genéticas e doenças com componentes genéticos: etiologia, diagnóstico, tratamento, aconselhamento genético, aspectos evolutivos, aspectos éticos. Novas tecnologias em genética: repercussões na profissão de enfermagem.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"FIT5303","prerequisito":"CFS5153 e MOR5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5105":{"codigo":"FMC5105","nome":"Farmacologia II","ementa":": Discutir, de forma aplicada ao uso clínico e suas implicações para o cuidado de enfermagem, a farmacologia dos medicamentos utilizados para tratamento dos principais problemas de saúde, considerando as ações e efeitos e implicações (efeitos colaterais, indesejados e tóxicos)relacionadas a escolha ou contra-indicações de fármacos para o tratamento do idoso, da criança, do lactante e da gestante; fármacos utilizados nas dislipidemias; antiparasitários e antivirais; tratamento do diabetes mellitus com insulina e hipoglicemiantes orais e injetáveis; fármacos usados no hipo- e hiper-tireoidismo; agentes contraceptivos e sistema reprodutivo; fármacos que atuam no sistema nervoso central (ansiolíticos, antidepressivos, anticonvulsivantes, hipnosedativos, substâncias usadas em doenças neurodegenerativas e distúrbios psiquiátricos, anestésicos gerais, relaxantes musculares e analgésicos opióides)","carga_horaria":36,"fase_sugestao":3,"equivalencia":"FMC5104","prerequisito":"FMC5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5105":{"codigo":"NFR5105","nome":"Fundamentos para o Cuidado Profissional","ementa":"O conhecimento na história humana, em especial o conhecimento e o método científico. As bases e habilidades para a ação investigativa e sua vinculação com a formação e a prática profissional. O trabalho da enfermagem em seus aspectos históricos, conformação e determinantes atuais. As concepções teóricas metodológicas do trabalho de enfermagem nas especificidades do cuidar, gerenciar e educar. O cuidado profissional de enfermagem sob o olhar de diferentes teorias e compreendido a partir de referências sociológicas, psicológicas, antropológicas e históricas. O desenvolvimento de metodologias de cuidado de enfermagem. Semiologia e semiotécnica aplicadas ao cuidado de enfermagem. O desenvolvimento de procedimentos básicos para o cuidar. A ética e a bioética como exigência interdisciplinar no trabalho em saúde","carga_horaria":378,"fase_sugestao":3,"equivalencia":"NFR5102","prerequisito":"(CFS5154 e FMC5103 e MIP5128 e MOR5231) e (INT5202 ou INT5222)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5112":{"codigo":"NFR5112","nome":"Aprendizagem Vivencial II","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Relações interpessoais. Comunicação: fundamentos, comunicação verbal e não-verbal, barreiras da comunicação, a comunicação como instrumento terapêutico","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"NFR5111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5203":{"codigo":"BEG5203","nome":"Embriologia","ementa":"Processos de gametogênese e de fecundação. Caracterização dos períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Organização morfofuncional dos anexos embrionários. Estudo de malformações e de agentes teratogênicos. Morfogênese da face e membros. Desenvolvimento normal e anormal dos sistemas tegumentar, nervoso, locomotor, cardiovascular, digestivo, respiratório, urogenital e endócrino.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"","prerequisito":"CFS5153 e MOR5231 e MOR5315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5203":{"codigo":"INT5203","nome":"O Cuidado no Processo de Viver Humano I - Condição Clínica de Saúde","ementa":"O cuidado de Enfermagem ao cliente adulto e idoso nas intercorrências clínicas, agudas e crônicas do processo de viver, considerando o contexto institucional, familiar e o itinerário terapêutico. Planejamento, implementação e avaliação do cuidado, em ações de promoção e recuperação da saúde,  \ncom o desenvolvimento de habilidades relacionadas a este cuidado","carga_horaria":252,"fase_sugestao":4,"equivalencia":"INT5223 ou NFR5106","prerequisito":"NFR5102 ou NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5160":{"codigo":"NFR5160","nome":"Sociedade, Saúde e Violência","ementa":"Direitos humanos e saúde. Expressões da violência na sociedade: cultura, gênero, raça e etnia. Repercussões da violência na saúde, na vida cotidiana. Necessidades e possibilidades de intervenção profissional nos casos de violência","carga_horaria":36,"fase_sugestao":4,"equivalencia":"NFR5161","prerequisito":"INT5202","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5170":{"codigo":"NFR5170","nome":"Informática em Saúde","ementa":"Informática aplicada ao cuidado e a educação em saúde e enfermagem. Tecnologias emergentes aplicadas à Enfermagem. Sistemas Nacionais de Informação em Saúde e avaliação da informação. Padrões da Informação","carga_horaria":36,"fase_sugestao":4,"equivalencia":"NFR5171","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PTL5117":{"codigo":"PTL5117","nome":"Patologia Geral","ementa":"Generalidades sobre Patologia: conceito saúde\/doença. Os grandes processos mórbidos (alterações celulares e extracelulares, distúrbios vasculares, processo \ninflamatório, distúrbios de crescimento e diferenciação)","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"CFS5153 e MOR5231 e MOR5315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5204":{"codigo":"INT5204","nome":"O Cuidado no Processo de Viver Humano II - Condição Cirúrgica de Saúde","ementa":"O cuidado de enfermagem ao adulto e idoso nas intercorrências cirúrgicas, agudas e crônicas do processo de viver considerando o contexto institucional e familiar, bem como o itinerário terapêutico como o desenvolvimento de habilidades relacionadas a este cuidado. Sistematização da assistência de enfermagem em ações de promoção, recuperação e reabilitação da saúde. Aspectos éticos e bioéticos no cuidado a pessoas em condição cirúrgica. Segurança do paciente","carga_horaria":216,"fase_sugestao":5,"equivalencia":"INT5224 ou NFR5106","prerequisito":"INT5203 ou INT5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5205":{"codigo":"INT5205","nome":"O Cuidado no Processo de Viver Humano III - Condição Crítica de Saúde","ementa":"O cuidado de enfermagem ao adulto e idoso em condição grave de saúde, considerando o contexto institucional e familiar, em ambiente pré-hospitalar, de emergência e intensivo. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":216,"fase_sugestao":5,"equivalencia":"INT5225","prerequisito":"(INT5203 ou INT5223) e PTL5117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5113":{"codigo":"NFR5113","nome":"Aprendizagem Vivencial III","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Dilemas e conflitos gerados pelas atividades do curso. Enfrentamento de diversos limites e condições do trabalho profissional: finitude\/morte, eutanásia, doenças crônico-degenerativas. O cuidado de si \u0096 o profissional que cuida","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"NFR5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5206":{"codigo":"INT5206","nome":"O Cuidado no Processo de Viver Humano IV - Saúde da Mulher, do Neonato, da Criança e do Adolescente","ementa":"O cuidado de Enfermagem no contexto das políticas de atenção à saúde da criança, do adolescente, da mulher e da família, incluindo as perspectivas étnico-raciais e de gênero. A compreensão do nascimento como processo individual e social e o cuidado de enfermagem à família neste processo. O cuidado à criança, adolescente e sua família no processo de viver nas intercorrências clínicas agudas, prolongadas e crônicas, no contexto da atenção básica domiciliar e hospitalar, em ações de promoção, prevenção das intercorrências e recuperação da saúde. Ocuidado integral à mulher na atenção básica, domiciliar e hospitalar, em sua saúde reprodutiva. Ética e  \nbioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":432,"fase_sugestao":6,"equivalencia":"INT5226 ou NFR5107","prerequisito":"(INT5203 ou INT5223) e (INT5204 ou INT5224) e (INT5205 ou INT5225)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5173":{"codigo":"NFR5173","nome":"Corpo Gênero e Sexualidade","ementa":"O Corpo: dos gregos até a era pós-moderna; corpo e miscigenação no Brasil; História da Sexualidade; Da diferença sexual ao paradigma de gênero; Gênero e Sexualidade; Aspectos Multidimensionais da Sexualidade humana; Sexualidades: Construção do paradigma heterossexual, homossexualidade, Noções de aconselhamento sexual na consulta de Enfermagem","carga_horaria":36,"fase_sugestao":6,"equivalencia":"NFR5163","prerequisito":"INT5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5207":{"codigo":"INT5207","nome":"O Cuidado no Processo de Viver Humano V - Atenção Básica e Saúde Mental","ementa":"O Sistema Único de Saúde em seus modelos de gestão e assistência. A epidemiologia como base para o processo de planejamento local de saúde. O processo de distritalização da saúde. Determinação socioambiental e cultural do processo saúde-doença. Atenção Básica à saúde do indivíduo, família e comunidade considerando os aspectos étnicos-raciais e as questões dos direitos humanos. A educação popular e saúde e o controle social. Saúde mental e reforma psiquiátrica. O cuidado ao indivíduo, família e comunidade em ações de promoção e recuperação da saúde mental. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":432,"fase_sugestao":7,"equivalencia":"(INT5131 e INT5132) e (INT5145 ou INT5227)","prerequisito":"INT5206 ou INT5226","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5174":{"codigo":"NFR5174","nome":"Fenômeno Drogas","ementa":"Direitos humanos e saúde. Globalização e o fenômeno da violência e das drogas. Políticas sociais no campo da violência e drogas: internacional e nacional. Fatores relacionados ao consumo de drogas. Estereótipos, imagens e respostas sociais frente ao fenômeno das drogas. Drogas mais utilizadas em nosso meio. Uso e abuso de drogas. Álcool e comunidades indígenas. Segurança e drogas no campus.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"NFR5164","prerequisito":"NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5208":{"codigo":"INT5208","nome":"Gestão em Saúde e Enfermagem\/Estágio Supervisionado","ementa":"Fundamentos teórico-filosóficos da gestão\/administração e aplicação na organização da enfermagem e saúde. A gestão no contexto do SUS e no setor privado. O planejamento, a organização, a liderança e a avaliação em enfermagem e saúde. Gestão de sistemas e de organizações e gerência de unidades e serviços de enfermagem e saúde nos diferentes níveis de complexidade. Gestão de recursos e do processo de trabalho em enfermagem e saúde. A construção de modelos e processos gerenciais em enfermagem. Práticas inovadoras em gerência de enfermagem. O processo investigativo em administração da saúde e enfermagem","carga_horaria":414,"fase_sugestao":8,"equivalencia":"(INT5120 e INT5132 e INT5133 e INT5146) ou INT5228","prerequisito":"INT5207 ou INT5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5175":{"codigo":"NFR5175","nome":"Projetos de Investigação e Intervenção","ementa":"Elementos e etapas para a proposição e desenvolvimento de projetos de pesquisa e\/ou intervenção. A produção de conhecimentos e suas tendências atuais na área da saúde, em especial da enfermagem, no contexto técnico, ético, político e social do Brasil nos diferentes cenários assistenciais.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"NFR5166 e NFR5412","prerequisito":"INT5207","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5211":{"codigo":"INT5211","nome":"Estágio Supervisionado I","ementa":"Planejamento, execução e avaliação de projeto assistencial envolvendo as dimensões do cuidado, gerência e educação em enfermagem no processo de  \nviver humano, a indivíduos, famílias, grupos e comunidades, sob orientação de um docente, comsupervisão do enfermeiro em Instituição de atenção básica. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Segurança do paciente","carga_horaria":486,"fase_sugestao":9,"equivalencia":"INT5161","prerequisito":"BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5201 e INT5202 e INT5203 e INT5204 e INT5205 e INT5206 e INT5207 e INT5208 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5105 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5181":{"codigo":"NFR5181","nome":"Trabalho de Conclusão de Curso I","ementa":"Desenvolvimento de projetos de pesquisa e\/ou intervenção: coleta e análise de dados..","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5201 e INT5202 e INT5203 e INT5204 e INT5205 e INT5206 e INT5207 e INT5208 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5105 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5212":{"codigo":"INT5212","nome":"Estágio Supervisionado II","ementa":"Planejamento, execução e avaliação de plano de atividades envolvendo as dimensões do cuidado, gerência e educação em enfermagem no processo de  \nviver humano, a indivíduos, famílias, grupos e comunidades, sob orientação de um docente, com supervisão de enfermeiros em instituição conveniada hospitalar. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":486,"fase_sugestao":10,"equivalencia":"INT5162","prerequisito":"INT5211 e NFR5181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5182":{"codigo":"NFR5182","nome":"Trabalho de Conclusão de Curso II","ementa":"Desenvolvimento de projetos de pesquisa e\/ou intervenções: elaboração de relatório final e divulgação dos resultados.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"","prerequisito":"NFR5181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LSB7904","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"MIP5213":{"codigo":"MIP5213","nome":"Virologia Básica e Clínica","ementa":"Introdução aos vírus, suas naturezas, estruturas, genética e classificação; principais eventos envolvidos na replicação viral: principais estratégias de replicação dos vírus de genoma DNA e RNA; vírus que causam câncer e os mecanismos utilizados para este fim (polioma, herpes, papiloma, hepatite, adenovírus); vírus de RNA que causam câncer (retrovírus); biologia do HIV; medicamentos com ação antiviral; vírus de genoma RNA de transmissão fecal-oral causadores de infecções, incluindo norovírus, rotavírus, astrovírus, enterovírus, vírus da hepatite A e E; vírus do trato respiratório superior (rinovírus) e vírus da síndrome respiratória aguda (SARS). Estrutura dos vírus herpéticos: as doenças causadas pelos vírus herpes simplex tipos 1 e 2, citomegalovírus, vírus da varicella zoster, vírus Epstein-barr e outros vírus herpéticos; defesas específicas e não específicas do hospedeiro envolvidas na resistência e na recuperação das infecções virais; estrutura e propriedades dos vírus do sarampo, caxumba, influenza e rubéola: patogênese e doença, prevenção e tratamento; estrutura e replicação dos vírus causadores das hepatites B e C; rabdovírus e raiva; arbovírus e hantavírus causadores de encefalites febris, hemorrágicas; doenças hemorrágicas com síndromes renal e pulmonar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"MIP9108":{"codigo":"MIP9108","nome":"Diagnóstico Imuno-Molecular em Parasitologia","ementa":"Estudo de métodos indiretos de diagnóstico de parasitoses. Coleta, preparação e conservação do material biológico. Aplicação de técnicas imunológicas e moleculares para o diagnóstico de parasitos de importância para humanos e veterinária.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"MIP5311","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5128":{"codigo":"NFR5128","nome":"Enfermagem em Primeiros Socorros","ementa":"Princípios gerais de primeiros socorros. Medidas de acidentes. Ações imediatas e mediatas do socorrista em situações de emergência e\/ou urgência. Primeiros socorros em situações de emergência e\/ou urgência.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5167":{"codigo":"NFR5167","nome":"Plantas Medicinais nas Práticas de Saúde","ementa":"As plantas medicinais na história do cuidado humano. O rito do chá. Plantas medicinais e o meio ambiente. Espécies do repertório popular. Cuidados com o cultivo, coleta, secagem, acondicionamento e preparação populares. Noções sobre substâncias bioativas. Interações planta\/medicamento e plantas tóxicas. Legislação que regulamenta o uso de plantas medicinais e políticas públicas para implementações de farmácias vivas","carga_horaria":36,"fase_sugestao":999,"equivalencia":"SPB7010","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5168":{"codigo":"NFR5168","nome":"Terapias Corporais","ementa":"O corpo como espelho da mente. Principais tiposde massagens terapêuticas. A dança como técnica de equilíbrio mente-corpo; relaxamento físico-mental; terapia reflexológica; artes marciais e yoga.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5169":{"codigo":"NFR5169","nome":"Mercado de Trabalho em Enfermagem e Novas Modalidades de Prestação de Serviço","ementa":"Fundamentos teóricos e metodológicos sobre estudos e pesquisas de mercado de trabalho. O mercado de Trabalho na Enfermagem e na Saúde. Caracterização de serviços e novas modalidades de organização dos serviços em saúde e enfermagem. Noções de empreendedorismo em saúde. Noções de custos em Saúde. As cooperativas em saúde. As seguradoras em saúde. Controle financeiro e da qualidade da prestação dos serviços de saúde. Aspectos legais e organizacionais de projetos de criação e implementação de uma empresa prestadora de serviços.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5307":{"codigo":"NFR5307","nome":"Enfermagem Gerontogeriatrica","ementa":"O processo de envelhecimento humano no contexto da transição demográfica \/epidemiológica e suas consequências para a sociedade. Fundamentação Gerontogeriátrica. Aspectos bio-psicossocial cultural do envelhecimento humano. A especificidade da assistência de enfermagem gerontogeriátrica. Políticas públicas de saúde, serviços, programas e tecnologias para a assistência ao idoso e sua família no contexto comunitário e institucional.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5308":{"codigo":"NFR5308","nome":"Enfermagem em Oncologia","ementa":"Considerações gerais em oncologia; Epidemiologia; Prevenção, promoção, tratamento, reabilitação e cuidados de enfermagem na atenção oncológica. Políticas de saúde. O cuidado ao cliente adulto e pediátrico e família no contexto da oncologia. Cuidando do cuidador em oncologia. Os sobreviventes em oncologia","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"INT5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5423":{"codigo":"NFR5423","nome":"Programa de Intercâmbio I","ementa":"Participação em programa de Intercâmbio Acadêmico decorrente de convênio assinado com Instituições de Ensino Superior, Agências de Fometo, Centros de Pesquisa, e instituições semelhantes, visando a realização de atividades acadêmicas como cursos, estágios  e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5424":{"codigo":"NFR5424","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programa de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5423","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5428":{"codigo":"NFR5428","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5424","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR7005":{"codigo":"NFR7005","nome":"Enfermagem Dermatológica","ementa":"Bases teóricas e práticas para o cuidado com a pele, no adulto e idoso em condição \ncrônica. Aprimoramento do conhecimento do estudante de graduação em enfermagem \npara a assistência à pessoa considerando a prevenção de lesões, os cuidados na \nrecuperação tecidual e a reabilitação nos distintos espaços da rede de atenção do Sistema \nÚnico de Saúde (SUS), tendo como base a aplicação do conhecimento para a utilização \nde tecnologias leve e duras. Discussão de aspectos éticos no cuidado, na documentação \nfotográfica e divulgação\/utilização dessas informações. Aplicação das etapas do processo \nde enfermagem na prevenção, recuperação tecidual e reabilitação da pele humana.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"INT5203","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5429":{"codigo":"NFR5429","nome":"Atividades Complementares","ementa":"","carga_horaria":120,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"}}},"20221":{"id":"648","codigo":20221,"codigo_curso":101,"carga_horaria_ufsc":4980,"carga_horaria_mec":4150,"aulas_semana_min":20,"aulas_semana_esperado":26,"aulas_semana_max":32,"num_periodos_min":10,"num_periodos_esperado":10,"num_periodos_max":14,"descricao":"Referente ao currículo 20221","ucs":{"BEG5303":{"codigo":"BEG5303","nome":"Biologia Celular Básica","ementa":"Níveis de organização da estrutura biológica. Noções básicas de microscopia de luz e eletrônica. Teoria celular. Organização geral das células procarióticas e eucarióticas. Organização estrutural e funcional das células eucarióticas animais. Ciclo celular.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"AGC7101 ou BEG5101 ou BEG5103 ou BEG5109 ou BEG7001","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BQA5124":{"codigo":"BQA5124","nome":"Bioquímica Aplicada a Enfermagem","ementa":"Importância química e biológica dos carbohidratos, lipídeos, proteínas, enzimas , vitaminas e coenzimas. Metabolismo dos carbohidratos, lipídeos e proteínas. Inter-relações e regulação metabólica do organismo. Energética Bioquímica do metabolismo.","carga_horaria":54,"fase_sugestao":1,"equivalencia":"BQA5114 ou CBV7104","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5153":{"codigo":"CFS5153","nome":"Fisiologia I","ementa":"Espectros eletromagnéticos, ultravioletas e infravermelhos. Radiobiologia: uso e higiene das radiações ionizantes e não ionizantes. Biofísica da água. Equilíbrio ácido básico. Homeostasia orgânica. Compartimentos líquidos corporais e edema. Estrutura da membrana, potenciais elétricos transmembrana. Propagação e transmissão sináptica de potenciais de ação. Junção Neuromuscular. Músculo esquelético e Músculo liso.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5221":{"codigo":"INT5221","nome":"Processo de Viver Humano I - Sociedade, Ambiente e Saúde","ementa":"O ser humano como ser multidimensional, em seu processo de viver histórico, social e culturalmente contextualizado, compreendido a partir de conceitos fundamentais e do \nreconhecimento das expressões e representações dos próprios indivíduos, grupos, raças e etnias. Os diferentes espaços deste viver na sociedade, especialmente a família, a \nescola, o trabalho e a comunidade. Determinação sócio ambiental e cultural do processo de viver humano. O processo saúde doença como componente deste viver histórico \nem suas múltiplas dimensões e em sua relação com o ambiente, raça, cultura e etnia, bem como em modos específicos de compreensão e explicação. O acadêmico na UFSC \ne no Curso de Enfermagem","carga_horaria":144,"fase_sugestao":1,"equivalencia":"INT5201 ou NFR5101","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"MOR5231":{"codigo":"MOR5231","nome":"Anatomia Aplicada a Enfermagem","ementa":"Introdução ao Estudo da Anatomia Humana. Anatomia sistêmica e descritiva. Sistema tegumentar. Sistema esquelético. Sistema articular. Sistema muscular. Sistema nervoso. Sistema endócrino. Sistema circulatório. Sistema respiratório. Sistema digestório. Sistema urinário. Sistema reprodutor masculino e feminino.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MOR5315":{"codigo":"MOR5315","nome":"Histologia","ementa":"Noções Básicas sobre Técnicas Histológicas de Rotina. Tipos de Tecidos Fundamentais. Estrutura e Funções Básicas dos Tecidos: Epitelial, Conjuntivo, Ósseo, Sangüíneo, Muscular e Nervoso, Processos de Ossificação. Histofisiologia dos Sistemas: Circulatório, Linfático, Digestório, Respiratório, Urinário, Endócrino, Reprodutor Masculino e Feminino.","carga_horaria":90,"fase_sugestao":1,"equivalencia":"CBV7604 e CBV7605 ou MOR5317","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5111":{"codigo":"NFR5111","nome":"Aprendizagem Vivencial I","ementa":"Dinâmicas de autoconhecimento, desenvolvimento de autopercepção com resgate da sua própria sensibilidade, ressignificando suas emoções e vivências.","carga_horaria":36,"fase_sugestao":1,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"CFS5154":{"codigo":"CFS5154","nome":"Fisiologia II","ementa":"Funções do Sistema Nervoso Central e Periférico, Sistema Somatossensorial, Somatomotor e Autônomo, Sistema Endócrino e Reprodutor; Funções do Sistema Cardiovascular, Sistema Respiratório, Sistema Urinário e Sistema Digestório.","carga_horaria":72,"fase_sugestao":2,"equivalencia":"","prerequisito":"CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5103":{"codigo":"FMC5103","nome":"Farmacologia I","ementa":"Conceitos e princípios básicos em Farmacologia. Farmacocinética: Vias de administração, absorção, distribuição, metabolização e eliminação de drogas no organismo. Farmacodinâmica: mecanismo de ação de drogas no organismo (Teoria dos receptores), agonistas e antagonistas. Farmacologia do sistema nervoso autônomo: bloqueadores neuromusculares, drogas colinérgicas e adrenérgicas. Fármacos que interferem com a dor e a inflamação. Fármacos que atuam no sistema cardiovascular. Fármacos Antineoplásicos. Fármacos Antimicrobianos. Fármacos que atuam no sistema gastrointestinal;","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124 e CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5222":{"codigo":"INT5222","nome":"Processo de Viver Humano II - as práticas de saúde","ementa":"Elementos para a compreensão das políticas de saúde em seus aspectos históricos e conceituais e para o desenvolvimentodas profissões de saúde nesta evolução e histórica. \nElementos para a compreensão do Sistema Único de Saúde e os serviços de saúde em sua configuração atual, no Brasil e em Santa Catarina. O trabalho da enfermagem nos diferentes campos de atuação e no contexto interdisciplinar. Diferentes paradigmas modos de intervenção sobre a saúde: a relação entre sistemas profissionais e não profissionais de atenção à saúde; fundamentos da educação e sua relação com a área da saúde; as bases da epidemiologia e da informação em saúde e sua aplicação no reconhecimento da situação de saúde-doença de grupos etnico-raciais, sociais e comunidade. Educação em saúde, educação ambiental, educação para as \nrelações etnico-raciais","carga_horaria":216,"fase_sugestao":2,"equivalencia":"INT5141 ou INT5202","prerequisito":"INT5201 ou INT5221","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"MIP5128":{"codigo":"MIP5128","nome":"Microbiologia","ementa":"Morfologia, fisiologia e genética das bactérias. Microbiota indígena. Antimicrobianos. Resistência bacteriana aos antibióticos. Infecções hospitalares. Características gerais dos vírus. Patogenia, isolamento, identificação, classificação, prevenção e controle das doenças infecciosas.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5200":{"codigo":"MIP5200","nome":"Imunologia","ementa":"Propriedades gerais do sistema imune, tecidos e órgão linfóides, imunidade inata e adaptativa, anticorpos (estrutura e função) complemento (vias e função), interações antígeno-anticorpo, imunoensaios para fins diagnósticos, complexo principal de histocompatibilidade e apresentação de antígeno, imunidade medida por células T, citocinas, hipersensibilidades, tumores, autoimunidade, transplante, resistência e imunização às doenças infecciosas.","carga_horaria":36,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"MIP5311":{"codigo":"MIP5311","nome":"Parasitologia","ementa":"Sistemática em parasitologia. Estudo geral dos protozoários,  helmintos e fungos parasitas humanos e artrópodes causadores e transmissores de doenças ao homem.","carga_horaria":54,"fase_sugestao":2,"equivalencia":"","prerequisito":"BQA5124 e CFS5153","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5409":{"codigo":"BEG5409","nome":"Genética","ementa":"A enfermagem e os conhecimentos científicos atuais na área de genética humana, no seu contexto histórico, social, cultural e ético. O papel da genética humana no entendimento dos processos de saúde-doença. Doenças genéticas e doenças com componentes genéticos: etiologia, diagnóstico, tratamento, aconselhamento genético, aspectos evolutivos, aspectos éticos. Novas tecnologias em genética: repercussões na profissão de enfermagem.","carga_horaria":36,"fase_sugestao":3,"equivalencia":"FIT5303","prerequisito":"CFS5153 e MOR5231","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"FMC5105":{"codigo":"FMC5105","nome":"Farmacologia II","ementa":": Discutir, de forma aplicada ao uso clínico e suas implicações para o cuidado de enfermagem, a farmacologia dos medicamentos utilizados para tratamento dos principais problemas de saúde, considerando as ações e efeitos e implicações (efeitos colaterais, indesejados e tóxicos)relacionadas a escolha ou contra-indicações de fármacos para o tratamento do idoso, da criança, do lactante e da gestante; fármacos utilizados nas dislipidemias; antiparasitários e antivirais; tratamento do diabetes mellitus com insulina e hipoglicemiantes orais e injetáveis; fármacos usados no hipo- e hiper-tireoidismo; agentes contraceptivos e sistema reprodutivo; fármacos que atuam no sistema nervoso central (ansiolíticos, antidepressivos, anticonvulsivantes, hipnosedativos, substâncias usadas em doenças neurodegenerativas e distúrbios psiquiátricos, anestésicos gerais, relaxantes musculares e analgésicos opióides)","carga_horaria":36,"fase_sugestao":3,"equivalencia":"FMC5104","prerequisito":"FMC5103","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5102":{"codigo":"NFR5102","nome":"Fundamentos para o Cuidado Profissional","ementa":"O conhecimento na história humana, em especial o conhecimento e o método científico. As bases e habilidades para a ação investigativa e sua vinculação com a formação e a prática profissional. O trabalho da enfermagem em seus aspectos históricos, conformação e determinantes atuais. As concepções teóricas metodológicas do trabalho de enfermagem nas especificidades do cuidar, gerenciar e educar. O cuidado profissional de enfermagem sob o olhar de diferentes teorias e compreendido a partir de referências sociológicas, psicológicas, antropológicas e históricas. O desenvolvimento de metodologias de cuidado de enfermagem. Semiologia e semiotécnica aplicadas ao cuidado de enfermagem. O desenvolvimento de procedimentos básicos para o cuidar. A ética e a bioética como exigência interdisciplinar no trabalho em saúde","carga_horaria":378,"fase_sugestao":3,"equivalencia":"NFR5105","prerequisito":"(CFS5154 e FMC5103 e INT5202) ou (INT5202 e MIP5128 e MOR5231) ou (CFS5154 e FMC5103 e INT5141 e MIP5128 e MOR5231) ou (CFS5154 e FMC5103 e INT5202 e MIP5128 e MOR5231) ou (CFS5154 e FMC5103 e INT5222 e MIP5128 e MOR5231)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5112":{"codigo":"NFR5112","nome":"Aprendizagem Vivencial II","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Relações interpessoais. Comunicação: fundamentos, comunicação verbal e não-verbal, barreiras da comunicação, a comunicação como instrumento terapêutico","carga_horaria":36,"fase_sugestao":3,"equivalencia":"","prerequisito":"NFR5111","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"BEG5203":{"codigo":"BEG5203","nome":"Embriologia","ementa":"Processos de gametogênese e de fecundação. Caracterização dos períodos do desenvolvimento humano: pré-embrionário, embrionário e fetal. Organização morfofuncional dos anexos embrionários. Estudo de malformações e de agentes teratogênicos. Morfogênese da face e membros. Desenvolvimento normal e anormal dos sistemas tegumentar, nervoso, locomotor, cardiovascular, digestivo, respiratório, urogenital e endócrino.","carga_horaria":36,"fase_sugestao":4,"equivalencia":"","prerequisito":"CFS5153 e MOR5231 e MOR5315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5223":{"codigo":"INT5223","nome":"O Cuidado do Processo de Viver Humano I - Condição Clínica de Saúde","ementa":"O cuidado de Enfermagem ao cliente adulto e idoso nas intercorrências clínicas, agudas e crônicas do processo de viver, considerando o contexto institucional, familiar e o itinerário terapêutico. Planejamento, implementação e avaliação do cuidado, em ações de promoção e recuperação da saúde, com o desenvolvimento de habilidades relacionadas a este cuidado","carga_horaria":252,"fase_sugestao":4,"equivalencia":"INT5203 ou NFR5106","prerequisito":"NFR5102 ou NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5160":{"codigo":"NFR5160","nome":"Sociedade, Saúde e Violência","ementa":"Direitos humanos e saúde. Expressões da violência na sociedade: cultura, gênero, raça e etnia. Repercussões da violência na saúde, na vida cotidiana. Necessidades e possibilidades de intervenção profissional nos casos de violência","carga_horaria":36,"fase_sugestao":4,"equivalencia":"NFR5161","prerequisito":"INT5202 ou INT5222","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5170":{"codigo":"NFR5170","nome":"Informática em Saúde","ementa":"Informática aplicada ao cuidado e a educação em saúde e enfermagem. Tecnologias emergentes aplicadas à Enfermagem. Sistemas Nacionais de Informação em Saúde e avaliação da informação. Padrões da Informação","carga_horaria":36,"fase_sugestao":4,"equivalencia":"NFR5171","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"PTL5117":{"codigo":"PTL5117","nome":"Patologia Geral","ementa":"Generalidades sobre Patologia: conceito saúde\/doença. Os grandes processos mórbidos (alterações celulares e extracelulares, distúrbios vasculares, processo \ninflamatório, distúrbios de crescimento e diferenciação)","carga_horaria":72,"fase_sugestao":4,"equivalencia":"","prerequisito":"CFS5153 e MOR5231 e MOR5315","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5224":{"codigo":"INT5224","nome":"O Cuidado no Processo de Viver Humano II - Condição Cirúrgica de Saúde","ementa":"O cuidado de enfermagem ao adulto e idoso nas intercorrências cirúrgicas, agudas e crônicas do processo de viver considerando o contexto institucional e familiar, bem como o itinerário terapêutico como o desenvolvimento de habilidades relacionadas a este cuidado. Sistematização da assistência de enfermagem em ações de promoção, \nrecuperação e reabilitação da saúde. Aspectos éticos e bioéticos no cuidado a pessoas em condição cirúrgica. Segurança do paciente","carga_horaria":216,"fase_sugestao":5,"equivalencia":"INT5204 e NFR5106","prerequisito":"INT5203 ou INT5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"INT5225":{"codigo":"INT5225","nome":"O Cuidado no Processo III - Condição Crítica de Saúde","ementa":"O cuidado de enfermagem ao adulto e idoso em condição grave de saúde, considerando o contexto institucional e familiar, em ambiente pré-hospitalar, de emergência e intensivo. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":216,"fase_sugestao":5,"equivalencia":"","prerequisito":"Inválida: INT5203 ou INT5223 e PTL5117 ou ","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5113":{"codigo":"NFR5113","nome":"Aprendizagem Vivencial III","ementa":"Grupo de reflexão como espaço de elaboração de tensões. Dilemas e conflitos gerados pelas atividades do curso. Enfrentamento de diversos limites e condições do trabalho profissional: finitude\/morte, eutanásia, doenças crônico-degenerativas. O cuidado de si \u0096 o profissional que cuida","carga_horaria":36,"fase_sugestao":5,"equivalencia":"","prerequisito":"NFR5112","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5226":{"codigo":"INT5226","nome":"O Cuidado no Processo de Viver Humano IV-Saúde da Mulher,do Neonato,da Criança e do Adolescente","ementa":"O cuidado de Enfermagem no contexto das políticas de atenção à saúde da criança, do adolescente, da mulher e da família, incluindo as perspectivas étnico-raciais e de gênero. A compreensão do nascimento como processo individual e social e o cuidado de enfermagem à família neste processo. O cuidado à criança, adolescente e sua família no processo de viver nas intercorrências clínicas agudas, prolongadas e crônicas, no contexto da atenção básica domiciliar e hospitalar, em ações de promoção, prevenção das intercorrências e recuperação da saúde. Ocuidado integral à mulher na atenção básica, domiciliar e hospitalar, em sua saúde reprodutiva. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":432,"fase_sugestao":6,"equivalencia":"","prerequisito":"(INT5203 ou INT5223) e (INT5204 ou INT5205 e INT5224 ou INT5225) ou (INT5203 e INT5204 e INT5205) ou (INT5223 e INT5224 e INT5225) ou (INT5223 e INT5224 e INT5225) ou (INT5203 e INT5205 e INT5224) ou (INT5203 e INT5204 e INT5225)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5173":{"codigo":"NFR5173","nome":"Corpo Gênero e Sexualidade","ementa":"O Corpo: dos gregos até a era pós-moderna; corpo e miscigenação no Brasil; História da Sexualidade; Da diferença sexual ao paradigma de gênero; Gênero e Sexualidade; Aspectos Multidimensionais da Sexualidade humana; Sexualidades: Construção do paradigma heterossexual, homossexualidade, Noções de aconselhamento sexual na consulta de Enfermagem","carga_horaria":36,"fase_sugestao":6,"equivalencia":"NFR5163","prerequisito":"INT5203 ou INT5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5227":{"codigo":"INT5227","nome":"O Cuidado no Processo de Viver V - Atenção Básica e Saúde Mental","ementa":"O Sistema Único de Saúde em seus modelos de gestão e assistência. A epidemiologia como base para o processo de planejamento local de saúde. O processo de distritalização da saúde. Determinação socioambiental e cultural do processo saúde-doença. Atenção Básica à saúde do indivíduo, família e comunidade considerando os aspectos étnicos-raciais e as questões dos direitos humanos. A educação popular e saúde e o controle social. Saúde mental e reforma psiquiátrica. O cuidado ao indivíduo, família e comunidade em ações de promoção e recuperação da saúde mental. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Sistematização da \nassistência de enfermagem. Segurança do paciente","carga_horaria":432,"fase_sugestao":7,"equivalencia":"INT5131 ou INT5132 ou INT5145 ou INT5207 ou NFR5212","prerequisito":"INT5206 ou INT5226","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5174":{"codigo":"NFR5174","nome":"Fenômeno Drogas","ementa":"Direitos humanos e saúde. Globalização e o fenômeno da violência e das drogas. Políticas sociais no campo da violência e drogas: internacional e nacional. Fatores relacionados ao consumo de drogas. Estereótipos, imagens e respostas sociais frente ao fenômeno das drogas. Drogas mais utilizadas em nosso meio. Uso e abuso de drogas. Álcool e comunidades indígenas. Segurança e drogas no campus.","carga_horaria":36,"fase_sugestao":7,"equivalencia":"NFR5164","prerequisito":"NFR5102 ou NFR5105","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5228":{"codigo":"INT5228","nome":"Gestão em Saúde e Enfermagem","ementa":"Fundamentos teórico-filosóficos da gestão\/administração e aplicação na organização da enfermagem e saúde. A gestão no contexto do SUS e no setor privado. O planejamento, a organização, a liderança e a avaliação em enfermagem e saúde. Gestão de sistemas e de organizações e gerência de unidades e serviços de enfermagem e \nsaúde nos diferentes níveis de complexidade. Gestão de recursos e do processo de trabalho em enfermagem e saúde. A construção de modelos e processos gerenciais em enfermagem. Práticas inovadoras em gerência de enfermagem. O processo investigativo em administração da saúde e enfermagem","carga_horaria":414,"fase_sugestao":8,"equivalencia":"INT5120 ou INT5132 ou INT5133 ou INT5146 ou INT5208","prerequisito":"INT5207 ou INT5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória","5":"Extensão"},"tipo_uc":"Disciplina"},"NFR5175":{"codigo":"NFR5175","nome":"Projetos de Investigação e Intervenção","ementa":"Elementos e etapas para a proposição e desenvolvimento de projetos de pesquisa e\/ou intervenção. A produção de conhecimentos e suas tendências atuais na área da saúde, em especial da enfermagem, no contexto técnico, ético, político e social do Brasil nos diferentes cenários assistenciais.","carga_horaria":36,"fase_sugestao":8,"equivalencia":"(NFR5166 e NFR5412) e (NFR5166 ou NFR5412)","prerequisito":"INT5207 ou INT5227","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5211":{"codigo":"INT5211","nome":"Estágio Supervisionado I","ementa":"Planejamento, execução e avaliação de projeto assistencial envolvendo as dimensões do cuidado, gerência e educação em enfermagem no processo de  \nviver humano, a indivíduos, famílias, grupos e comunidades, sob orientação de um docente, comsupervisão do enfermeiro em Instituição de atenção básica. Ética e bioética. Processo investigativo. Gestão do cuidado de enfermagem. Segurança do paciente","carga_horaria":486,"fase_sugestao":9,"equivalencia":"INT5161","prerequisito":"(BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5201 e INT5202 e INT5203 e INT5204 e INT5205 e INT5206 e INT5207 e INT5208 e INT5227 e INT5228 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5105 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117) ou (BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5221 e INT5222 e INT5223 e INT5224 e INT5225 e INT5226 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5102 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5181":{"codigo":"NFR5181","nome":"Trabalho de Conclusão de Curso I","ementa":"Desenvolvimento de projetos de pesquisa e\/ou intervenção: coleta e análise de dados..","carga_horaria":36,"fase_sugestao":9,"equivalencia":"","prerequisito":"(BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5201 e INT5202 e INT5203 e INT5204 e INT5205 e INT5206 e INT5207 e INT5208 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5105 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117) ou (BEG5203 e BEG5303 e BEG5409 e BQA5124 e CFS5153 e CFS5154 e FMC5103 e FMC5105 e INT5221 e INT5222 e INT5223 e INT5224 e INT5225 e INT5226 e INT5227 e INT5228 e MIP5128 e MIP5200 e MIP5311 e MOR5231 e MOR5315 e NFR5102 e NFR5111 e NFR5112 e NFR5113 e NFR5160 e NFR5170 e NFR5173 e NFR5174 e NFR5175 e PTL5117)","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"INT5212":{"codigo":"INT5212","nome":"Estágio Supervisionado II","ementa":"Planejamento, execução e avaliação de plano de atividades envolvendo as dimensões do cuidado, gerência e educação em enfermagem no processo de  \nviver humano, a indivíduos, famílias, grupos e comunidades, sob orientação de um docente, com supervisão de enfermeiros em instituição conveniada hospitalar. Gestão do cuidado de enfermagem. Sistematização da assistência de enfermagem. Segurança do paciente","carga_horaria":486,"fase_sugestao":10,"equivalencia":"INT5162","prerequisito":"INT5211 e NFR5181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"NFR5182":{"codigo":"NFR5182","nome":"Trabalho de Conclusão de Curso II","ementa":"Desenvolvimento de projetos de pesquisa e\/ou intervenções: elaboração de relatório final e divulgação dos resultados.","carga_horaria":36,"fase_sugestao":10,"equivalencia":"","prerequisito":"NFR5181","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"1":"Obrigatória"},"tipo_uc":"Disciplina"},"LSB7244":{"codigo":"LSB7244","nome":"Língua Brasileira de Sinais - Libras I","ementa":"Prática de conversação em Libras habilitando o aluno a se comunicar nível básico. Mitos e Crenças relacionadas à Língua Brasileira de Sinais (Libras) e aos Surdos. Noções sobre os estudos linguísticos das línguas de sinais em diferentes níveis da descrição linguística. Conceitos básicos da Língua Brasileira de Sinais como iconicidade e arbitrariedade e aspectos culturais e históricos específicos da comunidade surda brasileira. Educação de surdos, papéis dos professores e de intérpretes de libras-português em uma perspectiva inclusiva. Atividades de prática como componente curricular aplicadas à comunicação em Libras.","carga_horaria":72,"fase_sugestao":999,"equivalencia":"LSB7409","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa","3":"PCC"},"tipo_uc":"Disciplina"},"MIP5213":{"codigo":"MIP5213","nome":"Virologia Básica e Clínica","ementa":"Introdução aos vírus, suas naturezas, estruturas, genética e classificação; principais eventos envolvidos na replicação viral: principais estratégias de replicação dos vírus de genoma DNA e RNA; vírus que causam câncer e os mecanismos utilizados para este fim (polioma, herpes, papiloma, hepatite, adenovírus); vírus de RNA que causam câncer (retrovírus); biologia do HIV; medicamentos com ação antiviral; vírus de genoma RNA de transmissão fecal-oral causadores de infecções, incluindo norovírus, rotavírus, astrovírus, enterovírus, vírus da hepatite A e E; vírus do trato respiratório superior (rinovírus) e vírus da síndrome respiratória aguda (SARS). Estrutura dos vírus herpéticos: as doenças causadas pelos vírus herpes simplex tipos 1 e 2, citomegalovírus, vírus da varicella zoster, vírus Epstein-barr e outros vírus herpéticos; defesas específicas e não específicas do hospedeiro envolvidas na resistência e na recuperação das infecções virais; estrutura e propriedades dos vírus do sarampo, caxumba, influenza e rubéola: patogênese e doença, prevenção e tratamento; estrutura e replicação dos vírus causadores das hepatites B e C; rabdovírus e raiva; arbovírus e hantavírus causadores de encefalites febris, hemorrágicas; doenças hemorrágicas com síndromes renal e pulmonar.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"MIP9108":{"codigo":"MIP9108","nome":"Diagnóstico Imuno-Molecular em Parasitologia","ementa":"Estudo de métodos indiretos de diagnóstico de parasitoses. Coleta, preparação e conservação do material biológico. Aplicação de técnicas imunológicas e moleculares para o diagnóstico de parasitos de importância para humanos e veterinária.","carga_horaria":54,"fase_sugestao":999,"equivalencia":"","prerequisito":"MIP5311","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5128":{"codigo":"NFR5128","nome":"Enfermagem em Primeiros Socorros","ementa":"Princípios gerais de primeiros socorros. Medidas de acidentes. Ações imediatas e mediatas do socorrista em situações de emergência e\/ou urgência. Primeiros socorros em situações de emergência e\/ou urgência.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5167":{"codigo":"NFR5167","nome":"Plantas Medicinais nas Práticas de Saúde","ementa":"As plantas medicinais na história do cuidado humano. O rito do chá. Plantas medicinais e o meio ambiente. Espécies do repertório popular. Cuidados com o cultivo, coleta, secagem, acondicionamento e preparação populares. Noções sobre substâncias bioativas. Interações planta\/medicamento e plantas tóxicas. Legislação que regulamenta o uso de plantas medicinais e políticas públicas para implementações de farmácias vivas","carga_horaria":36,"fase_sugestao":999,"equivalencia":"SPB7010","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5168":{"codigo":"NFR5168","nome":"Terapias Corporais","ementa":"O corpo como espelho da mente. Principais tiposde massagens terapêuticas. A dança como técnica de equilíbrio mente-corpo; relaxamento físico-mental; terapia reflexológica; artes marciais e yoga.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5169":{"codigo":"NFR5169","nome":"Mercado de Trabalho em Enfermagem e Novas Modalidades de Prestação de Serviço","ementa":"Fundamentos teóricos e metodológicos sobre estudos e pesquisas de mercado de trabalho. O mercado de Trabalho na Enfermagem e na Saúde. Caracterização de serviços e novas modalidades de organização dos serviços em saúde e enfermagem. Noções de empreendedorismo em saúde. Noções de custos em Saúde. As cooperativas em saúde. As seguradoras em saúde. Controle financeiro e da qualidade da prestação dos serviços de saúde. Aspectos legais e organizacionais de projetos de criação e implementação de uma empresa prestadora de serviços.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5307":{"codigo":"NFR5307","nome":"Enfermagem Gerontogeriatrica","ementa":"O processo de envelhecimento humano no contexto da transição demográfica \/epidemiológica e suas consequências para a sociedade. Fundamentação Gerontogeriátrica. Aspectos bio-psicossocial cultural do envelhecimento humano. A especificidade da assistência de enfermagem gerontogeriátrica. Políticas públicas de saúde, serviços, programas e tecnologias para a assistência ao idoso e sua família no contexto comunitário e institucional.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5308":{"codigo":"NFR5308","nome":"Enfermagem em Oncologia","ementa":"Considerações gerais em oncologia; Epidemiologia; Prevenção, promoção, tratamento, reabilitação e cuidados de enfermagem na atenção oncológica. Políticas de saúde. O cuidado ao cliente adulto e pediátrico e família no contexto da oncologia. Cuidando do cuidador em oncologia. Os sobreviventes em oncologia","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"INT5203 ou INT5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR7005":{"codigo":"NFR7005","nome":"Enfermagem Dermatológica","ementa":"Bases teóricas e práticas para o cuidado com a pele, no adulto e idoso em condição \ncrônica. Aprimoramento do conhecimento do estudante de graduação em enfermagem \npara a assistência à pessoa considerando a prevenção de lesões, os cuidados na \nrecuperação tecidual e a reabilitação nos distintos espaços da rede de atenção do Sistema \nÚnico de Saúde (SUS), tendo como base a aplicação do conhecimento para a utilização \nde tecnologias leve e duras. Discussão de aspectos éticos no cuidado, na documentação \nfotográfica e divulgação\/utilização dessas informações. Aplicação das etapas do processo \nde enfermagem na prevenção, recuperação tecidual e reabilitação da pele humana.","carga_horaria":36,"fase_sugestao":999,"equivalencia":"","prerequisito":"INT5203 ou INT5223","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5421":{"codigo":"NFR5421","nome":"Atividade Extracurricular: Monitoria","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5422":{"codigo":"NFR5422","nome":"Atividade Extracurricular: Estágio","ementa":"","carga_horaria":72,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5423":{"codigo":"NFR5423","nome":"Programa de Intercâmbio I","ementa":"Participação em programa de Intercâmbio Acadêmico decorrente de convênio assinado com Instituições de Ensino Superior, Agências de Fometo, Centros de Pesquisa, e instituições semelhantes, visando a realização de atividades acadêmicas como cursos, estágios  e pesquisas orientadas ao aprimoramento da formação do aluno, devidamente aprovadas pelo Colegiado do Curso.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5424":{"codigo":"NFR5424","nome":"Programa de Intercâmbio II","ementa":"Continuidade da participação em Programa de Intercâmbio Acadêmico visando a realização de cursos, estágios e pesquisas orientados ao aprimoramento da formação do aluno.","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5423","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"},"NFR5428":{"codigo":"NFR5428","nome":"Programa de Intercâmbio III","ementa":"","carga_horaria":0,"fase_sugestao":999,"equivalencia":"","prerequisito":"NFR5424","prerequisito_criterio_id":0,"prerequisito_carga_horaria":0,"correquisito":"","etiquetas":{"2":"Optativa"},"tipo_uc":"Disciplina"}}}}}